{
    "url": "",
    "publication_date": "",
    "title": "Fuzzy logic based MPPT control for a PV system using SEPIC converter",
    "authors": [
        "Moulay Abdellah Alhachemi",
        "Mohammed Habbab",
        "Abdeldjebar Hazzab",
        "Mansour Becahr",
        "Hicham Gouabi"
    ],
    "institutes": [
        "Laboratory of CAOSEE",
        "École de Technologie Supérieure",
        "Université Tahri Mohamed",
        "Université Tahri Mohamed (ETS)",
        "1100 Notre-dame Bechar, Algeria",
        "Bechar, Algeria",
        "Montréal, Canada"
    ],
    "keywords": [
        "Fuzzy logic controller (FLC)",
        "Maximum power point tracker (MPPT)",
        "Photovoltaic (PV)"
    ],
    "abstract": "In this study, a novel single-ended primary inductor (SEPIC) converter-based fuzzy logic controller for maximum power point tracking is presented. By adding rules to the perturb and observing search strategy, the new controller enhances it while fuzzifying and removing its flaws. When compared to traditional maximum power point tracking techniques, fuzzy logic trackers enable an accurate and quick convergence to maximum power point under both steady-state and variable weather situations. The performance of the proposed maximum power point tracker is demonstrated in simulation.",
    "content": "introduction the energy sources are rapidly running while the electricity demand is increasing to solve this efficient and efficient electric power generation from renewable energy sources is required renewable energy is one of the forms of energy that society can rely on because it is and has no one type of power generation that uses renewable energy is the photovoltaic system to utilize less conventional the pv system must subsequently be linked to the either directly or via a backup battery since the power produced by pv systems depends on radiation and temperature the pv framework has destitute for the control of the pv there are different sorts of converters such as buck boost and due to its output a converter acts as a where it changes its output voltage agreeing to its duty unlike the customary the sepic converter includes a output and it uses an arrangement capacitor to separate input from output the buck and converters lose half of their input control due to input current arrangement for that the two types of converters should be excluded from maximum power the boost converter has a nonstop input but the output voltage is always bigger than the which may not accomplish maximum power exchange operation in a few such as when the maximum voltage is less than the input this paper presents a strategy for an mppt standalone pv the proposed mppt can abuse the preferences of the strategy and eliminate its output has been separated into five fuzzy as the proposed strategy continuously exchanges maximum power from pv it optimizes the number of pv modelign of pv system photovoltaic is the technique and study connected to devices that directly convert sunlight into electricity utilizing photovoltaic direct conversion of solar energy into dc electrical energy can be achieved by photovoltaic cells the photovoltaic panel is made up of numerous cells that are connected in series ns or shunt where it may be mimicked by a current source coupled in parallel with a diode as described by and depicted in figure circuit for a pv the following equations provide the output i iph id i iph akbt rsh iph photo current a ideality factor kb constant of boltzmann t cell temperature id current via a diode rs series resistance current of saturation q electronic charge rsh shunt resistance v cell voltage i current of cell the shunt resistance is typically orders of magnitude larger than the series resistance it is common for the shunt and series resistances of a solar cell can be neglected to simplify the the resulting ideal current characteristic of the solar cell is given by equation i iph sepic converter power electronics researchers are working hard to create dc converters with simpler designs and greater efficiency to maintain a constant output the suggested converter employs a converter the sepic converter is made up of a duty cycle switch a two inductors and two capacitors and and a load figure depicts the circuit diagram of a sepic a sepic is a converter sepic are converters that can output voltages that are larger or equal to the input the duty cycle of the control transistor affects the sepic output the sepic converter is two converters in a boost converter followed by a it has the advantages of having a output output voltage has the same polarity as the input using a series capacitor to couple energy from the input to the output makes it more responsive to and being able to shut down when the switch is turned the output voltage drops to accompanied by a significant transient discharge of simple circuit diagram of the sepic converter figure depicts the circuit when the power switch is switched on and off figures a and figure when the switch is the first is charged from the input voltage the second inductor absorbs energy from the first capacitor leaving the output capacitor to supply the load the switch turned the switch turned equivalent circuit diagram of the sepic converter when the switch is on and when the switch is turned the input inductor is charged from the and the second inductor is charged from the first no energy is supplied to the load capacitor during this the inductor current and capacitor voltage polarities are marked in this when the power switch is turned the energy stored in the inductor is the energy stored is transferred through the diode and supplies the energy to the load as shown in figure the second inductor is also connected to the load during this the output capacitor sees a pulse of current during the off making it inherently noisier than a buck the amount that the sepic converters increase or decrease the voltage depends primarily on the duty cycle and the parasitic elements in the the output of an ideal sepic converter vout d vin a sepic converter is to process the electricity from the pv this converter either increases or decreases the pv system voltage at the the proposed sepic converter operates in buck fuzzy logic control in the fuzzy logic maximum power point tracking the voltage and current at each instant k are measured to calculate the active the active power is then compared with the power at the previous instant to obtain the change in power the voltage at instant k is compared with the voltage at instant to obtain the voltage error the power error is then divided by the current error to obtain the error the error is then compared with the previous error to calculate the change in error the error and the change in error are then used as the crisp inputs to the fuzzy logic the flow chart for the fuzzy logic mppt algorithm is shown in figure in this the mamdani inference type membership and a rule base were used for the fuzzy logic the mamdani inference technique is efficient and straightforward in defining the fuzzy output and it is more popular among researchers than other inference techniques the or triangular membership function is used because it is simpler to split into low and high membership functions than other membership it has been observed that the triangular membership function has a faster response and less overshoot than other functions a rule base was used because it has been shown to perform well fuzzy logic maximum power point tracking flow the following are the fuzzy rules in table which are used for the desired mpp of converter the membership for input variables are shown in figure and the membership for output variable is shown in figure all the functions are defined on a normalized interval fuzzy logic rules for the negative negative positive positive nb ns ze ps pb nb ps nb nb nb ns ns ps ps ns ns ns ze ze ze ze ze ze ps ns ns ps ps ps pb ns nb pb pb ps membership for input membership for output simulation results the characteristics of the photovoltaic array that we use in this paper are given in table electrical data of photovoltaic variable value maximum power pmax w open circuit voltage voc v short circuit current isc a voltage at maximum power vmax v current at maximum power imax a table shows the sepic converter settings utilized in this the sepic converter is linked to the pv panel in the full and the duty cycle is regulated by the fuzzy logic the sepic converter variable value switching frequency khz load resistance ω inductance mh inductance mh capacitor µf capacitor µf the results are provided under standard test and it is shown in figure and power output at and using mppt and fuzzy logic to a sepic converter for a pv system result in considerable performance increased power higher decreased enhanced transient and resilience are examples of these conclusions this paper presents the design of an photovoltaic system with a fuzzy logic boost the proposed system was simulated in and tested under various weather the results showed that the fuzzy logic algorithm outperformed the conventional algorithms in terms of mppt accuracy and minimization of regardless of rapid changes in",
    "references": [
        "[1] G. Mahendran, and KV. Kandaswamy. Ant Colony Optimized Tuned DC-DC converter. International Journal of Computer Applications (0975–8887) 108.11 (2013): 45-50. ",
        "[2] J. Dunia, and BMM Mwinyiwiwa. Performance Comparison between ĆUK and SEPIC Converters for Maximum Power Point Tracking Using Incremental Conductance Technique in Solar Power Applications. International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 7.12 (2013): 2510-2517. ",
        "[3] M. Cirrincione, M. Pucci, and G. Vitale, Growing Neural Gas (GNG)- Based Maximum Power Point Tracking for High-Performance Wind Generator With an Induction Machine. IEEE Transactions on Industry Applications 47.2 (2011): 861-872. ",
        "[4] M. Abdulkadir, AS. Samosir, S., and AHN. Yatim. Modeling and Simulation of a Solar Photovoltaic System, Its Dynamics and Transient Characteristics in LABVIEW.\" International Journal of Power Electronics and Drive System (IJPEDS) 3.2 (2013): 185-192. ",
        "[5] H. Bouzeria, C. Fetha, T. Bahi, I. Abadlia, Z. Layate, and S. Lekhchine. Fuzzy Logic Space Vector Direct Torque Control of PMSM for Photovoltaic Water Pumping System. Energy Procedia 74 (2015): 760- 771. ",
        "[6] YM. Chen, YC. Liu, SC. Hung, and CS. Cheng. Multi-Input Inverter for Grid-Connected Hybrid PV/Wind Power System. IEEE Transactions on Power Electronics 22.3 (2007): 742-750. ",
        "[7] S. Ganesh, J. Janani, and GB. Angel. A Maximum Power Point Tracker for PV Panels Using SEPIC Converter.International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 8.2 (2014): 637-642. ",
        "[8] R. Vijayabalan, and S. Ravivarman. Z Source Inverter for Photovoltaic System with Fuzzy Logic Controller. International Journal of Power Electronics and Drive System (IJPEDS) 2.4 (2012): 371-379. ",
        "[9] A. Ramkumar, and SVS. Florence. \"Analysis of Single Phase AC-DC SEPIC Converter using Closed Loop Techniques. International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering 4.2 (2015): 193-201. ",
        "[10] G. Tadi, and P. Ramamurthyraju. Analysis of SEPIC for PV- Applications using PI Controller and Current Mode Control.\" International Journal for Scientific Research & Development 1.9 (2013): 175-180. ",
        "[11] J. Li, and H. Wang. A novel stand-alone PV generation system based on variable step size INC MPPT and SVPWM control.\" In Proceedings of the 2009 IEEE 6th International Power Electronics and Motion Control Conference, Wuhan, China, 17-20 May 2009. pp. 2155-2160. ",
        "[12] C. Wang. A Study of Membership Functions on Mamdani-Type Fuzzy Inference System for Industrial Decision-Making. Master's thesis, Lehigh University, Bethlehem, PA, USA, 2015. ",
        "[13] MA. Usta, Ö. Akyazi, and İH. Altaş. Design and performance of solar tracking system with fuzzy logic controller used different membership functions. In Proceedings of the 2011 7th International Conference on Electrical and Electronics Engineering (ELECO), Bursa, Turkey, 1-4 December 2011. pp. II-381-II-385.Mudi, R.K.; Pal, N.R. A robust self- tuning scheme for PI-and PD-type fuzzy controllers. IEEE Trans. Fuzzy Syst. 1999, 7, 2–16. ",
        "[14] RK. Mudi, and NR. Pal. A robust self-tuning scheme for PI- and PD- type fuzzy controllers. IEEE Transactions on Fuzzy Systems 7.1 (1999): 2-16. ",
        "[15] A. Shehata, H. Metered, and WAH. Oraby. Vibration control of active vehicle suspension system using fuzzy logic controller. In Vibration Engineering and Technology of Machinery, edited by W. A. Oraby, 389- 399. Springer, Berlin, Heidelberg, 2015."
    ]
}