{
    "info": {
        "title": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "authors": [
            "Ed Wilson Júnior",
            "Kleinner Farias"
        ],
        "institutes": [
            "Universidade do Vale do Rio dos Sinos São Leopoldo, Rio Grande do Sul, Brazil",
            "Universidade do Vale do Rio dos Sinos São Leopoldo, Rio Grande do Sul, Brazil"
        ],
        "keywords": [
            "Model design",
            "learning model",
            "Gamification"
        ],
        "abstract": "Gamification has been adopted in software development tasks in recent years. This adoption seeks, for example, to improve the engagement of developers while creating UML models or writing code. Empirical studies report that UML models suffer from incompleteness and inconsistency problems. This study conjectures that gamification mechanics can improve learner engagement while learning software modeling, mitigating such problems concerning UML models. The current literature lacks studies that explore gamification and UML model quality in the context of software modeling learning. This article, therefore, proposes ModelGame, which is a quality model to support software modeling learning in a gamified way. It serves as a reference framework so that instructors can obtain a parameterized way to evaluate UML models created by learners. The quality of UML models can be improved by applying gamified activities and providing guidelines aware of quality issues."
    },
    "sections": {},
    "references": [
        "[1] Rick Adcock, Edward Alef, Bruce Amato, Mark Ardis, Larry Bernstein, Barry Boehm, Pierre Bourque, John Brackett, Murray Cantor, Lillian Cassel, et al. 2009. Curriculum guidelines for graduate degree programs in software engineering. ACM. ",
        "[2] Mark Ardis, David Budgen, Gregory W Hislop, Jeff Offutt, Mark Sebern, and Willem Visser. 2015. SE 2014: Curriculum guidelines for undergraduate degree programs in software engineering. Computer 48, 11 (2015), 106109. ",
        "[3] Valerio Cosentino, Sébastien Gérard, and Jordi Cabot Sagrera. 2017. A model based approach to gamify the learning of modeling. CEUR Workshop Proceed ings. ",
        "[4] Daniel de Paula Porto, Gabriela Martins de Jesus, Fabiano Cutigi Ferrari, and Sandra Camargo Pinto Ferraz Fabbri. 2021. Initiatives and challenges of using gamification in software engineering: A Systematic Mapping. Journal of Systems and Software 173 (2021), 110870. ",
        "[5] Sebastian Deterding, Miguel Sicart, Lennart Nacke, Kenton OHara, and Dan Dixon. 2011. Gamification. using gamedesign elements in nongaming contexts. In CHI11 extended abstracts on human factors in computing systems. 24252428. ",
        "[6] Ana FernándezSaez et al. 2012. A systematic literature review on the quality of UML models. J. Data. Manage 22, 3 (2012), 4670. ",
        "[7] Kleinner Farias et al. 2012. Evaluating the impact of aspects on inconsistency detection effort: a controlled experiment. In International Conference on Model Driven Engineering Languages and Systems. Springer, 219234. ",
        "[8] Kleinner Frias et al. 2014. Towards a quality model for model composition effort. In 29th Annual ACM Symposium on Applied Computing. 11811183. ",
        "[9] Kleinner Farias et al. 2015. Evaluating the effort of composing design models: a controlled experiment. Software & Systems Modeling 14, 4 (2015), 13491365. ",
        "[10] Kleinner Farias et al. 2019. UML2Merge: a UML extension for model merging. IET Software 13, 6 (2019), 575586. ",
        "[11] Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work? a literature review of empirical studies on gamification. In 2014 47th Hawaii international conference on system sciences. Ieee, 30253034. ",
        "[12] Mantas Jurgelaitis, Vaidotas Drungilas, and Lina Čeponiene. 2018. Gamified Moodle course for teaching UML. Baltic journal of modern computing 6, 2 (2018), 119127. ",
        "[13] Barbara A Kitchenham and Shari L Pfleeger. 2008. Personal opinion surveys. In Guide to advanced empirical software engineering. Springer, 6392. ",
        "[14] Christian Franz Josef Lange. 2007. Assessing and Improving the Quality of Modeling: A series of Empirical Studies about the UML. (2007). ",
        "[15] Odd Ivar Lindland, Guttorm Sindre, and Arne Solvberg. 1994. Understanding quality in conceptual modeling. IEEE software 11, 2 (1994), 4249. ",
        "[16] Nikola Marangunić and Andrina Granić. 2015. Technology acceptance model: a literature review from 1986 to 2013. Universal access in the information society 14, 1 (2015), 8195. 108",
        "[17] Beatriz Marín. 2021. Lessons Learned About Gamification in Software Engineer ing Education. In Latin American Women and Research Contributions to the IT Field. IGI Global, 174197. ",
        "[18] Kleinner Oliveira, Alessandro Garcia, and Jon Whittle. 2008. On the quantitative assessment of class model compositions: An exploratory study. 1th ESMDE at MODELS (2008). ",
        "[19] OMG. 2017. UML: Infrastructure specification. https://www.omg.org/spec/UML/2.5.1/PDF. ",
        "[20] Sofia Ouhbi and Nuno Pombo. 2020. Software Engineering Education: Challenges and Perspectives. In IEEE Global Engineering Education Conference. 202209. ",
        "[21] Oscar Pedreira, Félix García, Nieves Brisaboa, and Mario Piattini. 2015. Gamifica tion in software engineeringA systematic mapping. Information and software technology 57 (2015), 157168. ",
        "[22] Pedro Rodrigues, Mauricio Souza, and Eduardo Figueiredo. 2018. Games and gamification in software engineering education: A survey with educators. In 2018 IEEE Frontiers in Education Conference (FIE). IEEE, 19. ",
        "[23] Kevin Werbach and Dan Hunter. 2012. For the win: How game thinking can revolutionize your business. Wharton digital press. ",
        "[24] Claes Wohlin, Per Runeson, Martin Höst, Magnus C Ohlsson, Björn Regnell, and Anders Wesslén. 2012. Experimentation in software engineering. Springer Science & Business Media. ",
        "[25] Alfa Yohannis. 2016. Gamification of Software Modelling Learning.. In DS@ MoDELS. 109"
    ]
}