[
    {
        "element_id": "ed650a0a-d453-498c-a0fa-948b2b4b6b51",
        "metadata": {},
        "text": "Check for updates.",
        "type": "Title"
    },
    {
        "element_id": "65d38db8-6530-40b8-b9d9-7dbab76f7abe",
        "metadata": {},
        "text": "The Programmer’s Assistant: Conversational Interaction with a Large Language Model for Software Development",
        "type": "UncategorizedText"
    },
    {
        "element_id": "50b27ef5-39bd-46bd-a863-d396246702e9",
        "metadata": {},
        "text": "Fernando Martinez",
        "type": "Title"
    },
    {
        "element_id": "496d1807-52c6-4cda-b359-8f4e665a0f64",
        "metadata": {},
        "text": "BM Argentina",
        "type": "Title"
    },
    {
        "element_id": "c084df45-b250-4ce7-99c3-35b60257ad98",
        "metadata": {},
        "text": "La Plata, Buenos Aires, Argentina martferc@ar.ibm.com",
        "type": "Title"
    },
    {
        "element_id": "e2727ba2-ab4a-41f1-bc0d-83f89a8578bf",
        "metadata": {},
        "text": "Steven I. Ross IBM Research AI Cambridge, MA, USA steven_ross@us.ibm.com",
        "type": "Title"
    },
    {
        "element_id": "41bbea79-f90a-462c-985a-3dd1f68b2aac",
        "metadata": {},
        "text": "Stephanie Houde IBM Research AI Cambridge, MA, USA Stephanie. Houde@ibm.com",
        "type": "Title"
    },
    {
        "element_id": "ea13d530-ac12-4b93-a513-6824cfea6024",
        "metadata": {},
        "text": "Michael Muller",
        "type": "Title"
    },
    {
        "element_id": "3bc0657d-277e-477e-aa4b-5e8370d078de",
        "metadata": {},
        "text": "BM Research AI Cambridge, MA, USA",
        "type": "Title"
    },
    {
        "element_id": "0b3a1b32-61e9-43a1-98d8-d9745e337065",
        "metadata": {},
        "text": "michael_muller@us.ibm.com",
        "type": "EmailAddress"
    },
    {
        "element_id": "8f537d56-8dc0-47b5-8856-8726c8ba399c",
        "metadata": {},
        "text": "ABSTRACT",
        "type": "Title"
    },
    {
        "element_id": "ca124667-cf9b-436b-acb9-49cfc0fab3e3",
        "metadata": {},
        "text": "Large language models (LLMs) have recently been applied in soft- ware engineering to perform tasks such as translating code between programming languages, generating code from natural language, and autocompleting code as it is being written. When used within development tools, these systems typically treat each model in- vocation independently from all previous invocations, and only a specific limited functionality is exposed within the user interface. This approach to user interaction misses an opportunity for users to more deeply engage with the model by having the context of their previous interactions, as well as the context of their code, inform the model’s responses. We developed a prototype system — the Programmer’s Assistant — in order to explore the utility of conversational interactions grounded in code, as well as software engineers’ receptiveness to the idea of conversing with, rather than invoking, a code-fluent LLM. Through an evaluation with 42 partici- pants with varied levels of programming experience, we found that our system was capable of conducting extended, multi-turn discus- sions, and that it enabled additional knowledge and capabilities beyond code generation to emerge from the LLM. Despite skepti- cal initial expectations for conversational programming assistance, participants were impressed by the breadth of the assistant’s capa- bilities, the quality of its responses, and its potential for improving their productivity. Our work demonstrates the unique potential of conversational interactions with LLMs for co-creative processes like software development.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6c529f22-d41c-4619-8228-a04577b5602c",
        "metadata": {},
        "text": "CCS CONCEPTS",
        "type": "Title"
    },
    {
        "element_id": "61464e68-4b5a-4706-b219-ee41556dcd3d",
        "metadata": {},
        "text": "+- Human-centered computing — HCI theory, concepts and models; - Software and its engineering — Designing software; + Computing methodologies — Generative and developmental approaches.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f146136a-2b48-4391-b5f9-64978b82b19a",
        "metadata": {},
        "text": "This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs International 4.0 License.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ed615467-b56d-4136-ae8c-65e79e971d2c",
        "metadata": {},
        "text": "IUI '23, March 27-31, 2023, Sydney, NSW, Australia © 2023 Copyright held by the owner/author(s). ACM ISBN 979-8-4007-0106-1/23/03. https://doi.org/10.1145/3581641.3584037",
        "type": "UncategorizedText"
    },
    {
        "element_id": "092b988d-219f-4fba-bbe9-996a3cd75d51",
        "metadata": {},
        "text": "491",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e7ed7286-82b0-46bf-a910-3e7946f60b6e",
        "metadata": {},
        "text": "Justin D. Weisz",
        "type": "Title"
    },
    {
        "element_id": "2956960e-cd57-48a9-bb1d-f24a4b61cd1a",
        "metadata": {},
        "text": "BM Research AI",
        "type": "Title"
    },
    {
        "element_id": "63cc457e-a615-457e-b96f-7545f20dde59",
        "metadata": {},
        "text": "Yorktown Heights, NY, USA jweisz@us.ibm.com",
        "type": "Title"
    },
    {
        "element_id": "ec625fb9-1126-4959-82b7-93d410e4b18e",
        "metadata": {},
        "text": "KEYWORDS",
        "type": "Title"
    },
    {
        "element_id": "c1b6fbfd-d953-4ef4-a151-16b6fb8a466c",
        "metadata": {},
        "text": "code-fluent large language models, foundation models, conversa- tional interaction, human-centered AI",
        "type": "Title"
    },
    {
        "element_id": "998761d3-ff66-436d-b537-6143a85ac293",
        "metadata": {},
        "text": "ACM Reference Format:",
        "type": "Title"
    },
    {
        "element_id": "23e13997-2200-4da6-9bf9-d4f73da095b9",
        "metadata": {},
        "text": "Steven I. Ross, Fernando Martinez, Stephanie Houde, Michael Muller, and Justin D. Weisz. 2023. The Programmer’s Assistant: Conversational Interaction with a Large Language Model for Software Development. In 28th Inter- national Conference on Intelligent User Interfaces (IUI ’23), March 27-31, 2023, Sydney, NSW, Australia. ACM, New York, NY, USA, 24 pages. https: //doi.org/10.1145/3581641.3584037",
        "type": "NarrativeText"
    },
    {
        "element_id": "a8912b33-4793-4344-bd8b-115153481c30",
        "metadata": {},
        "text": "1 INTRODUCTION",
        "type": "Title"
    },
    {
        "element_id": "bcdf5450-d486-434e-a10a-fedfc1e1d3c0",
        "metadata": {},
        "text": "Software development is a highly skilled task that requires knowl- edge, focus, and creativity [27, 28]. Many techniques have been developed to enhance the productivity of software engineers, such as advanced code repositories [86], knowledge repositories [39], Q&A sites [1], and pair programming practices [18]. Collaborative software engineering is especially promising, given that profes- sional software development is rarely a solo activity and relevant knowledge and expertise are typically distributed widely within an organization [68]. Many efforts have focused on incorporating col- laborative technologies into software development environments (e.g. [8, 25, 26, 58, 101]).",
        "type": "NarrativeText"
    },
    {
        "element_id": "5ac48a55-30b9-4064-b385-eec632c75952",
        "metadata": {},
        "text": "The pioneering work of Rich and Waters on The Programmer’s Apprentice [70] presented a novel concept of a knowledgeable auto- mated assistant — in effect, an artificial collaborative partner — that could help software engineers with writing code, designing soft- ware systems, and creating requirements specifications. At the time, AI technologies and computing resources were not sufficient to fully implement their vision. In the intervening years, an increase in computational power, the availability of large corpora of language and code data, and the development of deep neural networks have made new approaches to achieving their goals worth exploring.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bb10f06f-c9a6-4303-9f53-700f7c664c1f",
        "metadata": {},
        "text": "Recently, models leveraging the transformer architecture [96] have been developed to perform domain-specific software engi- neering tasks, such as translating code between languages [75], generating documentation for code [36, 38, 97, 98], and generating unit tests for code [92] (see Talamadupula [90] and Allamanis et al. [5] for surveys). Recently developed foundation models — large language models that can be adapted to multiple tasks and which exhibit emergent behaviors for which they have not been explic- itly trained [14] — have also proven to be capable with source code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a83b9d66-5d99-45ac-b2ef-4d718615b81f",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "fc4fd953-0442-4b58-af94-a5bc17921f06",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "fb1596e6-45eb-47c1-a206-eac0a5952f84",
        "metadata": {},
        "text": "While the intent of training LLMs such as GPT-2 [64] and GPT-3 [17] was to give them mastery of natural language, it quickly became apparent that the presence of code in their training corpora had given them the ability to generate code based on natural language descriptions [49]. The Codex model [24] was then produced by fine- tuning GPT-3 on a large corpus of source code data, leading to the development of Copilot [32], a tool that helps software engineers by autocompleting code as it is being written. Experimentation with Copilot has shown its ability to perform additional tasks, such as explaining code, generating documentation, and translating code between languages [6].",
        "type": "NarrativeText"
    },
    {
        "element_id": "364864d4-cb44-49e4-9d0a-1d806e10d3f2",
        "metadata": {},
        "text": "Although autocompletion interfaces are useful and valuable when the system can discern the developer’s intent, there are many instances where that is insufficient. For example, the developer may have a good idea of what they want to do, but may be unclear on what functions, libraries, or even algorithms to employ. They",
        "type": "NarrativeText"
    },
    {
        "element_id": "24f7aa77-7a40-4ad4-a5cc-8dce5a3d2299",
        "metadata": {},
        "text": "may even have general programming questions that need to be answered before they are able to write any code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e51e5f39-2769-4770-a3e2-80a758d383d5",
        "metadata": {},
        "text": "In this paper, we seek to understand whether modern develop- ments in code-fluent foundation models — large language models that have been fine-tuned on source code data — are sufficient to support a conversational agent that can act as an assistant in the software development process. We developed the Programmer’s Assistant to explore the capabilities that conversational interaction could enable and the extent to which users would find conversa- tional assistance with programming tasks desirable and useful.",
        "type": "NarrativeText"
    },
    {
        "element_id": "48714f06-402a-4a4c-bd97-f2839769ed41",
        "metadata": {},
        "text": "We hypothesize that a conversational system may provide a flexible and natural means for interacting with a code-fluent LLM. Conversational interaction could enable users to pursue their ques- tions in a multiple exchange dialog (as observed by Barke et al. [13]) that allows them to ask follow-up questions and refine their inquiries. A conversational programming assistant could ask the user clarifying or disambiguating questions to help it arrive at the best answer. It could also provide multiple types of assistance to the user beyond simply generating code snippets, such as engaging in general discussion of programming topics (e.g. [22, 71]) or help-",
        "type": "NarrativeText"
    },
    {
        "element_id": "676272d5-ff11-44d6-8f1c-89e467bbf5d7",
        "metadata": {},
        "text": "ing users improve their programming skills (as observed in other studies of automating technologies [99]).",
        "type": "NarrativeText"
    },
    {
        "element_id": "c020c30a-eef1-4f9e-b968-33bd3d2adcf2",
        "metadata": {},
        "text": "Our paper makes the following contributions to the IUI commu- nity:",
        "type": "NarrativeText"
    },
    {
        "element_id": "e45e36bf-62b4-4415-a563-b1e0b2b85219",
        "metadata": {},
        "text": "e We provide empirical evidence that a conversational pro- gramming assistant based on a state-of-the-art, code-fluent foundation model provides valuable assistance to software engineers in a myriad of ways: by answering general pro- gramming questions, by generating context-relevant code, by enabling the model to exhibit emergent behaviors, and by enabling users to ask follow-up questions that depend upon their conversational and code contexts.",
        "type": "NarrativeText"
    },
    {
        "element_id": "32ccee68-60ca-4e74-906c-881be1b4cb00",
        "metadata": {},
        "text": "e We show how different interaction models — conversation, direct manipulation, and search — provide complementary types of support to software engineers with tradeoffs be- tween the user’s focus and attention, the relevance of sup- port to their code context, the provenance of that support, and their ability to ask follow-up questions.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bab6dc00-be8c-40a0-87b8-dc77747dfa0e",
        "metadata": {},
        "text": "492",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ea88e9b0-503d-44ec-a34f-f2e6e14cddaf",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "bb33cdef-fb3a-4645-a280-efe67f836040",
        "metadata": {},
        "text": "e We motivate the need to further understand how to design human-centered AI systems that enhance the joint perfor- mance of the human-AI collaboration.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3cd31dd9-96ab-4bde-ad71-cf33b720b080",
        "metadata": {},
        "text": "2 RELATED WORK",
        "type": "Title"
    },
    {
        "element_id": "ccbb7826-9a67-4a6c-b9f8-0abd1f1fe99e",
        "metadata": {},
        "text": "We discuss three areas of related work that have either motivated our study of conversational programming assistance or provided the technical foundations for it. We begin by briefly summarizing Rich and Waters’ visionary work on the Programmer’s Appren- tice [70], followed by summarizing work on code-fluent foundation models and human-centered evaluations of how these models im- pact software engineers’ work. Finally, we discuss conversational interaction and how it might be employed to provide more flexible and sophisticated assistance to software engineers.",
        "type": "NarrativeText"
    },
    {
        "element_id": "71ad4ad6-507a-49d6-a0c7-edb6a65b7430",
        "metadata": {},
        "text": "2.1 The Programmer’s Apprentice",
        "type": "Title"
    },
    {
        "element_id": "11ee0914-5e06-42de-8803-28e66c919407",
        "metadata": {},
        "text": "Our work is inspired by the vision laid out by Rich and Waters [70], which describes an artificial agent that can act as an intelligent as- sistant for software engineers by providing advice, catching errors, and handling routine details throughout the software development process. The Programmer’s Apprentice [70] relied on a knowledge base of “clichés,” which are formal, structured versions of what are known today as software design patterns [31]. It used a hy- brid reasoning system capable of special-purpose reasoning based on frames and a plan calculus, along with general purpose logical reasoning. Although natural language interaction was envisioned, the original prototype implementation ultimately used a stylized",
        "type": "NarrativeText"
    },
    {
        "element_id": "aa4f0a49-a963-4985-8d73-9239cb87f598",
        "metadata": {},
        "text": "command language. We view our work as a conceptual successor to the Programmer’s Apprentice, as it enables the natural language",
        "type": "NarrativeText"
    },
    {
        "element_id": "6be7cf01-f11c-4e88-8363-f15611842f53",
        "metadata": {},
        "text": "interaction that the Programmer’s Apprentice lacked.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6384f602-4dc4-44d3-8f44-6ecc5c1a24b3",
        "metadata": {},
        "text": "2.2 Code-fluent Foundation Models and Human-Centered Evaluations of Programming Assistance",
        "type": "Title"
    },
    {
        "element_id": "6d3cd65f-b872-4409-b2fb-9d2a3795a3bb",
        "metadata": {},
        "text": "Generative models based on the transformer architecture [96] have recently been applied to the domain of software engineering. Code- fluent large language models are capable of generating code from natural language descriptions [105], translating code from one lan- guage to another [75], generating unit tests [92], and even gener- ating documentation for code [36, 38, 97, 98]. These models are probabilistic systems, and as such, do not always produce perfect results (e.g. code that is free of syntax or logical errors). Nonetheless, Weisz et al. [102] found that software engineers are still interested in using such models in their work, and that the imperfect outputs of these models can even help them produce higher-quality code via human-AI collaboration [103].",
        "type": "NarrativeText"
    },
    {
        "element_id": "234660c2-ced2-4291-83bb-949e053f97b6",
        "metadata": {},
        "text": "New tools based on code-fluent LLMs are actively being devel- oped. GitHub Copilot! is described as “Your AI pair programmer? It is optimized for the code autocompletion use case: given a starting",
        "type": "NarrativeText"
    },
    {
        "element_id": "757186c0-5c08-45cb-949a-e3596b94db6e",
        "metadata": {},
        "text": "snippet such as a method’s documentation, signature, or partial implementation, Copilot completes the implementation. Copilot is based on the OpenAI Codex model [24], a 12 billion parameter ver- sion of GPT-3 [17, 49], fine-tuned on code samples from 54 million public software repositories on GitHub. Empirical evaluations of",
        "type": "NarrativeText"
    },
    {
        "element_id": "5df090af-8b8b-48fb-8f61-3afb8167a8db",
        "metadata": {},
        "text": "‘https://github.com/features/copilot",
        "type": "Title"
    },
    {
        "element_id": "cd0bd916-8f03-496a-95c8-ef639053e098",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "b2d3925e-4eba-4e22-bb3a-fde2b36c4f09",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "f058ce71-558d-4568-b37f-e083c7087a42",
        "metadata": {},
        "text": "this model have shown that, although the quality of its outputs is quite good, those outputs may still be problematic [57]. Echoing the results from Weisz et al. [103], human-centered evaluations of Copi- lot have found that it increases users’ feelings of productivity [109], and that almost a third (27%) of its proposed code completions were accepted by users. In a contrasting evaluation, Vaithilingam et al. [95] found that while most participants expressed a preference to use Copilot in their daily work, it did not necessarily improve their task completion times or success rates. Yet, in a study by Kalliamvakou [40], developers working with Copilot were able to implement a web server in Javascript 55% faster than developers who did not use Copilot.",
        "type": "NarrativeText"
    },
    {
        "element_id": "aa463bba-2780-4543-b009-660cd67ed71b",
        "metadata": {},
        "text": "A grounded theory analysis of how programmers interact with Copilot [13] found that their interactions varied depending upon whether they were accelerating tasks that they already knew how to do or if they were exploring solutions to problems that they were less sure about. Autocompletion was effective when developers were operating in “acceleration mode” and relied on the model to produce short completions that could be verified quickly. In “exploration mode,” however, the interaction was more awkward. Developers would communicate with Copilot by typing comments and seeing what Copilot generated in response. Then, they would modify their comments to explore other ways of prompting a re- sponse. Ultimately, the comments used to prompt the model would be deleted after the relevant code was generated, indicating that their value was largely in driving a back-and-forth, yet context free, dialog with the model to coerce it to produce the desired results through an iterative refinement process. In this paper, we fully commit to a context-aware conversational style of interaction with a code-fluent LLM and assess the value it provides to users.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7c957337-a74d-40f8-8f45-c7e5b3ccda2d",
        "metadata": {},
        "text": "2.3. Conversational Interaction and Analysis",
        "type": "Title"
    },
    {
        "element_id": "862356f6-543d-4c0a-bc4f-16391da9a5f0",
        "metadata": {},
        "text": "2.3.1 Conversational Interaction. Using natural language to inter- act with technology has had a long research history [2], starting in the 1960s with pattern-matching approaches like Eliza [104], and continuing to today with state-of-the-art large language model- based conversational systems [107] such as Meena [3] and Blender- Bot [84]. These systems are intended to address the problem of open-domain dialog, with a goal of realistically engaging in con- versation, but not particularly in a goal-directed or task-oriented manner.",
        "type": "NarrativeText"
    },
    {
        "element_id": "87949f12-a3d6-41ee-8cd1-eb4f0aaa0be6",
        "metadata": {},
        "text": "Task-oriented chatbots are typically built with frameworks such as the Microsoft Bot Framework?, Google DialogFlow’, and IBM Watson Assistant*. They operate using pre-defined dialogue trees and use natural language processing to detect conversational intents and extract contextual entities. This structure enables the creation of special purpose, but fairly limited and rigid, conversational agents.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b49595da-acf2-4980-a464-ac40ef809013",
        "metadata": {},
        "text": "There have been several recent attempts to investigate conver- sational programming assistance. Kuttal et al. [42] conducted a Wizard of Oz study in which a pair programmer was replaced with a conversational agent, and they found that “agents can act as ef- fective pair programming partners.” The PACT system [106] is a chatbot that assists programmers adjusting to new programming",
        "type": "NarrativeText"
    },
    {
        "element_id": "1d6bc4a6-c840-47a7-9b92-8fbfdba2347b",
        "metadata": {},
        "text": "?https://dev.botframework.com/ Shttps://cloud.google.com/dialogflow “https://www.ibm.com/products/watson-assistant/artificial-intelligence",
        "type": "Title"
    },
    {
        "element_id": "bf3f4ab5-f11c-4f50-9e80-a905fabdb34e",
        "metadata": {},
        "text": "493",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ae48ef1a-7b5a-4500-9bf3-34d2b9c54416",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "055429f6-592c-47f8-ba7b-0e0ce010719e",
        "metadata": {},
        "text": "environments. PACT is structured as a discrete question-answering system based on a neural machine translation approach, but it doesn’t maintain a conversational context.",
        "type": "NarrativeText"
    },
    {
        "element_id": "184dbf63-a301-49a1-a37d-7334e6ba010b",
        "metadata": {},
        "text": "2.3.2. Conversation Analysis. Conversation is a form of interaction between people that enables robust communication. Conversation Analysis [76] is a method for understanding the natural structure of human conversational interaction. It catalogs different patterns of conversational acts and how they are utilized by interlocutors in order to attain a wide variety of goals. Recently, Conversation Anal- ysis has been adapted to describe patterns of interactions between humans and artificial conversational agents in order to aid in the design of chatbots [50]. We apply techniques from Conversation Analysis in our study of conversational programming assistance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c2812249-5e8c-4cf1-a8df-61da28231e14",
        "metadata": {},
        "text": "3 THE PROGRAMMER’S ASSISTANT",
        "type": "Title"
    },
    {
        "element_id": "b949b464-74f2-4df9-b693-dff9d833df29",
        "metadata": {},
        "text": "In order to explore conversational programming assistance, we created a functional prototype system called The Programmer’s Assistant. Our prototype, shown in Figure 1, combines a code editor with a chat interface. The code editor was implemented using the Microsoft Monaco Editor® embedded in a React wrapper®. The chat user interface was implemented using the React-Chatbot-Kit” framework. To drive the conversational interaction, we employed OpenAl’s Codex model [24], accessed through its web API.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2cf0df87-7baa-401b-8358-ff0f552448f6",
        "metadata": {},
        "text": "We developed our prototype as a lightweight coding environ- ment in order to examine the user experience of interacting with a conversational assistant. Our work was exploratory in nature, and thus we did not have specific design goals for the prototype beyond integrating a code editor with a code-fluent LLM. We also did not attempt to target the prototype for a specific class of users (e.g. novices or experts) or use cases (e.g. writing code vs. learning a new programming language), as we wanted any value provided by conversational assistance to emerge from our user study. We also did not implement the ability to run or debug code in our prototype as we wanted to explore the nature of the conversational interac- tion rather than having users focus extensively on the production of working code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "49a4c97b-66cb-4878-9472-80bf353c85f2",
        "metadata": {},
        "text": "When designing how users would interact with the Program- mer’s Assistant, we decided that it should be available on demand. and not monitor the user’s work in progress or give unsolicited suggestions or advice, in keeping with the conversational agent interaction model proposed by Ross et al. [73, 74]. This approach was supported by feedback from prospective users who were con- cerned about the assistant providing criticism of unfinished efforts in progress or distracting them while they worked. Instead, we force initiative onto the user and only have the assistant respond to their requests. In this way, the assistant can provide help when requested without undesirable interruptions that can distract or interfere with the user’s flow.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1db772d1-80ce-4de4-bb58-29721e07a58d",
        "metadata": {},
        "text": "When a user interacts with the assistant, we keep track of their selection state in the code editor. If a user sends a message to the assistant without any code selected in the editor, then that message (along with the prior conversational context) is passed directly to the model. If a user sends a message to the assistant with new code",
        "type": "NarrativeText"
    },
    {
        "element_id": "b2b2de8c-0fe7-4779-9a35-e1910d57afe0",
        "metadata": {},
        "text": "Shttps://microsoft.github.io/monaco-editor/ ®https://www.npmjs.com/package/@monaco-editor/react Thttps://fredrikoseberg github.io/react-chatbot-kit-docs/",
        "type": "Title"
    },
    {
        "element_id": "6cec10b4-42bc-4510-a5f8-7bd65e185104",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "820ca874-b747-4234-9be6-b72633199f7f",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "b0850872-5aa6-4cc3-be33-52be563b5517",
        "metadata": {},
        "text": "selected in the editor (ie. code that wasn’t previously selected when they sent their last message), then that code is appended to the message before being communicated to the model.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9df9576b-5611-4fa8-91ec-53f198069b3c",
        "metadata": {},
        "text": "The model may produce multiple types of responses to a user’s message. We treat each type of response differently in the UI.",
        "type": "NarrativeText"
    },
    {
        "element_id": "68278e08-33c4-44b1-8b58-490132ceec63",
        "metadata": {},
        "text": "« Responses that do not contain code are always rendered in the chat UI (Figure 1E).",
        "type": "NarrativeText"
    },
    {
        "element_id": "d5d7de95-eaf1-49e5-a7a6-cffe6b9b7ec6",
        "metadata": {},
        "text": "¢ Responses containing short code snippets (< 10 lines) are rendered inline in the chat UI (Figure 1G).",
        "type": "NarrativeText"
    },
    {
        "element_id": "43b2298a-a3a2-4738-b26e-a1dfe40cc754",
        "metadata": {},
        "text": "¢ Responses containing longer code snippets (> 10 lines) show the code in a pop-up window (Figure 2A), with a proxy entry in the chat transcript (Figure 2B) that allows users to re- display the code window after it has been closed. Non-code text in the response remains in the chat transcript.",
        "type": "NarrativeText"
    },
    {
        "element_id": "79db9c12-7482-42b3-ac86-aece324bd5bd",
        "metadata": {},
        "text": "The assistant never directly modifies the contents of the user’s source code; rather, any code the user desires to transfer from the chat takes place via copy/paste.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2eb77ff5-c7a7-48c7-99c2-ca10d5b91516",
        "metadata": {},
        "text": "Figure 1 shows a screenshot of a real, sample conversation, in which the user asks a question that results in an inline response, then requests an explanation of some code in the editor, and then re- quests further elaboration. Figure 2 shows an example conversation that resulted in the generation of a longer code sample, shown in a popup window. This example shows how the assistant produced an incomplete solution, followed by criticism from the user regarding the missing code, and resulting in an apology and the generation of a complete solution.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bc7fc6a4-6807-45d5-8544-0227212b11d2",
        "metadata": {},
        "text": "3.1 Supporting Conversational Interaction",
        "type": "Title"
    },
    {
        "element_id": "09e245d8-036c-4f99-b814-b8f9afd75b8c",
        "metadata": {},
        "text": "We enabled Codex to conduct a conversational interaction by prompt- ing it with a conversational transcript and a request to produce the next conversational turn. The prompt establishes a pattern of conversation between a user and a programming assistant named Socrates. It provides several examples of Socrates responding to gen- eral coding questions, generating code in response to a request, and accepting code as input. It establishes a convention for delimiting code in the conversation, making it easy to parse for display in the UL. It also establishes an interaction style for the assistant, directing it to be polite, eager, helpful, and humble, and to present its re- sponses in a non-authoritative manner®. Because of the possibility that the model might produce erroneous answers or incorrect code (as discussed in Weisz et al. [102]), we felt it was important that the assistant convey a sense of uncertainty to encourage users to not accept its results uncritically to avoid over-reliance (e.g. as observed in Moroz et al.’s study of Copilot [51], and discussed more gener- ally in Ashktorab et al. [9]) as well as automation bias [45, 46, 65]. We present the full text of the prompt used for the assistant in Appendix D.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4b702130-cd71-4c36-a07e-87c2530ebf07",
        "metadata": {},
        "text": "3.2 Architecture & UI Design",
        "type": "Title"
    },
    {
        "element_id": "8d29ac68-14eb-4438-8152-c7265ccd2d02",
        "metadata": {},
        "text": "The Programmer’s Assistant communicates with the Codex API via a proxy server that forwards requests from the React client. The proxy also rate-limits access to conform to the API’s policy, and it logs UI events from the client (e.g. requests, responses, and UI",
        "type": "NarrativeText"
    },
    {
        "element_id": "69f66653-f916-4f31-a7a0-dc99b66b28b5",
        "metadata": {},
        "text": "®The assistant’s use of non-authoritative responses was encoded into the LLM prompt; output token probabilities from the LLM were not utilized to influence the assistant’s response.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e6baa67f-9e26-455e-b42b-ae4ab4429aa5",
        "metadata": {},
        "text": "494",
        "type": "UncategorizedText"
    },
    {
        "element_id": "206236b5-2691-4d7a-bf6b-46fc4bcfb7c2",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "b37ef1b7-7363-48af-82bc-cb33e0b584d3",
        "metadata": {},
        "text": "interactions) in a back-end database. To address inconsistencies in the style or formatting of code generated by Codex, the proxy server reformats all code segments using the Black code formatter ° before transmitting them to the client UL",
        "type": "NarrativeText"
    },
    {
        "element_id": "0daaeeac-70ea-41ae-932c-46f010487ce4",
        "metadata": {},
        "text": "The client maintains the transcript of the ongoing conversation. Each time the user sends a message in the chat, the client constructs a new prompt for the model by concatenating the initial prompt, the chat transcript, and the user’s new utterance, and makes a re- quest for the model to complete the transcript. This completion request also specifies a stop sequence of tokens to prevent the model from generating both sides of the conversation (e.g. what the model thinks the user’s next utterance might be after the as- sistant’s response). Given the API’s limitation on context length (4,096 tokens for both the prompt and model response), we silently “forget” older exchanges in the chat transcript when constructing the prompt to ensure that our completion request remains within bounds. Nonetheless, the entire conversational history remains visible to the user in the UI. The client UI provides a loose coupling between the source code editor and the chat interface. Users can hide the chat pane when they wish to focus solely on their code, and re-engage with it when they desire assistance. Code selected in the editor is included in the conversation in order to couple the code context with the conversation. Easily-accessible buttons are provided in the UI to copy code responses from the assistant to the clipboard.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d3fe50ba-f2b8-4537-8249-4a9cfbc2f90c",
        "metadata": {},
        "text": "3.3 Handling Model Limitations",
        "type": "Title"
    },
    {
        "element_id": "d5e50f76-66b1-447c-8886-d51b90efbd27",
        "metadata": {},
        "text": "While developing the Programmer’s Assistant, and in early pilot testing, we experienced some quirks and shortcomings of the model and our approach to using it for conversational interaction. One limitation stemmed from the fact that the model sometimes pro- duced incorrect responses (e.g. code with syntax errors), incomplete responses (e.g. code that was missing functionality), irrelevant re- sponses (e.g. responses not related to the user’s question), or insub- stantial responses (e.g. “I don’t know”). Because of the probabilistic nature of model inference, re-prompting the model would some- times produce a more correct or appropriate response. Thus, we added the ability for users to “try again,’ either by asking in the chat or by clicking a button in the UI (Figure 1C). This feature removes the assistant’s last response from the context presented to the model and then re-invokes the model with an increased temperature!?.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2eb874ac-a0b8-4330-a2fc-3df064499b3f",
        "metadata": {},
        "text": "Although it is possible for transformer models such as Codex to produce multiple possible responses to a single prompt, we only request a single response in order to speed up response time as well as to preserve the token budget for conversational context. Thus, the “try again” feature provides an alternate way to produce a wider variety of responses.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5dafbf55-58ab-4d76-9ce7-06a164b99c34",
        "metadata": {},
        "text": "During pilot testing, we noticed that the assistant sometimes happened to generate the same response to multiple, unrelated re- quests. In these cases, the assistant tended to get “stuck” in a pattern of repeating the same response and was unable to resume normal conversation. To avoid this problem, we automatically execute a",
        "type": "NarrativeText"
    },
    {
        "element_id": "c2db1dfc-e61f-458b-9717-97074ef6d9fa",
        "metadata": {},
        "text": "°https://black.readthedocs.io/en/stable/",
        "type": "Title"
    },
    {
        "element_id": "43699c25-1879-486b-b004-c0778614209e",
        "metadata": {},
        "text": "10Temperature is a parameter in a generative model that specifies the amount of variation in the generation process. Higher temperatures result in greater variability in the model's output.",
        "type": "NarrativeText"
    },
    {
        "element_id": "566085c1-0bca-40f7-b7ed-f2c24c30b166",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "7b12dd58-e6fc-4857-9cd2-b412032f05dc",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "b9e89ac0-2499-451f-b54e-8560366cc98c",
        "metadata": {},
        "text": "ch Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "9cc5c998-7425-4cd7-915a-e7db724723fd",
        "metadata": {},
        "text": "from tions import default inport q as heap",
        "type": "Title"
    },
    {
        "element_id": "f9c2eef7-8384-4329-8800-a4fa8605006a",
        "metadata": {},
        "text": "def analyze(G, startingNode) : visited = set() parentsMap = {} pq = [1] nodeCosts = defaultdict(1anbda: float( » nodeCosts [start ingNode] = 0 heap-heappush(pq, (0, startingNode) )",
        "type": "NarrativeText"
    },
    {
        "element_id": "04bfd29f-ca4c-4676-9661-773cf35df6f1",
        "metadata": {},
        "text": "while pq: _, node = heap. heappop (pq) visited.add (node)",
        "type": "NarrativeText"
    },
    {
        "element_id": "69cb9492-e282-444c-aeec-61429772f55b",
        "metadata": {},
        "text": "for adjNode, weight in G[node].items(): if adjNode in visited: continue newCost = nodeCosts [node] + weight if nodeCosts[adjNode] > newCost: parentsMap[adjNodel = node nodeCosts [adjNode] = newCost heap-heappush(pq, (newCost, adjNode) ) return parentsMap, nodeCosts",
        "type": "NarrativeText"
    },
    {
        "element_id": "64695d8d-dcf0-4353-a22d-ce743a53b1c7",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "04a1d5e3-363c-46b2-9e7e-68ce4a5de66c",
        "metadata": {},
        "text": "How would I remove duplicates froma 2) F list?",
        "type": "NarrativeText"
    },
    {
        "element_id": "52fb22ab-8c22-4958-b0bf-4abb171e3c0a",
        "metadata": {},
        "text": "©",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8f793c3a-d57b-4ac7-a08f-8035929adb01",
        "metadata": {},
        "text": "Can you tell me what this code is doing?",
        "type": "NarrativeText"
    },
    {
        "element_id": "ab609a52-5d4b-4dcc-bc4d-ff4dffef1e36",
        "metadata": {},
        "text": "Is this a well-known algorithm? e",
        "type": "NarrativeText"
    },
    {
        "element_id": "c7d0f7a0-16da-49b5-88af-ea797e9fa05f",
        "metadata": {},
        "text": "Is itefficient? Cs}",
        "type": "Title"
    },
    {
        "element_id": "69a0e20b-331d-467a-93bc-70aaa6308b15",
        "metadata": {},
        "text": "Ok, that's great. Thanks! Cs}",
        "type": "Title"
    },
    {
        "element_id": "e69f7144-27c4-493c-a30a-7f94c3a743b7",
        "metadata": {},
        "text": "Write your message here",
        "type": "NarrativeText"
    },
    {
        "element_id": "369510ba-e3eb-43fc-9307-f05a81809272",
        "metadata": {},
        "text": "Figure 1: The Programmer’s Assistant. The user interface provides a code editor on the left (A) and a chat pane on the right (B). The “try again” button (C) allows users to ask the assistant to generate an alternate response to the most recent question. The “start over” button (D) resets the conversational context for the assistant, but maintains the chat transcript in the UI. In this example, we show the assistant introduce itself to the user (E). Next, the user asks a general programming question (F), for which the assistant provides an inline code response (G). The user then asks a question about code selected in the editor (H),",
        "type": "NarrativeText"
    },
    {
        "element_id": "7545ba38-8454-477e-99df-df4a1099aed6",
        "metadata": {},
        "text": "followed by a series of follow-up questions.",
        "type": "NarrativeText"
    },
    {
        "element_id": "50c99c7d-df68-4542-aa71-b4d5664c826c",
        "metadata": {},
        "text": "“try again” operation in the background when we see identical consecutive responses from the assistant.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e3d44e73-8382-4052-b4ff-7b2659f291fb",
        "metadata": {},
        "text": "Finally, we noticed that the accumulation of conversational con- text sometimes resulted in the assistant becoming fixated on some portion of the earlier conversation. For example, it might respond to a question with portions of the prompt or of earlier conversation, and become less responsive to newer requests. To address this issue, we introduced a “start over” feature, accessible via the chat or by clicking a button in the UI (Figure 1D), that resets the context to the original prompt, forgetting the rest of the conversational history. We preserve the chat transcript in the UI, but delineate the break in the assistant’s memory with an annotation in the chat transcript. These annotations are added both for “try again” and “start over.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "b66d87f5-7a0b-46a7-ac7d-0f122eb36674",
        "metadata": {},
        "text": "495",
        "type": "UncategorizedText"
    },
    {
        "element_id": "42327fbc-e7b4-46ea-b663-6f4c13fe441c",
        "metadata": {},
        "text": "3.4 Sample Conversation",
        "type": "Title"
    },
    {
        "element_id": "d7b8c3d7-babb-442a-b5a1-d9f6f9ff221d",
        "metadata": {},
        "text": "We provide a real sample conversation with the Programmer’s Assistant in Listing 1. This conversation begins with the assistant greeting the user (line 1). Next, the user asks a general Python programming question (line 4), to which the assistant responds with a non-authoritative remark (“I think...””) and a code snippet (line 9). The user next asks a follow-up question that depends on their previous question and the assistant’s response (line 11), to which the assistant provides another code snippet (line 15), satisfying the user’s request.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c1bcb141-2147-4644-ab3d-7b900a8c6f2a",
        "metadata": {},
        "text": "The user then switches topics and asks the assistant to write a Fibonacci function (line 17), and the assistant again responds with a non-authoritative remark (“I will give it a try,” line 20) and a block of code. The user then asks how the function works (line 30) and the assistant provides an adequate description (line 32).",
        "type": "NarrativeText"
    },
    {
        "element_id": "bebd183e-be0f-448d-a77b-7f897851adca",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "7b61484f-7ece-4d2e-8610-c2914a3d110a",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "e978b57b-79d5-4d5a-83bf-4f7ecc7c9ef5",
        "metadata": {},
        "text": "Code Preview",
        "type": "Title"
    },
    {
        "element_id": "f0da66a2-c898-4a30-95cf-2d64ae38f91d",
        "metadata": {},
        "text": "Queue: yea \"Queue\" class in Python; ( : i the basic enqueue, dequeue items peek methods. isEmpty ( enqueue(self, iten):",
        "type": "NarrativeText"
    },
    {
        "element_id": "84a8575c-0c63-4fa5-bfc8-5f9b5cae4b66",
        "metadata": {},
        "text": "items.insert(@, item)",
        "type": "ListItem"
    },
    {
        "element_id": "d552f226-c769-43a5-b058-44362ab3d500",
        "metadata": {},
        "text": "dequeue (self): items. pop ()",
        "type": "Title"
    },
    {
        "element_id": "c3959600-8658-4cab-83a4-39cfcbc5306f",
        "metadata": {},
        "text": "You left out the peek method! 6",
        "type": "NarrativeText"
    },
    {
        "element_id": "7c9b406b-48be-4690-a080-7a858cd998a4",
        "metadata": {},
        "text": "| ewereven o | 8 Copy & Close That's better! 6",
        "type": "Title"
    },
    {
        "element_id": "b3cdf473-df32-4833-8524-25aa25b70e4f",
        "metadata": {},
        "text": "Figure 2: Code Preview. Long code responses (> 10 lines) are presented in a pop-up window (A), with a button to copy the code and close the window. This code can be re-accessed from the chat transcript by clicking the proxy icon (B).",
        "type": "NarrativeText"
    },
    {
        "element_id": "ee89cd71-b36b-45fb-b764-9e2995eef7d4",
        "metadata": {},
        "text": "vitems) - 1]",
        "type": "Title"
    },
    {
        "element_id": "385adaf3-a6e5-4b6a-93f2-5fd6b6962288",
        "metadata": {},
        "text": "Next, the user asks the assistant to re-implement the function in a 12 different way (line 37), again leveraging the ability to ask follow-up u Socrates: I think you would do something like this: questions. The assistant produces an alternative implementation 15 for key in my_dict: that conforms to the user’s request (line 41). The user follows up 16 with a question that depends on multiple past utterances and re- 17 | User: Write a function that returns the nth value \\ tes OF ‘ 18 in the Fibonacci sequence.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d4dfa8e2-da06-493f-978c-984a95f2293f",
        "metadata": {},
        "text": "sponses in the chat transcript (line 47), and the assistant produces 19 a relevant response (line 49). The conversation closes with the user 20 | Socrates: I will give it a try.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d505f062-fd24-4ec2-9e36-fda319fb59e9",
        "metadata": {},
        "text": "F : : . ; 21 thanking the assistant (line 53) and the assistant acknowledging 22 def fib(n): their gratitude (line 55). 23 if n=",
        "type": "NarrativeText"
    },
    {
        "element_id": "9fc02a83-2ea0-4649-8839-823f03d818a3",
        "metadata": {},
        "text": "24 return 0",
        "type": "Title"
    },
    {
        "element_id": "63f89a42-bab8-476f-9b11-b69266745d4a",
        "metadata": {},
        "text": "Listing 1: A conversation with the Programmer’s Assistant. a elif return 1 Code presented by the assistant is listed in bold face. 27 else: 1 | Socrates: Hello! My name is Socrates your programming 28 return fib(n - 1) + fib(n - 2) 2 assistant. What can I help you with today? 29 | 3 30 | User: How does this work? 4 | User: How do I get a list of the keys in a 31 5 Python dictionary? 32 | Socrates: The Fibonacci sequence is defined by the 6 33 recurrence relation F(n) = F(n-1) + F(n-2). 7 |Socrates: I think you would do something like this: 34 This function implements that recurrence 8 35 relation. 9 List (my_dict.keys()) 36 . . 10 37 | User: Can this be done without recursion? 11 | User: What if I just wanted to iterate over them? 38",
        "type": "NarrativeText"
    },
    {
        "element_id": "4f84eec7-4e9e-4ed3-9ba5-4bc36df0f2ac",
        "metadata": {},
        "text": "496",
        "type": "UncategorizedText"
    },
    {
        "element_id": "529a736d-152d-4275-aed9-b28b4798c610",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "c31a2001-b283-49f5-9325-0c9c0a13ab71",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "590a71a4-a647-4ab6-9aa2-8c3b7b9c0a84",
        "metadata": {},
        "text": "39 | Socrates: I think so. How about this? 40",
        "type": "NarrativeText"
    },
    {
        "element_id": "83f69b3e-b982-4694-b014-1ceaad931c99",
        "metadata": {},
        "text": "41 def fib(n):",
        "type": "Title"
    },
    {
        "element_id": "144b118f-c119-45c9-9741-7e3fadb3e79a",
        "metadata": {},
        "text": "42 a,b = 0,1",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5bd54814-fc9a-44b0-9421-a831710a7a6e",
        "metadata": {},
        "text": "B for i in range(n):",
        "type": "Title"
    },
    {
        "element_id": "c9a8546f-7cfc-4f1a-9e8d-837e594912b9",
        "metadata": {},
        "text": "44 a,b = b,atb",
        "type": "Title"
    },
    {
        "element_id": "ee84ec2d-c269-427b-a47e-45e0a5e8dbd5",
        "metadata": {},
        "text": "45 return",
        "type": "Title"
    },
    {
        "element_id": "2a842b47-1f2c-4fb0-b4a0-6557225dd3eb",
        "metadata": {},
        "text": "46",
        "type": "UncategorizedText"
    },
    {
        "element_id": "94c2c30d-ec8c-4ff5-bd07-813d6f011c6f",
        "metadata": {},
        "text": "47 | User: Which version is better?",
        "type": "NarrativeText"
    },
    {
        "element_id": "faf870fa-818b-4f88-b9bf-9a92e0086d6f",
        "metadata": {},
        "text": "48",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0e53ee01-30c5-4fc6-a700-9fbb5170d853",
        "metadata": {},
        "text": "49 | Socrates: I think the recursive version is more",
        "type": "NarrativeText"
    },
    {
        "element_id": "4c8c667d-6687-4428-856e-24b0f6fac3fe",
        "metadata": {},
        "text": "50 elegant, but the iterative version is more 51 efficient.",
        "type": "NarrativeText"
    },
    {
        "element_id": "af329846-990a-4540-950a-8a84fdfc9943",
        "metadata": {},
        "text": "52",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d186c57c-198f-4b49-8769-d35d8f7e0f5e",
        "metadata": {},
        "text": "53 User: Thanks!",
        "type": "Title"
    },
    {
        "element_id": "536e2c19-2ef5-45fe-a686-7827e3b9c87a",
        "metadata": {},
        "text": "54",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8daca099-5e7e-428e-939f-4615d17335ab",
        "metadata": {},
        "text": "55 Socrates: You're welcome!",
        "type": "Title"
    },
    {
        "element_id": "df9a1c38-f664-4f72-b3e3-c8d2dd5351f8",
        "metadata": {},
        "text": "4 EMPIRICAL STUDY OF CONVERSATIONAL PROGRAMMING ASSISTANCE",
        "type": "Title"
    },
    {
        "element_id": "253dda15-e7d4-487b-b057-e52d7f7b61ae",
        "metadata": {},
        "text": "We conducted an empirical user study of the Programmer’s Assis- tant to assess whether conversational assistance provides value in a software engineering context!!. Our inquiry focused on the user experience and value of conversational interactions grounded in code. We therefore designed a qualitative study to investigate atti- tudes toward a conversational programming assistant: do people enjoy interacting conversationally, what kinds of questions do they ask, and how does the experience compare to other forms of pro- gramming support such as searching the web? We note that prior studies (e.g. [103, 105, 109]) conducted quantitative examinations of the use of LLMs in code work; our study is akin to Weisz et al.’s qualitative examination of software engineers’ attitudes toward working with models that may fail to produce working code [102].",
        "type": "NarrativeText"
    },
    {
        "element_id": "76ae858c-0143-44bd-93f2-30d050262910",
        "metadata": {},
        "text": "To address our questions, we deployed the Programmer’s Assis- tant within our organization — a global technology company — and invited people to try it out and give us feedback on their experience. We invited people with varying levels of programming skill in order to obtain a wide range of feedback on the kinds of use cases for which the tool could provide assistance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a6870593-42f0-48f6-a080-9be0aa004669",
        "metadata": {},
        "text": "4.1 Tasks",
        "type": "Title"
    },
    {
        "element_id": "7111266b-6a6d-4fa0-aad6-2b68c597d183",
        "metadata": {},
        "text": "We set up the Programmer’s Assistant as a playground environment that participants could try out with a few sample programming problems. We created a tutorial to orient participants to the assis- tant, its capabilities, and how to interact with it. We also created four programming challenges focused on writing code, document- ing code, and writing tests for code. We designed these challenges to expose participants to a broad range of the assistant’s capabilities. For each of these challenges, we explicitly did not evaluate metrics such as the participant’s productivity, the quality of their solutions, or the time taken to produce them, as the focus of our study was to understand the utility of conversational interaction. We selected Python as the language used for the tutorial and challenges because of its general popularity [21] and the fact that it was well-supported by our underlying LLM [24].",
        "type": "NarrativeText"
    },
    {
        "element_id": "40dc4b4a-407c-49d1-a8a7-b748c3c9a9f7",
        "metadata": {},
        "text": "4.1.1 Tutorial. All participants were first introduced to the Pro- grammer’s Assistant through a tutorial. The tutorial walked each For historical context, we note that our study was completed before the public",
        "type": "NarrativeText"
    },
    {
        "element_id": "afc47cc8-ff8b-401f-a7c7-7e80b7ddbed7",
        "metadata": {},
        "text": "release of ChatGPT [60], which has subsequently demonstrated the application of conversational assistance for programming tasks [34].",
        "type": "NarrativeText"
    },
    {
        "element_id": "ff52a6c1-eb85-4bfb-8de7-855562a33634",
        "metadata": {},
        "text": "497",
        "type": "UncategorizedText"
    },
    {
        "element_id": "177c82ca-0464-4e1c-977e-8539e5b61c41",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "cc9cc2ca-44a4-472c-802f-39babeabe624",
        "metadata": {},
        "text": "participant through 10 sample interactions to give them a feeling for what the assistant could do and how to interact with it. The tutorial demonstrated how to ask questions, how to request code to be generated, and how to evaluate existing code. It did not specifi- cally cover how to generate documentation or unit tests. Tutorial instructions were provided within the code editor. We include the specific text used for the tutorial in Appendix B.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a02b1397-6568-450a-9222-aa3f1abbf0f5",
        "metadata": {},
        "text": "4.1.2 Programming Challenges. After completing the tutorial, par- ticipants unlocked four programming challenges. Two of the chal- lenges involved coding problems (writing a queue class and writing code to create a scatterplot of data in a CSV file), one involved doc- umenting a given function (an implementation of a graph search algorithm), and one involved writing unit tests for a given func- tion (computing the greatest common divisor of two arguments). Although the Programmer’s Assistant was visible and available for use, we provided no specific requirement that it actually be used to complete the challenges.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d99b926-a44f-417e-9bf6-d56203de02f1",
        "metadata": {},
        "text": "After participants completed their solution to a challenge, they submitted it by clicking a button in the UI. The code editor used in the Programmer’s Assistant was not a fully-functional IDE and did not provide syntax checking or the ability to run, test, or debug code. Due to these limitations, participants were asked to submit their solutions when they felt they had completed the challenge to their own satisfaction.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b5b3e0cc-a419-4616-a49a-976bc45019cd",
        "metadata": {},
        "text": "4.2 Participants",
        "type": "Title"
    },
    {
        "element_id": "90ae5ccb-9178-4be3-b57c-dfd3642e8a63",
        "metadata": {},
        "text": "To recruit participants for our study, we posted internal advertise- ments in various communications channels focused on software engineering. Our advertisements stated that we were evaluating a conversational programming assistant, but were kept deliberately vague in order to minimize the impact on peoples’ expectations of the experience.",
        "type": "NarrativeText"
    },
    {
        "element_id": "442d6fc4-c877-4c1e-932e-9e5aa16463e7",
        "metadata": {},
        "text": "Our advertisement yielded a pool of 140 potential participants. In order to recruit a diverse sample, we used a screening survey that asked about their job role, their familiarity with and recency of use of Python, and their availability to participate in our study. We accepted participants into the study on a rolling basis, selecting participants to capture a range of programming experiences and ensure balanced gender representation. We conducted periodic re- views to determine whether we were learning something new from each participant or if we had reached the point of saturation [7]. We stopped collecting data after running 42 participants as we were no longer observing any new behaviors or gleaning any new insights. The Programmer’s Assistant implementation and configuration were held constant over the course of the study; no changes to the UI design or LLM prompt were made.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f1cd4344-b933-46d3-b1fb-49cf9c3866c0",
        "metadata": {},
        "text": "Our participants had the following self-identified characteristics:",
        "type": "NarrativeText"
    },
    {
        "element_id": "a900dfed-4130-441c-84fb-9719ef8f954a",
        "metadata": {},
        "text": "¢ Job role: 19 Software Engineers, 12 Researcher/Scientists, 3 Software Architects, 2 Data Scientists, 1 Machine Learning Engineer, 1 Systems Test Engineer, 1 Business Analyst, 1 Manager, 1 Marketer, and 1 Consultant.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4e8b139f-3128-41e7-86f9-6dc92eb0f169",
        "metadata": {},
        "text": "e Gender: 21 Female, 19 Male, 1 Gender Variant / Non-con- forming, and 1 Preferred not to say.",
        "type": "NarrativeText"
    },
    {
        "element_id": "30333491-ef18-4a7c-a64e-b859fa4ff9b2",
        "metadata": {},
        "text": "e Python Experience: 17 participants had 3+ years of Python experience, 11 had 1-3 years, 11 had less than 1 year, and 3 were not familiar with Python.",
        "type": "NarrativeText"
    },
    {
        "element_id": "20fe6afe-045c-470d-afd1-fe0ba9092518",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "147cb3ed-70da-4761-b70b-8fee21c16e8e",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "289b2fae-f2f9-470b-a735-fe53ef57ab0b",
        "metadata": {},
        "text": "e Recency of Python Use: 29 participants had written Python code within the past month, 4 within the past year, 5 within the past 5 years, and 4 had not written Python code within the past 5 years.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8c78cf93-959c-4d6e-b498-445ecc0564c8",
        "metadata": {},
        "text": "We provide full demographic information for individual partici- pants in Appendix E.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a1a4b0c5-cd3b-446e-aedd-e641e5763ddd",
        "metadata": {},
        "text": "4.3 Procedure",
        "type": "Title"
    },
    {
        "element_id": "a18773ea-7afe-4632-b66c-ad3bf92b0af6",
        "metadata": {},
        "text": "Participants completed the study on their own time, independently and without moderation. Each participant was provided with a web link to a pre-study survey that described the nature of the study and the tasks that they would be expected to perform. They were then directed to the Programmer’s Assistant to complete the tutorial and the four programming challenges. When participants indicated they were finished with the challenges!”, they were directed to a final post-study survey. Complete sessions generally required about an hour of effort, though some participants spread their effort across a longer period of time and across multiple sessions. Participants were compensated for their time at a rate equivalent to US $15/hr.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8e57657a-4dd6-49ee-bf82-a184f984e84e",
        "metadata": {},
        "text": "4.4 Measures We collected a variety of data in our study from three sources:",
        "type": "NarrativeText"
    },
    {
        "element_id": "6287301c-21dd-469f-bed6-5220c0581172",
        "metadata": {},
        "text": "(1) Surveys. We employed three surveys in the study: a pre- study survey to collect demographic information, a pre-task survey to gauge expectations of the conversational user ex- perience, and a post-task survey to assess actual user expe- rience. We describe these survey questions in the relevant context of our results, and we provide a complete listing of all survey instruments in Appendix A.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cdbe0e0f-f1b5-47ae-81bf-418f1c7ee789",
        "metadata": {},
        "text": "(2) Event logs. The Programmer’s Assistant was instrumented to collect data on participants’ usage. The event logs pro- vided timestamped records of interaction events, including conversational exchanges, hiding/showing the assistant, use of the “try again” and “start over” features, and use of copy/- paste.",
        "type": "NarrativeText"
    },
    {
        "element_id": "67ab8ef6-cea6-4d93-a402-be763c105e5a",
        "metadata": {},
        "text": "(3) Conversation logs. From the event logs, we extracted con- versational transcripts between each participant and the Programmer’s Assistant.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5011663a-3f78-4da7-9c42-b08a60bfb614",
        "metadata": {},
        "text": "5 RESULTS 5.1 Data & Analysis",
        "type": "Title"
    },
    {
        "element_id": "e0fd7898-3b89-4849-8341-62b53bbc9e1a",
        "metadata": {},
        "text": "We collected a wealth of data in our study: 126 survey responses from three surveys per participant, containing 296 written com- ments in open-ended survey questions, and 4,877 instances of 23 different types of UI events, including 1,699 conversational ex- changes! in the event logs. We also compute, for each participant, counts or durations for 21 different metrics from the event logs. In our analysis, we deliberately exclude the portion of our data collected during the tutorial exercise. We exclude this data because that activity was guided by the tutorial instructions, not by our participants’ own initiative. Thus, our final sample consists of 3,172",
        "type": "NarrativeText"
    },
    {
        "element_id": "5a20badd-633a-428b-b7ee-6c80a22da9f0",
        "metadata": {},
        "text": "12We did not enforce that participants actually complete all of the challenges. Never- theless, all participants but one did submit solutions to all of the challenges.",
        "type": "NarrativeText"
    },
    {
        "element_id": "79886685-3573-4456-be59-2963f04c2e88",
        "metadata": {},
        "text": "'We refer to a participant’s utterance, followed by the assistant’s response, as a conversational exchange.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0c4e2a64-23cf-4c93-a31c-1e5e043604a6",
        "metadata": {},
        "text": "498",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a1b1ae7c-e275-4aee-8e30-e50d7739cb5a",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "430aa79b-d26a-416a-bd41-a2d553ebdc68",
        "metadata": {},
        "text": "events, including 968 conversational exchanges in the event logs; no survey data was excluded.",
        "type": "NarrativeText"
    },
    {
        "element_id": "87ac1aae-50b1-4c4c-9acc-67200a55161e",
        "metadata": {},
        "text": "Our primary analysis of this data is qualitative, as our partici- pants provided us with a rich source of interesting feedback and thought-provoking insights in their comments. Where applicable, we supplement this data with quantitative data from the survey and the event logs, as well as chat transcript data from the con- versation logs. In this way, we triangulate [47] across our three data sources, using the open-ended survey data as a foundation. When we quote participants, either from their qualitative survey responses or the conversational transcripts, we reproduce their words exactly as typed, including typos, misspellings, grammati- cal errors, capitalization, and potential trigger words, and we only make minor clarifying edits where needed, delineated by square brackets.",
        "type": "NarrativeText"
    },
    {
        "element_id": "73e8886d-9bdf-4e50-8307-859103b21d4f",
        "metadata": {},
        "text": "In order to set the context for our analysis, we first describe how we used reflexive thematic analysis to analyze participants’ responses to the open-ended survey questions. We then describe our analysis of the conversation logs and our development of a coding guide based on Conversation Analysis [76], and specifically, Moore and Arar’s Natural Conversation Framework [50].",
        "type": "NarrativeText"
    },
    {
        "element_id": "ee613595-f992-4586-87c4-159c07cbb662",
        "metadata": {},
        "text": "5.1.1 Thematic Analysis of Qualitative Survey Responses. We con- ducted a reflexive thematic analysis to analyze the responses to our seven open-ended survey questions. We followed the process described by Braun and Clarke [16] in which researchers immerse themselves in the data, generate codes for material that seems interesting, and then iteratively group and refine codes through collaborative discussion in order to identify higher-level themes. Initially, four authors performed open-coding on the open-ended survey responses. Through discussion, these codes were grouped and consolidated into a single set, which were then re-applied to the data by two authors. After another round of discussion, these authors identified a set of 12 higher-level themes. Some themes had clear parallels to quantitative survey questions or event log data, and thus represented clear instances where we were able to trian- gulate across data sources. Other themes surprised us. We structure our presentation of the results based on these 12 themes, grouped into three different aspects of the user experience: expectations and experience, utility of conversational assistance, and patterns of interaction and mental models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "81af3d83-c7de-4ab8-a1fc-bef6a26d2243",
        "metadata": {},
        "text": "5.1.2 Conversation Analysis via the Natural Conversation Frame- work. In order to understand the content and structure of the conversations that took place between our participants and the Programmer’s Assistant, we turned to the Natural Conversation Framework [50] (NCF). We developed a codebook for the event logs, beginning with 21 different categories of utterances from the NCF. Nine NCF categories - Acknowledgment, Apology, Confirma- tion, Expression of Gratitude, Farewell, Greeting, Self-Identification, Welfare Check, and Welfare Report — appeared twice in our code- book to distinguish cases in which the utterance was made by the human participant vs. the assistant. Other NCF categories were split to provide nuanced detail about the interaction; for example, we distinguished three different kinds of NCF requests, depending upon whether they were stated as Requests for Action (e.g. “Would you...”), Commands of Action (e.g. “Write a function that...”), or Expressions of Desire (e.g. “I want..””). We also added 18 additional",
        "type": "NarrativeText"
    },
    {
        "element_id": "e7fab291-732e-4dd7-b762-873969570b34",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "6da60b87-2319-4aa3-a392-c03b6bc230d3",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "860b8d9a-ac2e-4af8-928e-3f5c150a4f10",
        "metadata": {},
        "text": "Interlocutor Orientation Codes",
        "type": "Title"
    },
    {
        "element_id": "a9509348-2193-4f2d-b8c5-61aa52d8f55e",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "683e17d3-59b8-4d5c-afda-fecc9ed80762",
        "metadata": {},
        "text": "Human Social",
        "type": "Title"
    },
    {
        "element_id": "c0aacdea-4c0f-4989-b27b-b5c9e089dd86",
        "metadata": {},
        "text": "Acknowledgment, Apology, Criticism, Expression of Gratitude, Farewell, Greeting, Politeness,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f76c9294-0cf7-4d76-8d92-21cb4c068f6b",
        "metadata": {},
        "text": "Praise, Self Identification, Small Talk, Welfare Check, Welfare Report Task Asks Question, Asserts Information, Capability Check, Command of Action, Expression of Desire, Identi- fies Error, Request for Action, Requests Elaboration, Requests Explanation",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8cf3be96-bbf0-4fb0-b102-e2f782ec210b",
        "metadata": {},
        "text": "Meta / UI",
        "type": "Title"
    },
    {
        "element_id": "02235163-f4e4-431d-b182-7748dd06f746",
        "metadata": {},
        "text": "Chat Context Required, Confirmation, Copy, Copy (Extraneous), Erroneous Input, Includes Selection,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "989b3af6-d9d2-41cd-bd19-43b24175c04b",
        "metadata": {},
        "text": "Includes Extraneous Selection, Missing Selection, Paste, Paste (Extraneous), Pasted Code in Chat, Spelling",
        "type": "UncategorizedText"
    },
    {
        "element_id": "18f48d87-7631-414f-8f7b-b36f80afb219",
        "metadata": {},
        "text": "Error, Start Over, Try Again",
        "type": "Title"
    },
    {
        "element_id": "ff9d53ce-0f8e-4842-98d6-9021207e678d",
        "metadata": {},
        "text": "Assistant",
        "type": "Title"
    },
    {
        "element_id": "0154c999-c637-4034-9e46-c34e94f91c99",
        "metadata": {},
        "text": "Appears Fixated, Claims Ignorance, Didn’t Understand, Grants Request (Complete), Grants Request",
        "type": "Title"
    },
    {
        "element_id": "dc2ff5a3-b6b2-4157-8f90-29b214172063",
        "metadata": {},
        "text": "(Incomplete), Offers Help, Provided Wrong Answer, Requests Details, Requests Paraphrase, Response",
        "type": "Title"
    },
    {
        "element_id": "c87f960d-d509-4c2b-a48d-e08dc1d55f1c",
        "metadata": {},
        "text": "Includes Code, Spews Garbage",
        "type": "Title"
    },
    {
        "element_id": "602efe83-21b4-4102-a0fe-e8e0c8343e35",
        "metadata": {},
        "text": "Table 1: Event log codebook. Our codebook contained 46 unique codes, applied separately to participant utterances (Human) and assistant responses (Assistant). Codes in bold were applied to both participant and assistant responses. Human codes were classified as demonstrating either a social or task orientation to the assistant.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fe7f5244-329f-441c-94c7-12de5a06817a",
        "metadata": {},
        "text": "codes to identify meta-information such as utterances that included code, utterances that referenced selected code, utterances that im- plicitly or explicitly referenced earlier portions of the conversation, or non-verbal UI activities such as copies, pastes, and invocations of “try again” and “start over.” Finally, we classified a subset of the human-applied codes based on whether they represented a par- ticipant’s task or social orientation toward the assistant. We list our codes in Table 1, but note that not all of them ended up being relevant to our analysis.",
        "type": "NarrativeText"
    },
    {
        "element_id": "301dba21-6929-4cf3-a1a3-f017794ac1c3",
        "metadata": {},
        "text": "When coding conversational data, we applied individual codes at the level of each conversational utterance. We allowed multiple codes to be applied to each utterance to account for utterances that performed multiple functions (e.g. greeting and self-identification). In order to ensure consistency in how our codebook was applied, two authors coded a 10% sample of the 968 conversational ex- changes, achieving a satisfactory level of inter-rater reliability (Krip- pendorf’s a = 0.77, where agreement was conservatively defined as having all of the same codes applied to both utterances in a conversational exchange).",
        "type": "NarrativeText"
    },
    {
        "element_id": "3672588c-64d3-4891-9864-bbbbf0dec68d",
        "metadata": {},
        "text": "5.2 Expectations and Experience",
        "type": "Title"
    },
    {
        "element_id": "0cda83ae-2b50-42c8-a584-f846bde94d24",
        "metadata": {},
        "text": "Pilot testing of the Programmer’s Assistant suggested that software engineers would be skeptical of a conversational programming assistant and its ability to provide useful assistance. Our study revealed that, for most participants, their actual experience after using the tool was better than they had anticipated. Participants were surprised at the quality of the assistant’s responses and they appreciated how its integration with the code editor reduced the amount of context switching they needed to do in the UL Some participants struggled with the code selection feature, although others appreciated the ability to ask questions related to selected code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "93bdc95f-bfbf-44b1-9e18-5fd35297a2d5",
        "metadata": {},
        "text": "5.2.1 Usage. All of our participants engaged with the Program- mer’s Assistant while working on the challenges, despite there being no requirement to do so. Forty-one participants submitted solutions to all four challenges, and one participant, P14, only sub- mitted solutions for one of the four challenges. Participants spent an average of 68 minutes engaged with the assistant, as measured",
        "type": "NarrativeText"
    },
    {
        "element_id": "4ed61d1a-3c0a-40d6-9075-775e8bb09688",
        "metadata": {},
        "text": "499",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8f2534ab-d491-4bcf-ac2d-d25212456f3a",
        "metadata": {},
        "text": "by the amount of time the Programmer’s Assistant window was in focus.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2c145d41-59ff-445a-a57a-2e3bc6a5ad9a",
        "metadata": {},
        "text": "Participants made an average of 23.0 utterances (SD = 15.1 ut- terances) to the assistant. On average, 6.2 of their utterances (SD = 4.3 utterances) contained a code selection. The average latency per request!* was 6.7 seconds (SD = 3.1 seconds).",
        "type": "NarrativeText"
    },
    {
        "element_id": "cba7484b-85d4-4eef-8568-26298d61da67",
        "metadata": {},
        "text": "We saw a 66.3% rate of acceptance of generated code, where we considered code to be accepted if the participant performed a copy immediately after the code was generated. This acceptance rate is much higher than the 27% acceptance rate reported for Copilot [109]. We believe one reason we observed a higher acceptance rate is because Copilot’s completion suggestions are generated proactively, whereas the Programmer’s Assistant’s suggestions are generated upon request. When copying generated code from the assistant,",
        "type": "NarrativeText"
    },
    {
        "element_id": "de969a9f-d2f7-454d-81be-6fe470ffc176",
        "metadata": {},
        "text": "participants most often copied the entirety of the generated code, and only in 5.8% of cases did they copy a smaller portion of it.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fd33dc25-7c2e-434f-a526-e7bb0702566a",
        "metadata": {},
        "text": "5.2.2 User Experience Expectations & Changed Attitudes. Prior to running our study, we had reason to believe that participants would",
        "type": "NarrativeText"
    },
    {
        "element_id": "88a0fa0c-e19e-4798-b816-f0c428049fb9",
        "metadata": {},
        "text": "be skeptical of a conversational programming assistant. Before de- veloping the Programmer’s Assistant, we showed potential users mockups of a program editor with an integrated chatbot feature.",
        "type": "NarrativeText"
    },
    {
        "element_id": "87d7a931-54b9-4886-a791-538a42577981",
        "metadata": {},
        "text": "These prototypes elicited uniformly negative reactions. People told us about their frustrating experiences with conventional chatbots and raised doubts about the knowledge, capabilities, and value of a conversational programming assistant. This skepticism moti- vated us to develop the Programmer’s Assistant in order to evaluate whether the conversational experience, as powered by a state-of- the-art code-fluent LLM, would be better than people had antici- pated. During pilot testing, we received feedback that the Program- mer’s Assistant provided a much better conversational experience",
        "type": "NarrativeText"
    },
    {
        "element_id": "ad033a27-1fb6-45ed-8b50-ce245c76f024",
        "metadata": {},
        "text": "compared to testers’ previous experiences with chatbots. Thus, in designing our study, we felt it important to first gauge participants’ expectations of a conversational interaction around code, and then measure their experience after the fact.",
        "type": "NarrativeText"
    },
    {
        "element_id": "18a11f96-9585-4f4a-a181-4cd80e39ccd3",
        "metadata": {},
        "text": "\\This time includes additional time added by our proxy server to ensure our confor- mance to the API rate limitation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "98c94812-6539-48bd-adf0-677fc5a56139",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "a530eb37-82fd-4ce1-840d-484b4284f777",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "a78e0668-58b0-484d-bfe3-0d0f94b529c6",
        "metadata": {},
        "text": "We developed a short inventory of six scale items to measure user experience of code work!>. The scale was administered twice: once before participants were exposed to the Programmer’s Assistant (but after they had been briefed that they would interact with an AI chatbot), and once after completing the programming challenges. The items were presented with the appropriate tense: Do you expect (Did you find that) the Programmer’s Assistant: (a) will be (was) easy to use; (b) will understand (understood) your requests; (c) will provide (provided) high quality responses; (d) will help (helped) you to write better code; (e) will help (helped) you to write code more quickly; (f) will be (was) enjoyable to use. Each item was rated ona 4-point scale of extent: Not at all (1), A little (2), Somewhat (3), A great deal (4).",
        "type": "NarrativeText"
    },
    {
        "element_id": "fc3aedc5-7068-4c74-86d5-f2b0879ac793",
        "metadata": {},
        "text": "A factor analysis revealed the items on this scale measured a single construct, which we identify as user experience (Cronbach’s a = 0.87). Thus, we computed two scores of user experience (UX) for each participant: a pre-task UX score computed as the average of their six pre-task expectation scale responses, and a post-task UX score computed as the average of their six post-task experience scale responses.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9088d28b-6680-449b-b83b-f4fea7e04544",
        "metadata": {},
        "text": "We found that participants had lower initial expectations for their experience with a conversational programming assistant (pre- task UX M (SD) = 3.0 (0.62) of 4) than their experience actually was (post-task UX M (SD) = 3.6 (0.32) of 4). A paired sample t-test shows that this difference was significant, t(41) = 5.94, p < .001, Cohen’s d = 0.92 (large). Measured another way, 32 participants (76.2%) had post-task UX ratings that were higher than their pre- task expectations, demonstrating a significant shift in attitudes toward conversational programming assistance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c5e7bc34-ead3-42e2-b952-44bd972aa253",
        "metadata": {},
        "text": "However, the UX ratings alone fail to capture participants’ nu- anced expectations of the assistant and the reasons for their shifted attitudes after using it. Participants expressed a variety of expecta- tions of the assistant before using it, including that it would be easy to use (P30) and produce correct responses (P30), understand the problem and what is being asked of it (P8, P9, P11), not interfere with their flow state (P5), produce imperfect or questionable out- puts (P6, P21), improve with feedback (P31), provide generic and unhelpful answers (P17) or only answer basic questions (P40), and produce responses quickly (P40).",
        "type": "NarrativeText"
    },
    {
        "element_id": "e39fd4bb-2d25-4bb1-8611-3bf0690659c5",
        "metadata": {},
        "text": "P17 expected “to be frustrated very quickly and that what I'd think would be relatively common questions would be responded to with generic, unhelpful answers.” P6 explained, “I didn’t have very good experiences with chatbots. I think I’ll need to spend more time in reviewing and fixing the suggestions than in writing the code myself. from scratch.” P11 had a more balanced view, that “It'll do some tasks really well, but others will not be as reliable.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "046fe87b-ec55-4039-b8b5-31879fd62588",
        "metadata": {},
        "text": "After interacting with the Programmer’s Assistant, many par- ticipants commented on how the experience was better than they anticipated, because it “seemed to be able to handle complex issues” (P10) and “was a great help” (P8). P20 felt it was “incredible!” P6 and P17, who were both initially skeptical, reported having a positive experience. For P6, “It absolutely exceeded all my expectations, in",
        "type": "NarrativeText"
    },
    {
        "element_id": "e9bc4ef6-0435-411d-8342-d8d0a9ea3a96",
        "metadata": {},
        "text": "15Qur scale items were modeled from scales published in Weisz et al. [103, Table 9 - Al Support] that measured constructs including ease of use (item 3), response quality (item 1), the production of higher-quality code (item 5), and the ability to write code more rapidly (item 4). We added additional items to cover the constructs of request understanding and enjoyment, and we cast all items on a 4-point scale of extent.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b3fd5185-ffe9-43e9-beab-43ecb26b9028",
        "metadata": {},
        "text": "500",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2e5b93ab-900b-4e7d-b736-ef2212fe468e",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "dc1521e3-c2f9-49cc-8527-aa7635e3b597",
        "metadata": {},
        "text": "all aspects that I could have imagined and more!” P17 provided a more quantitative assessment: “Initial expectations: 3 Actual: 9.5.” P38 was emphatic in their evaluation: “I was blown away how well it allowing me to structure how I want the code to look and work and just giving me the thing I asked for.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "12974947-5bdf-4af1-bf36-ae7605a48cf4",
        "metadata": {},
        "text": "Many participants described a sense of surprise in their experi- ences. P9 was surprised by how well it understood their requests:",
        "type": "NarrativeText"
    },
    {
        "element_id": "191d2143-06df-4ba6-8586-ce9d83f00741",
        "metadata": {},
        "text": "“I was surprised at how well the Programmer Assistant was able to understand my requests and generate good code/documentation/tests. It understood major concepts and was able to explain it to me in a clear way, and it was also able to understand and write functional code. It even was able to help me review my answer. I was also surprised at how well it could understand the context of what I was asking in follow-up questions when I did not specify exactly what I was talking about, but rather referencing our prior conversation (such as, ‘what does that mean’).” (P9)",
        "type": "NarrativeText"
    },
    {
        "element_id": "37a40133-f6ed-418c-ba82-5aede0a7c17f",
        "metadata": {},
        "text": "Similarly, P6 was surprised that they liked the conversational interaction when they expected that they wouldn’t:",
        "type": "NarrativeText"
    },
    {
        "element_id": "c208d6c1-33ce-477d-a3cc-b0e64527b07a",
        "metadata": {},
        "text": "“I though[t] I wouldn’t like the chatbot interaction and that I would prefer something like the tool I’ve seen in those demos [of Copilot]. But surprisingly, after using the chatbot (and seeing the results: easy to use, it un- derstands well, I felt it like a partner) I like this kind of help.” (P6)",
        "type": "NarrativeText"
    },
    {
        "element_id": "6ea12d72-8a8f-4a08-af1c-3725e46ab2c4",
        "metadata": {},
        "text": "5.2.3 Quality of Assistant’s Responses. In order to gauge the quality of responses produced by the Programmer’s Assistant, we examined the 910 task-oriented requests made by participants in the study. For the vast majority (80.2%), the assistant produced a correct re- sponse (Grants Request (Complete)); in other cases, the assistant’s response was incorrect (9.6%; Provided Wrong Answer), correct but incomplete (4.4%; Grants Request (Incomplete)), or the assistant didn’t understand (3.4%; Didn’t Understand), claimed ignorance of the subject (1.5%; Claims Ignorance), or produced another type of response (0.9%; Appears Fixated, Spews Garbage).",
        "type": "NarrativeText"
    },
    {
        "element_id": "33ba4362-61c6-4117-8692-02dbe5718f39",
        "metadata": {},
        "text": "Participants also reported experiencing this variability in the quality of the assistant’s responses. Some participants described how the assistant provided “detailed answers” (P17) and “high qual- ity outputs” (P18) that were “surprisingly good” (P2). P6 felt it was “incredible to see the quality of the responses,” and P3 even explored the assistant’s capabilities outside the scope of the challenges and found that it could handle those as well:",
        "type": "NarrativeText"
    },
    {
        "element_id": "3b75003c-2ae3-43ab-804c-76120f588f32",
        "metadata": {},
        "text": "“It was surprising the quality of the code and the ability to answer all my questions correctly. Although I think the challenges may be biased towards what the Assistant is able to do, it was a great experience because I asked many other things and it was able to answer correctly.” (P3)",
        "type": "NarrativeText"
    },
    {
        "element_id": "3b02c5e1-1d38-4055-a59c-2656e5836eda",
        "metadata": {},
        "text": "Of course, the Programmer’s Assistant wasn’t perfect, and some participants did run into issues. For P35, “The documentation gener- ation did not perform very well.” P16 questioned the accuracy of the knowledge encoded in the model: “Does the model need to be up- dated? It said latest python version is 3.7 but google says it’s 3.10.” In some instances, participants needed to ask their question multiple",
        "type": "NarrativeText"
    },
    {
        "element_id": "d7cdd51b-9705-42b1-9a0c-0478f0504657",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "96a20246-1d37-458f-b44f-d163ebf6743d",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "c5704552-245c-4059-b0f5-0ff41dfc50ba",
        "metadata": {},
        "text": "times to get a good response: “you need to ask many times if you want to get an answer and also a detailed explanation” (P3). P27 felt, “it was annoying when I asked it to try again and it would give me the same response.” P22 struggled because, “It didn’t seem to handle multiple sentences well.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "ddb38606-17d4-4241-a3b2-afcf3fd3cbdc",
        "metadata": {},
        "text": "P28 perhaps offered the most scathing criticism, that, “It makes mistakes often enough to be not very practical.” However, despite the production of poorer-quality responses, other participants felt that the assistant was still helpful. P36 reported that, “Only minor tweaks were normally needed to correct any issues.” Similarly, P38 described how the assistant wasn’t able to completely solve their problem, but provided a useful start:",
        "type": "NarrativeText"
    },
    {
        "element_id": "b97b98fd-be22-4291-9b34-e2669b9cfc3b",
        "metadata": {},
        "text": "“There was only one hickup I noticed where when I asked it to memoize fibonacci it couldn’t, but it dropped the building blocks on my lap for me to finish so that was fine, that was like minutes of effort on my part.” (P38)",
        "type": "NarrativeText"
    },
    {
        "element_id": "e445224a-5150-44ac-b045-d441a146e54b",
        "metadata": {},
        "text": "5.2.4 UI Design & Affordances. Participants made many comments on our specific UI design and the affordances provided (or not provided) in our chat-augmented editor. Overall, the integration between the chat pane and the code editor was “very good” (P23), with a “nice interface between the code pane and the assistant pane” (P17) that “makes it really convenient” (P35).",
        "type": "NarrativeText"
    },
    {
        "element_id": "725d84e8-7bb7-4490-92b9-12163ab7df14",
        "metadata": {},
        "text": "Prior research by Brandt et al. [15] has shown how keeping developers focused in their IDE improves productivity, and our participants expressed similar sentiments. P40 remarked, “It allows me to stay in one browser window/tab!” and P12 hinted at how the interface might preserve their flow state by “prevent[ing] me from getting distracted when looking into an issue in another tab.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "b5b31fb1-dbb6-4207-8fee-a18e5899cc91",
        "metadata": {},
        "text": "Some aspects of our user interface were confusing to participants, such as the mechanism for selecting code to be included in the conversational context. P7 remarked, “It’s was a little confusing doing the selection part for it to tell me what a function does, but... it gave me code that was insanely easy to copy and paste.” Other participants appreciated the code selection mechanism, such as P11: “I enjoyed the code selection feature, and found that very easy to use.” In the event logs, we identified 20 instances in which a participant unintentionally included selected code in the conversation when it wasn’t needed (Includes Extraneous Selection), 12 instances in which a code selection was omitted when it was needed to provide context for the question (Missing Selection), and 16 instances in which a participant copy/pasted code directly into the chat rather than selecting it in the editor (Pasted Code in Chat). Although these cases represent a small fraction of the 227 instances in which a code selection was required and included in the conversation (Includes Selection), their presence does indicate that more attention is needed to the interaction design of code selection.",
        "type": "NarrativeText"
    },
    {
        "element_id": "17ffc731-e98a-4b3a-8215-5bae7278a504",
        "metadata": {},
        "text": "Another issue regarded the awareness of the “try again” and “start over” features. The “try again” feature was only used by 14 participants, who used it a total of 63 times over the course of the study. Some participants used it specifically when they got an answer which they saw as clearly wrong, while others used it to get a variety of possible answers before proceeding. The “start over” feature was used even less, by 5 participants who used it a total of 6 times. Despite our effort to surface these conversational features in the UI via shortcut buttons, they may not have been sufficiently",
        "type": "NarrativeText"
    },
    {
        "element_id": "3b14cd69-4762-4781-9120-8693f358e022",
        "metadata": {},
        "text": "501",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3359a9c8-99a4-4845-8709-fc4d0232067d",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "b5572f96-0cef-4b95-b48f-ab48a3dd8296",
        "metadata": {},
        "text": "noticeable or salient: “The ‘try again’ button is not so reachable, often times I forgot it exists” (P23). By contrast, at least one participant was successful with these features:",
        "type": "NarrativeText"
    },
    {
        "element_id": "806cfe25-1ff1-4d48-8b4d-cfc9e570d43a",
        "metadata": {},
        "text": "“at some point it had issue with challenge 3 and I had to start over. Just asking ‘try again’ was not enough and I was getting always the same (wrong and not related) answer. starting again solved the issue!” (P20)",
        "type": "NarrativeText"
    },
    {
        "element_id": "5fccb910-c442-4a52-b796-2f491d7bae0f",
        "metadata": {},
        "text": "5.3",
        "type": "UncategorizedText"
    },
    {
        "element_id": "dcc69632-33c4-4f05-a375-378f1ecb270d",
        "metadata": {},
        "text": "Our next set of themes concerns the utility provided by conversa- tional programming assistance. Participants felt the assistant was highly valuable and desired to use it in their own work. They felt it would be most helpful for smaller or narrowly-scoped tasks, but able to provide a wide variety of types of assistance. The fact that the interaction model was conversational and grounded in code were valuable aspects, as was the ability for the assistant to bolster",
        "type": "NarrativeText"
    },
    {
        "element_id": "850c381f-21a4-41cf-a682-ec91eeab0ba5",
        "metadata": {},
        "text": "Utility of Conversational Assistance",
        "type": "Title"
    },
    {
        "element_id": "c2d0c6d0-7659-4c3e-a23b-d7db7e443302",
        "metadata": {},
        "text": "users’ learning about programming topics through that interac- tion. Participants did question whether they could trust and rely upon the assistant’s responses, echoing a similar theme discussed in Weisz et al. [102].",
        "type": "NarrativeText"
    },
    {
        "element_id": "781c79a8-a100-46e5-82c4-e44b89ae26ed",
        "metadata": {},
        "text": "5.3.1 Value & Appropriate Tasks. Participants rated the value of the Programmer’s Assistant highly (M (SD) = 8.6 (1.4) of 10). Many participants asked questions such as, “Can I have it in my editor please?” (P15), or made comments that, “I would enjoy using it in the future” (P36), “I would love to be able to... have access to it for my coding” (P37), and ‘Td love to use this tool as part of my usual programming workflow if I could!” (P39). Some of the reasons why participants found it valuable are because it “help[s] me remember how to do things in certain languages that normally I would just Google” (P9) and “It helps me to avoid silly syntax errors and can when I cannot remember exact function/method names and required arguments” (P40). We did not observe any differences in value ratings based on participants’ familiarity with or recency of using Python.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d44f637e-0657-40ec-9039-2b97f55da4d4",
        "metadata": {},
        "text": "Participants described a wide variety of tasks for which they felt the assistant would be useful. These tasks included “ordinary” (P23), “simpler” (P2), and “small, repetitive” (P4) tasks such as “quick lookups” (P25) for “short chunks of code” (P11) or for “narrowed questions” (P26). Participants also felt the assistant was useful for “small containable novel algorithms” (P38) and ‘little coding problems” (P4).",
        "type": "NarrativeText"
    },
    {
        "element_id": "8386f84e-0a6f-4f85-bdc2-fb2c7723bf55",
        "metadata": {},
        "text": "Several kinds of task assistance were reported as being valuable, such as explaining code (P31), implementing business logic in a UI (P38), understanding what code does (P19, P37), and recalling language syntax, method names, and arguments (P12, P15, P20, P40, P42). P27 felt that the assistant was “More helpful when recognizing a specific well known algorithm but not things you make yourself.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "11c7472b-de04-44b9-be1e-afbf18a8c151",
        "metadata": {},
        "text": "Participants also made recommendations for how to increase the value of the Programmer’s Assistant. P38 suggested, “What would blow me away though is if it’s able to help with what I do most often which is to integrate, refactor and iterate on an existing system.” P16, P26, and P38 all desired more information on the data sources used to produce the assistant’s responses. P9 requested to “Have the Programmer’s Assistant examine your code and make proactive suggestions for improving it in the chat.” P36 requested the same,",
        "type": "NarrativeText"
    },
    {
        "element_id": "9ec6e955-9091-4f3d-96d7-052c8d2e4562",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "504beeff-35c4-419a-b2ab-fd550b6006ca",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "3a37f4c5-5f19-4075-86ee-af668293068c",
        "metadata": {},
        "text": "but cautioned that, “Care would need to be taken to avoid becoming an annoyance or disrupting the flow of a coding session.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "2ad7a7da-554b-4d30-8c88-b860171280b4",
        "metadata": {},
        "text": "In the post-task survey, we probed participants on how certain changes to the Programmer’s Assistant would either decrease, in- crease, or result in no change to its value. Over 75% of participants felt that the assistant would be more valuable if it operated in a proactive manner, either by making improvement suggestions in the chat or as comments directly in the code. Similarly, 78.6% of participants felt that having more buttons in the UI for common features such as explaining or documenting code would make the tool more valuable.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6bf1b17b-a84d-468d-b3ed-cecdd479e171",
        "metadata": {},
        "text": "5.3.2 Conversational Interactions Grounded in Code. One of the challenges in interpreting participants’ comments about the utility of the Programmer’s Assistant was in disentangling the extent to which value was derived from the quality of the underlying model versus the integration of conversation in a code context. Indeed, participants felt that the chat interaction was valuable: 69.0% of participants felt that eliminating the conversational interaction and making the assistant behave more like web search would de-",
        "type": "NarrativeText"
    },
    {
        "element_id": "b7374e65-2c71-447a-a96e-33dd76c53e0b",
        "metadata": {},
        "text": "crease its value. Further, our analysis of the conversation transcripts revealed that 42% of the 910 task-oriented utterances from partic- ipants required historical conversational context (Chat Context Required) in order to be correctly interpreted. Thus, we observe that behaviorally, participants did rely on conversational context in their interactions.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1b246135-58d0-4131-937f-c21f4c7c2da1",
        "metadata": {},
        "text": "In the post-task survey, 83% of participants rated the importance of the ability to ask follow-up questions as being “somewhat” or “a great deal.” Several participants specifically commented on the value of this conversational context. P39 remarked, “I absolutely loved how you can straight up ask follow-up questions to the Programmers’ Assistant without having to reiterate the original topic/question.” P15 expressed a similar sentiment, saying, “I think the conversational context was someone helpful, just in communicating that it’s a running conversation where my context is remembered.” P9 provided a similar analysis:",
        "type": "NarrativeText"
    },
    {
        "element_id": "27d54015-c537-4f27-a357-a54969d4ee56",
        "metadata": {},
        "text": "“This tool was so helpful at answering questions I had about the code in the context of the code I am working on... I was also impressed with how well it was able to remember the context of our conversation, especially when I asked vague follow-up questions.” (P9)",
        "type": "NarrativeText"
    },
    {
        "element_id": "fef6116b-209e-4887-a4b6-58da1194d310",
        "metadata": {},
        "text": "In addition, some participants identified how a conversational interaction grounded in code was useful, “because I think to ‘un- derstand’ the dev context could be VERY important” (P31). In fact, 24.9% of task-oriented utterances included a relevant code selection (Includes Selection), showing that participants valued this ability.",
        "type": "NarrativeText"
    },
    {
        "element_id": "73d327ee-fe05-4f9a-b39a-50a37085c28b",
        "metadata": {},
        "text": "Contrasting with these participants, P18 felt that interacting with the assistant conversationally was tedious, and they employed a more direct approach:",
        "type": "NarrativeText"
    },
    {
        "element_id": "a623a525-a8f6-4f5a-8181-73cf58eb62c8",
        "metadata": {},
        "text": "“T really like the PA. But, I didn’t converse with it like a chat bot. I often told it what to do (‘Document this code.’) as opposed to asking it what to do (‘How do I document this code?’). Talking to it the way that was suggested in the tutorial seemed overly verbose/tedious.” (P18)",
        "type": "NarrativeText"
    },
    {
        "element_id": "b5d7e9dd-7bc6-4bf2-bbaf-dab07dcf7b1f",
        "metadata": {},
        "text": "502",
        "type": "UncategorizedText"
    },
    {
        "element_id": "db0933c0-6728-4f34-9a65-2c9ef97dd52a",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "eb41a793-c3a2-4b7b-b3a7-39f319afefbd",
        "metadata": {},
        "text": "Despite these individual differences in interaction preferences, P39 envisioned that both interaction styles could be supported in the tool:",
        "type": "NarrativeText"
    },
    {
        "element_id": "fadf4973-2314-489a-95d5-c01bbde63bfd",
        "metadata": {},
        "text": "“I think both options should exist: people should be able to input their queries like a search bar AND also give their question as if in conversation.” (P39)",
        "type": "NarrativeText"
    },
    {
        "element_id": "24398404-d808-4a37-8cc6-540aa465cbc6",
        "metadata": {},
        "text": "5.3.3 Learning Effects. One specific benefit of the Programmer’s Assistant identified by participants is its ability to help people improve their programming skills and reinforce knowledge gaps. For example, it can help users “remember how to do things in certain languages... such as, when I am using a language I haven’t used in a while” (P9). The assistant can also serve as an memory aid, such as when ‘I use a lot of libraries that I don’t always remember all of the functions” (P15). Similarly, P31 said, “No matter how good you're as a developer, you can’t (humanly) remember all the API of hundreds of libs or new languages... I'd learn new dev lang and new lib/frameworks faster.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "9d76c7a0-ee04-45bb-96da-cace7a958f2a",
        "metadata": {},
        "text": "P39 felt the assistant “is perfect for programmers of all levels,” and P1 felt it could help them rapidly improve their Python skills:",
        "type": "NarrativeText"
    },
    {
        "element_id": "34821581-059a-4611-9ac4-dba413ee8228",
        "metadata": {},
        "text": "“I have wanted to learn python... The main concern how much time spent learning is needed before I could actually get some value out of learning python. I have a feeling this would cut that time down from weeks to a day or so.” (P1)",
        "type": "NarrativeText"
    },
    {
        "element_id": "829705d5-adf9-4c00-8a0e-e0d6e530bc40",
        "metadata": {},
        "text": "P39 also identified the fact that, because the interactions with the assistant are conversational, it forces people to learn how to communicate to others about their code:",
        "type": "NarrativeText"
    },
    {
        "element_id": "cf2ed4aa-625e-45bf-87ce-d43d10f19559",
        "metadata": {},
        "text": "“The conversation aspect promotes proper communi- cation, which would really stand to benefit budding programmers if they want to learn how to explain con- cepts more fluently in the future to their colleagues.” (P39)",
        "type": "NarrativeText"
    },
    {
        "element_id": "a209297e-6b28-4858-bd69-0ad053a1644e",
        "metadata": {},
        "text": "Conversely, P36 suggested that over-reliance on programming assistance might have a detrimental effect to one’s learning:",
        "type": "NarrativeText"
    },
    {
        "element_id": "c2192356-650b-458f-a210-19537ffafc6d",
        "metadata": {},
        "text": "“It’s definitely a huge time saver, but over-reliance on it may cause new developers to skip learning the reference material themselves and discovering new things and sparking new ideas.” (P36)",
        "type": "NarrativeText"
    },
    {
        "element_id": "d1323c7b-e307-4c67-b462-041cba984023",
        "metadata": {},
        "text": "5.3.4 Trust. Many participants raised questions about whether they could trust the responses provided by the Programmer’s Assis- tant. P21 asked this question most directly: “will the code be correct, safe, efficient?” Other participants raised similar questions, such as, “I’m wondering how it validates it’s answers, if it can be trusted to always give a working answer” (P10), and “Sometimes lack of source and context may raise doubts in the mind of the programmer” (P16).",
        "type": "NarrativeText"
    },
    {
        "element_id": "52245caf-06ae-40df-b4c6-8192ada2e58d",
        "metadata": {},
        "text": "These issues of trust were exacerbated by the fact that the Pro- grammer’s Assistant did not allow participants to actually run their code. Because of this limitation, participants had to rely on their own knowledge to judge the correctness of the assistant’s responses. P19 asserted, “There is no way to evaluate if the Programmer’s as- sistant is giving you the right advise or not other than your own knowledge,” and P9 concurred: ‘I had to trust that it was correct (and use my own prior knowledge).”",
        "type": "NarrativeText"
    },
    {
        "element_id": "369dbf4f-8d95-4a53-b4ea-d264f6b6ac7e",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "2272d849-1901-4660-8d15-63b8580b288f",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "ffa95191-7877-4b03-8050-bdf716621e75",
        "metadata": {},
        "text": "P18 described the potential consequences of allowing the assis- tant to write code for them: “The only thing that made me nervous was that it could have introduced a bug that wasn’t immediately appar- ent. And given I didn’t write the code, I could have easily glossed over a mistake when reviewing it. Especially if it is also the one writing the test cases.” (P18)",
        "type": "NarrativeText"
    },
    {
        "element_id": "c1898656-7931-4b7e-ae21-ce0a3a54852b",
        "metadata": {},
        "text": "Despite our efforts to make the Programmer’s Assistant respond in non-authoritative ways, we did observe participants sometimes uncritically accept generated results that were clearly wrong or incomplete. Thus, we did find behavioral evidence for over-reliance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fa31ae61-7cb9-4af4-841d-03e8b642a7e6",
        "metadata": {},
        "text": "Listing 2: Building trust through explanations and justifica- tions",
        "type": "NarrativeText"
    },
    {
        "element_id": "c6d3d1dc-6931-43ba-b946-7dd6504614b1",
        "metadata": {},
        "text": "1 |P9: what is a unit test?",
        "type": "NarrativeText"
    },
    {
        "element_id": "0241069c-ef12-4e77-84c6-719e70a185d6",
        "metadata": {},
        "text": "2",
        "type": "UncategorizedText"
    },
    {
        "element_id": "45f5c7fc-58f5-40ed-8642-b8cfef6d7f55",
        "metadata": {},
        "text": "3 | Socrates: A unit test is a test of a single function 4 or method. It is typically written by the 5 programmer who wrote the code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "229dcac6-c69f-4e59-938e-cdb81484869f",
        "metadata": {},
        "text": "6",
        "type": "UncategorizedText"
    },
    {
        "element_id": "067e88f9-84e7-4389-8e89-d76230453c74",
        "metadata": {},
        "text": "7 | P9:",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8df9119b-e6c4-4789-9618-cf15bf369470",
        "metadata": {},
        "text": "8 def euclid(a, b):",
        "type": "Title"
    },
    {
        "element_id": "298a3328-68f4-474a-91fb-d085d699ec1d",
        "metadata": {},
        "text": "9 while b != 0:",
        "type": "Title"
    },
    {
        "element_id": "8bd9ced4-4f0f-4e14-951f-3b2aa9fddf9f",
        "metadata": {},
        "text": "10 (a, b) = (b, a % b)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "14def8db-3706-4a47-ac35-fadfd24e3b38",
        "metadata": {},
        "text": "1 return a",
        "type": "Title"
    },
    {
        "element_id": "7f377c74-d3a6-460f-8efd-6c2e602300d4",
        "metadata": {},
        "text": "12",
        "type": "UncategorizedText"
    },
    {
        "element_id": "cce4144f-1606-4ef9-9c23-ff231d9d3eb6",
        "metadata": {},
        "text": "3 how would I write a unit test for this code? 14",
        "type": "NarrativeText"
    },
    {
        "element_id": "81a5da5d-563b-468e-b34d-aec65f63a7fb",
        "metadata": {},
        "text": "15 | C...]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8b598a18-e37d-4682-a050-478b1b2b13c2",
        "metadata": {},
        "text": "16",
        "type": "UncategorizedText"
    },
    {
        "element_id": "7cf6c116-ea4d-4ca4-ab6c-67a0b27546c5",
        "metadata": {},
        "text": "17 | Socrates: I think you would do something like this:",
        "type": "NarrativeText"
    },
    {
        "element_id": "4629a7cb-8c7b-4d40-bab5-a3c685166f42",
        "metadata": {},
        "text": "19 def test_euclid():",
        "type": "Title"
    },
    {
        "element_id": "d32f370c-dd48-4886-98e5-1f4773d0bbd5",
        "metadata": {},
        "text": "20 assert euclid(2, 4) == 2",
        "type": "Title"
    },
    {
        "element_id": "225f5582-84c0-4f75-9682-f859af4dc9f0",
        "metadata": {},
        "text": "21 assert euclid(6, 9)",
        "type": "Title"
    },
    {
        "element_id": "a4f43035-16ef-47c3-abd2-6718e3edd9e4",
        "metadata": {},
        "text": "22 assert euclid(17, 12)",
        "type": "Title"
    },
    {
        "element_id": "2665d0f9-ac44-4bdd-abc0-f7ae60a465dc",
        "metadata": {},
        "text": "23 assert euclid(4, 4)",
        "type": "Title"
    },
    {
        "element_id": "ef7fbe6f-8544-45f9-b815-e9085a88bb40",
        "metadata": {},
        "text": "24",
        "type": "UncategorizedText"
    },
    {
        "element_id": "04050bf9-00b0-41ea-8455-284bc85679cc",
        "metadata": {},
        "text": "25 | Po: what is a euclid function",
        "type": "NarrativeText"
    },
    {
        "element_id": "23112aeb-881f-48f6-8e4f-5561b8085592",
        "metadata": {},
        "text": "26",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fbce4e4e-468e-430f-a389-2c1af134806b",
        "metadata": {},
        "text": "27 | Socrates: The euclid function is a function that 28 computes the greatest common divisor of two 29 numbers.",
        "type": "NarrativeText"
    },
    {
        "element_id": "291b73fe-b4c0-4a6f-8af1-239e2be94a5f",
        "metadata": {},
        "text": "30",
        "type": "UncategorizedText"
    },
    {
        "element_id": "7af1e6c2-0c0c-4520-8a06-5fc7bcc2f491",
        "metadata": {},
        "text": "31 | Po: is this a good unit test for a euclid",
        "type": "NarrativeText"
    },
    {
        "element_id": "0adc5c56-525d-4540-ae70-eb79df54e5cf",
        "metadata": {},
        "text": "32 function",
        "type": "Title"
    },
    {
        "element_id": "2077b735-a389-4666-8fed-77931f13b252",
        "metadata": {},
        "text": "33",
        "type": "UncategorizedText"
    },
    {
        "element_id": "057a2865-1c83-4928-83a0-a766352af2c4",
        "metadata": {},
        "text": "34 | Socrates: I believe that it is a good unit test for 35 a euclid function.",
        "type": "NarrativeText"
    },
    {
        "element_id": "56d48fae-177c-48b5-b48f-88b40c48ba56",
        "metadata": {},
        "text": "36",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2c4aac61-6df9-4f9b-bdf0-582948bcc983",
        "metadata": {},
        "text": "37 | Po: why",
        "type": "Title"
    },
    {
        "element_id": "b4449efc-f32d-41d3-9a4c-07b13209ab2d",
        "metadata": {},
        "text": "38",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fe403b6e-2910-40f9-9dcf-8a98403c5aaf",
        "metadata": {},
        "text": "39 Socrates: It seems to me that it tests the edge",
        "type": "NarrativeText"
    },
    {
        "element_id": "8b6f3c94-a0fa-43e8-b2fc-63a5fafabb7b",
        "metadata": {},
        "text": "40 cases of a and b being equal, a being",
        "type": "NarrativeText"
    },
    {
        "element_id": "9a13d1ba-2c9d-4ee0-9326-00703563f800",
        "metadata": {},
        "text": "41 greater than b, and b being greater than a. 42",
        "type": "NarrativeText"
    },
    {
        "element_id": "2966010a-adb4-4dad-b89a-52b397fe7d01",
        "metadata": {},
        "text": "43 | 0...",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a15809b4-f0dc-4df5-9e1d-0cc0ce8d0f66",
        "metadata": {},
        "text": "44",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2668bf06-4d17-4b44-ad05-f7e83c759258",
        "metadata": {},
        "text": "45 | Po: thanks Socrates this was helpful",
        "type": "NarrativeText"
    },
    {
        "element_id": "de2b3a26-9b90-4032-9ab3-b78371e1f330",
        "metadata": {},
        "text": "46",
        "type": "UncategorizedText"
    },
    {
        "element_id": "7af0a9ee-3213-4941-be5e-674affe32ddc",
        "metadata": {},
        "text": "47 | Socrates: Always happy to help.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9565c8cd-7dc2-4cff-a080-5e84fe74f38b",
        "metadata": {},
        "text": "One way to address trust issues is for the assistant to provide further explanations and justifications that can calibrate a user’s confidence in the assistant’s responses. Such explanations could be requested conversationally, though most participants did not attempt to do so. One participant (P9) did ask for such explanations, and we show a summary of their transcript in Listing 2. In this instance, P9 asked for a definition of a unit test (line 1), an expla- nation of the code being tested (line 25), and justifications of the",
        "type": "NarrativeText"
    },
    {
        "element_id": "408dbc4b-e341-48fc-8d88-7bae4e14d816",
        "metadata": {},
        "text": "503",
        "type": "UncategorizedText"
    },
    {
        "element_id": "abef1d64-e35c-435b-b4a0-eacc86c6fe78",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "b10a0dbd-614c-4cda-84af-f11ae64bfb64",
        "metadata": {},
        "text": "quality of the unit test (lines 31& 37). Thus, we observe that the assistant is capable of producing explanations and justifications when asked.",
        "type": "NarrativeText"
    },
    {
        "element_id": "10dc82a1-12b3-4344-a617-fab3b05ce7ac",
        "metadata": {},
        "text": "5.4 Patterns of Interaction and Mental Models",
        "type": "Title"
    },
    {
        "element_id": "b1e0a0a4-864f-4c55-aeef-ab5dc5994a27",
        "metadata": {},
        "text": "Participants interacted with the assistant in a variety of ways with two main patterns of usage standing out: (1) invoking the assis- tant to solve the entire programming challenge, and (2) breaking the challenge down into a set of smaller tasks and invoking the assistant’s help for each. There were no clear differences in how participants with differing Python experience approached the tasks.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0d8f4a44-8120-4e9c-b043-b0a3a1dbd2b1",
        "metadata": {},
        "text": "Participants’ mental models of the assistant also varied. Although participants strongly saw the role of the assistant as being a tool, their behaviors revealed that in many cases, they actually treated it as a social agent. In addition, participants ascribed various mental capacities to the assistant, such as having the ability to understand, compute, and learn.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2a8a0845-09ed-4b16-86f1-f1465dc4ec7b",
        "metadata": {},
        "text": "Participants felt the assistant changed the nature of their work process. For some participants, it enabled them to focus on the higher-level aspects of development because the assistant handled lower-level details or provided partial solutions for them to build upon. Many participants felt the assistant sped up their work and helped them remain focused on their tasks.",
        "type": "NarrativeText"
    },
    {
        "element_id": "94121bf6-330f-4987-950f-75db0ca37d60",
        "metadata": {},
        "text": "Finally, participants drew comparisons between the Program- mer’s Assistant with other forms of programming support such as Copilot and web search. They felt that the conversational style of interaction enabled them to discover new, emergent behaviors from the model that were unavailable from Copilot’s focus on code autocompletion. They also felt that the examples provided by the assistant were more readily usable within their own code compared to browsing for answers within search results, speeding up the coding process. However, some participants advocated for a bal- anced approach to the design of programming assistance tools by incorporating multiple modes of interaction rather than fixating ona single one.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7fb89aed-5af5-44e1-b6fe-3519a316a897",
        "metadata": {},
        "text": "5.4.1 Interaction Styles and Assistant Role. We observed that par- ticipants interacted with the Programmer’s Assistant in strikingly different ways. Some participants would present the entire chal- lenge description to the assistant and then work with the results it produced. Other participants approached the programming chal- lenges in a piecemeal fashion, breaking them apart into a set of smaller tasks, then invoking the assistant to aid with each one.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cba6a526-9377-4a17-a90b-87efeb958f6b",
        "metadata": {},
        "text": "Experience with Python was not a determinant of how partici- pants approached the programming challenges, but it did seem to impact how participants interacted with the assistant. Less experi- enced participants tended to ask the assistant basic questions such as, “What is a unit test” (P29, not familiar with Python) and “how do I document a function?” (P27, < 1 year of experience). More expe- rienced participants made detailed requests about specific Python libraries or algorithms, such as, “given a pandas dataframe with two columns ‘Date’ and ‘Sales’ please use matplotlib to draw me a scatterplot” (P38, 3+ years of experience) and “implement a runge- kutta algorithm for solving an ODE with adaptive time steps” (P37, 3+ years of experience).",
        "type": "NarrativeText"
    },
    {
        "element_id": "e9bd2c26-d12a-47c3-908b-3ded5788715c",
        "metadata": {},
        "text": "Another difference we observed in how people interacted with the assistant stemmed from their view on the role it played in their",
        "type": "NarrativeText"
    },
    {
        "element_id": "261822c1-deb1-466a-a367-0f2bc140ec26",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "ebf16b7b-2efb-4c9d-923b-fe8fecbef06a",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "ab9c8e7e-fc87-4334-8161-3688d8e60dad",
        "metadata": {},
        "text": "collaborative process. Some participants, such as P18, treated it more as a tool by issuing commands rather than asking questions. As quoted earlier, they said, “I didn’t converse with it like a chat bot.” P5 described their interaction style similarly: “I found myself wanting to type search queries into Socrates, not treating it as a person but as a search tool.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "3d20eb3f-a0c9-4ea9-8db5-97ef07c87720",
        "metadata": {},
        "text": "In anticipation that participants would have different orienta- tions to the assistant and its role, we asked a question on the post- task survey about the different kinds of roles the assistant might take. These roles generally fell into one of two categories: a tool orientation (a tool, a reference guide, a content generator, a problem solver), and a social orientation (a collaborator, a colleague, a coach, an advisor, a reviewer). Participants rated the extent to which they viewed the Programmer’s Assistant in each of these roles on a 4- point scale of extent: Not at all (1), A little (2), Somewhat (3), or A great deal (4).",
        "type": "NarrativeText"
    },
    {
        "element_id": "9c19de31-7fbd-4971-bd0c-6ab7f2968ffb",
        "metadata": {},
        "text": "100- o-",
        "type": "UncategorizedText"
    },
    {
        "element_id": "bfb43ac0-a732-4e20-b178-cded5967af7a",
        "metadata": {},
        "text": "Percentage of participants",
        "type": "Title"
    },
    {
        "element_id": "cf47a3b8-7367-4132-b9ba-228f0a0fa6a3",
        "metadata": {},
        "text": "Tool Content ‘Reference Collaborator Problem Advisor © Coach Reviewer Colleague generator guide solver Role",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2d16421f-ed39-4508-904e-4e8d650dd482",
        "metadata": {},
        "text": "Rating J Not ata [I Aiitie somewhat |) A great deal",
        "type": "Title"
    },
    {
        "element_id": "6fa9e3fc-f462-42e0-8ced-7d174f2e9f83",
        "metadata": {},
        "text": "Figure 3: Role orientations. Participants overwhelmingly felt that the assistant’s role was of a tool orientation rather than a social orientation. The chart shows ratings distributions across 9 different roles the assistant might take, sorted by the percentage of participants who rated the extent of that role as “A great deal.” The leftmost role is of a tool, with 80.9% of participants rating it as “a great deal.” Following tool are content generator (69.0%), reference guide (64.3%), collaborator (40.5%), problem solver (35.7%), advisor (21.4%), coach (19.0%), reviewer (16.7%), and colleague (14.3%).",
        "type": "NarrativeText"
    },
    {
        "element_id": "4c66a79b-886c-41ae-ad70-49eaaed26198",
        "metadata": {},
        "text": "We show participants’ ratings of the assistant’s role in Figure 3. Despite the fact that their attitudes toward the assistant overwhelm- ingly reflected a tool orientation, their behaviors reveal that many participants actually treated the assistant as a social agent. P6 de- scribed how ‘I felt it like a partner,” and P4 told the assistant, “T could not have solved [the challenge] without your help,” to which the assistant responded, “I’m glad I could help.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "8dca09a0-5a29-450d-8692-7551f41b104b",
        "metadata": {},
        "text": "The literature on Computers as Social Agents (CASA) helps us interpret this result as it demonstrates how computers are often treated like people [56, 67]. LLM-based conversational agents can exacerbate this tendency; as they likely have been trained on ex- amples of social interaction, they can also respond as social agents.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d8a683e1-5f92-4a63-a16a-868c33c6dba6",
        "metadata": {},
        "text": "In the conversation logs, we identified participants who inter- acted with the assistant in a socially-oriented fashion (the social",
        "type": "NarrativeText"
    },
    {
        "element_id": "8c901869-0e16-4aa0-94bc-d0c0ec533ea1",
        "metadata": {},
        "text": "504",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d30d6605-fd9d-423d-9e54-bd76314670dc",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "d9188765-9749-4f89-b848-4fb94519ce23",
        "metadata": {},
        "text": "orientation codes in Table 1). Twenty participants (47.6%) made at least one socially-oriented utterance. An extreme form of this inter- action style can be seen in a snippet from P6’s transcript (Listing 3).",
        "type": "NarrativeText"
    },
    {
        "element_id": "cc1e928b-1537-49e3-b8c5-eaea07e74a31",
        "metadata": {},
        "text": "The 20 participants with a behaviorally-demonstrated social orientation did not generally differ in their role ratings from other participants, except that they rated the assistant as more likely to be an advisor (Fisher’s exact test, two-tailed p = .02) or a reviewer (Fisher’s exact test, two-tailed p = .03). However, they did not differ in their overwhelmingly-strong ratings of the tool orientations. Thus, at least for some participants, there seems to be a dissonance in their view of the assistant’s role orientation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "42c1a447-a50a-4efc-89d2-5be541a40965",
        "metadata": {},
        "text": "Listing 3: Excerpt from P6’s interaction with the Program- mer’s Assistant, in which P6 offers their thanks and congrat- ulations.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6a62f71d-8777-4165-b240-19500007e1b9",
        "metadata": {},
        "text": "1 | P6: thank you! it's been really nice to code 2 with you! or to have you coding! LOL",
        "type": "NarrativeText"
    },
    {
        "element_id": "038b1263-b15e-47aa-a08d-a8d6b25ff790",
        "metadata": {},
        "text": "3 Socrates: You're welcome!",
        "type": "Title"
    },
    {
        "element_id": "12b36a45-0221-46f4-926e-ee0d8e4ca09c",
        "metadata": {},
        "text": "4 |P6: I hope to see you on air soon, Socrates! 5 | Socrates: I hope so too.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4a46b5c0-e171-4fa2-b99e-1c8d98fcac4b",
        "metadata": {},
        "text": "6 | 6: congrats to you research team! you've made 7 a good job!",
        "type": "NarrativeText"
    },
    {
        "element_id": "6f58efa9-973d-48d7-b539-11985a472baa",
        "metadata": {},
        "text": "8 | Socrates: I'm glad you think so.",
        "type": "NarrativeText"
    },
    {
        "element_id": "475ac205-53ab-4b87-8829-aced0b46a101",
        "metadata": {},
        "text": "9 | P6: sorry... they've made a good job (well... 10 you too... ;-) )",
        "type": "NarrativeText"
    },
    {
        "element_id": "15d1458b-bb61-46c1-b3e2-26ddf5d71d38",
        "metadata": {},
        "text": "11 | Socrates: Thank you.",
        "type": "Title"
    },
    {
        "element_id": "9d251c77-7e33-4808-9f86-f6b988aacea8",
        "metadata": {},
        "text": "12 | P6: see you next time! bye!!",
        "type": "Title"
    },
    {
        "element_id": "7d34a85a-319a-406a-9b18-cbea2b93dc51",
        "metadata": {},
        "text": "13 | Socrates: Goodbye.",
        "type": "Title"
    },
    {
        "element_id": "e04e34aa-fa80-4e5a-b82d-26d13929eb13",
        "metadata": {},
        "text": "5.4.2 Mental Capacities. Participants made a number of inferences about the Programmer’s Assistant and its capacities for thought. Many participants talked about how the assistant possessed a level of “understanding” (P6, P8, P11, P18, P32) of “the context” (P9, P21) as well as “major concepts” (P9) and “knowledge” (P33). P24 was amazed by the assistant’s ability to “take a plain english request and interpret it properly.” P7 ascribed intelligence to the assistant, saying, “It was a lot smarter and trained tha[n] I thought it was.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "142c2a13-41d5-47ce-a1fe-fbb5c56fd235",
        "metadata": {},
        "text": "One participant assumed that the assistant “Keeps improving through (user) feedback” (P31). Another felt that the assistant was capable of computation: “It understands the problem... It can calculate the results of a function back” (P8).",
        "type": "NarrativeText"
    },
    {
        "element_id": "97c817bb-e9b4-4d7f-8127-759d7f3647bd",
        "metadata": {},
        "text": "However, not all participants were convinced of the assistant’s ability to understand. P37 questioned the assistant’s limitations: “T wonder how far beyond boilerplate it can go and if it works for truly original problems.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "cfb21f69-5618-42e2-81e9-07b99ee4fcc9",
        "metadata": {},
        "text": "5.4.3 Impact of Conversational Assistance on Work Practices. Many participants discussed how the Programmer’s Assistant shaped their work practices on the programming challenges. Overall, par- ticipants felt that the assistant “saves time” (P10), “helps me code faster” (P34), and would “speed up my productivity” (P19) because “T could focus on validating and improving the code it generated instead of having to write it all from scratch” (P18). P37 remarked that, “It opens a whole new door for fast develpment.” P4 discussed how the assistant “was helpful in staying focused on the code,” although for P14, “it took [me] time to get into tempo with the tool.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "3cc1f58f-fe4c-40fe-a66b-fe5fafc0ba52",
        "metadata": {},
        "text": "P31 pointed out how the assistant would change the nature of their work:",
        "type": "NarrativeText"
    },
    {
        "element_id": "90d3c547-b923-4121-bd00-4b481825128a",
        "metadata": {},
        "text": "“My job could focus more on higher level aspects and therefore achieving better (quality) results, besides the",
        "type": "NarrativeText"
    },
    {
        "element_id": "05416e68-d1ac-4f51-8df1-29f7a467732c",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "ea826511-545f-4558-b07d-01073f33c11d",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "5d468d46-2d93-438e-be53-3442e116cc5b",
        "metadata": {},
        "text": "time-to-value... Data science (and dev) becomes a more creative-higher level experience.” (P31)",
        "type": "NarrativeText"
    },
    {
        "element_id": "58cdb05e-5940-45e8-8b86-d46ea68c57ae",
        "metadata": {},
        "text": "Other participants discussed a work process in which the assis- tant provided incomplete solutions — the “building blocks” (P38) or “initial draft of code” (P11) — upon which they could build. P5 aptly described this process:",
        "type": "NarrativeText"
    },
    {
        "element_id": "e07790be-2f59-40c6-ad18-8a7472de38f6",
        "metadata": {},
        "text": "“It’s nice to copy well formulated challenges in natural language and have the code generator take its best stab at it, then edit to our hearts content.” (P5)",
        "type": "NarrativeText"
    },
    {
        "element_id": "0c360139-3d8f-41ca-8ea8-ded52087814d",
        "metadata": {},
        "text": "Participants felt that human review of the assistant’s responses was necessary because “The answers provided are generally not novel solutions, often look clunky and non-elegant. There may be some unnecessary code. Basically the code would need to be reviewed” (P16). P35 also pointed out how “The code generator was good but you still have to really check it.” P19 discussed how they would turn to the assistant as a first source for support, and only if it wasn’t able to help would they then turn to other support tools:",
        "type": "NarrativeText"
    },
    {
        "element_id": "d7440e88-61bc-460a-906d-a3e519ed2f90",
        "metadata": {},
        "text": "“The way I will use it is, I will first us[e] the Program- mer’s assistant for most of my cases. Only in certain cases where Programmer’s assistant cant answer things Iwill turn up to official documentation or stack overflow.” (P19)",
        "type": "NarrativeText"
    },
    {
        "element_id": "5bb2b575-d279-453f-834f-9b8a822d9f23",
        "metadata": {},
        "text": "However, latency was a factor for interactive use of the assistant and participants noticed when the assistant took a long time to respond. P19 remarked, “Sometimes it took lot of time, like more than 5 seconds.” P40 also felt “the response [was] a little slow sometimes... in chat mode I expect faster responses.” As discussed in Section 5.2.1, the assistant took an average of 6.7 seconds (SD = 3.1 seconds) to respond to a request, and participants did appreciate when the assistant produced rapid responses: “I loved how quick it was able to pull up answers to questions I had” (P38).",
        "type": "NarrativeText"
    },
    {
        "element_id": "8996a718-c4e5-430a-83f6-06dd7db8c0ff",
        "metadata": {},
        "text": "5.4.4 Conversational Interaction vs. Other Interaction Models. Al- though our study was not intended to make comparative evalu- ations with the Copilot tool, we nonetheless asked participants whether they were familiar with Copilot, and if so, to comment on how the two tools compared. We also asked a similar question to compare the assistant with another popular form of programming assistance, searching the web (via a search engine like Google, or a Q&A site like Stack Overflow). In discussing the differences be- tween these three tools, we note that the primary differentiator is their interaction model.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e82b9813-7576-4422-8519-8fa88a3f9f1b",
        "metadata": {},
        "text": "The interaction model for the Programmer’s Assistant is clearly conversational: users ask questions in natural language and are provided with a response in natural language and/or code. The interaction model of Copilot is reminiscent of direct manipulation interfaces [37], in which the user’s actions in the user interface directly manipulate an object on the screen. Copilot automatically makes autocompletion suggestions as the user types. This auto- completed code is directly placed in the source editor; thus, the user’s work is contained entirely within the scope of the object on which they are working (i.e. the source code), which is how direct manipulation interfaces operate. In web search, users enter a separate search context (e.g. a search engine accessed within a web browser), type in a natural language query, and then forage amongst search results to identify relevant items of interest [12, 62].",
        "type": "NarrativeText"
    },
    {
        "element_id": "a9e3e45a-3e14-456f-91df-94a623a343f3",
        "metadata": {},
        "text": "505",
        "type": "UncategorizedText"
    },
    {
        "element_id": "70ddb402-f510-4c83-995f-c3c82120ab5e",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "297f182e-3700-45fd-9739-0091e0873020",
        "metadata": {},
        "text": "When a desirable item is found, users must translate it into their code environment (e.g. via copy/paste) and possibly edit it to fit their existing code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5629f78c-af92-474a-b0ab-64f308cc459d",
        "metadata": {},
        "text": "We also note that the Programmer’s Assistant and Copilot both utilize the same underlying AI model, Codex [24], which means that the only difference between these tools is the user experience. The extent to which Codex was trained on data from programming- related Q&A web sites is less clear, but for the purposes of our analysis, we focus our discussion solely on the differences in their interaction models!°.",
        "type": "NarrativeText"
    },
    {
        "element_id": "88afbd4f-f135-4064-b621-333e50b6b404",
        "metadata": {},
        "text": "Participants reported various benefits and drawbacks of a con- versational interaction over a direct manipulation interaction. Fore- most, conversation “felt very natural” (P21) and “feels much more natural using Natural Language with the AI” (P39). In addition, P39 felt that “the use cases of Programmers’ Assistant seem more open- ended.” Many participants were surprised at the variety of tasks the assistant was capable of performing, from writing unit tests (P19, P36, P37) and documentation (P12, P19, P36, P37) to explaining what code did (P31, P38) and even answering general-knowledge questions (P31). Again, we note that the Programmer’s Assistant utilizes the same underlying model as Copilot, yet the conversa- tional interface was able to expose a wider variety of emergent behaviors from the model. Multiple participants explored the limits of the assistant’s knowledge and abilities beyond our programming challenges. For example, P37 asked it questions about physics and ordinary differential equations (“ODe” as written by P37), and was surprised by the “versatility of what it could answer.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "2fe90be8-b7cf-4a0f-8e4f-254e25bb3dcb",
        "metadata": {},
        "text": "“I asked it some physics and ODe question and the answers, though not complete, included the key parts needed to write that code.” (P37)",
        "type": "NarrativeText"
    },
    {
        "element_id": "f2744fba-3f12-477d-a5b4-a195431659b5",
        "metadata": {},
        "text": "P31 probed the assistant on its knowledge of geography and was surprised when the assistant produced a correct answer.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2e992a84-1c17-4c0d-bc0a-1a5487e04bb6",
        "metadata": {},
        "text": "“T asked something out of SW engineering domain (ge- ography) and it replied correctly, also by correctly an- swering on my nationality.” (P31)",
        "type": "NarrativeText"
    },
    {
        "element_id": "43590db6-8787-4f54-929c-c2ffde911ab6",
        "metadata": {},
        "text": "For some participants, the ability to assess the assistant’s re- sponse before committing to it (i.e. by inserting assistant-generated code into their editor) was a boon. P15 described how the copy/- paste boundary provided them with “a bit more control to ask specific questions about what I wanted and to assess before putting it in my code.” Other participants felt that the copy/paste boundary was more inefficient:",
        "type": "NarrativeText"
    },
    {
        "element_id": "d89b1c27-6088-4a68-ba8e-2eb96df24145",
        "metadata": {},
        "text": "“I think the main difference is the ability of Copilot to suggest code while you type, what make it faster and easier to use. While using the Programmer’s Assistant, you need to go to the chat, ask the question, copy the",
        "type": "NarrativeText"
    },
    {
        "element_id": "232b95da-ca89-460b-be6a-ead16a02f1aa",
        "metadata": {},
        "text": "16As an aside, our comparison of direct manipulation, search, and conversational inter- action models is reminiscent of historical comparisons of text-based and graphical user interfaces [54, 63]. Each modality was shown to have advantages and disadvantages. For example, text-only interfaces can provide accessibility [54, 78] and productivity [53] advantages, whereas graphical user interfaces provide greater discoverability [10, 88]. Some researchers explored ways to bridge the two interaction modes, such as by developing GUI wrappers for command line programs [53, 94] or by developing tools that converted GUI activities into procedural descriptions [55]. Our view is that similar bridges can be constructed between direct manipulation, search, and conversational models of interaction; a user’s interaction with an LLM need not be constrained to a single interaction model.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5353bb0e-310d-48f6-bfde-eef55c946e6b",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "4dd0add4-a8c6-4d45-9310-4dd6ce17b77f",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "1e4d304d-9555-4be8-a304-eda1e6846c10",
        "metadata": {},
        "text": "code (or rephrase the question if it was not understood by the agent), and edit it to match your code.” (P3)",
        "type": "NarrativeText"
    },
    {
        "element_id": "7ddf00d4-a247-4ede-bb0f-c2a19979de0a",
        "metadata": {},
        "text": "A large number of participants felt that the conversational inter- action was faster than web search (P1, P6, P7, P10, P11, P12, P16, P17, P18, P20, P24, P29, P30, P33, P36, P37, P42) because of its ability to provide “real-time responses” (P32) that can be “applied exactly to your code” (P33) without having to “parse through lots of text... to get what you need” (P15). In addition, the assistant provided “MUCH faster, better responses” (P17) that were “much more relevant to the problems” (P34) and “simple [and] succinct” (P9), without having to “sort through answers on your own or read documentation” (P9) or “look at many posts before finding the relevant one” (P18).",
        "type": "NarrativeText"
    },
    {
        "element_id": "c1cf23c9-b01a-4196-94dc-8b75dca72067",
        "metadata": {},
        "text": "Despite these benefits, some participants felt that the assistant might not work well for “more specific and difficult problems on a bigger scale” as compared to web search. P9 felt that “the data [of the Programmer’s Assistant] wasn’t as rich” as the web. Other participants felt that the assistant lacked the “multiple answers” (P9) and “rich social commentary” (P19) that accompanies answers on Q&A sites:",
        "type": "NarrativeText"
    },
    {
        "element_id": "739d69a4-d7f0-4491-a482-836c040de706",
        "metadata": {},
        "text": "“I like to see the different versions proposed on stack overflow and the commentary of what makes one solu- tion better than another in a given situation.” (P27)",
        "type": "NarrativeText"
    },
    {
        "element_id": "66642014-eaa5-4ac4-a8f4-713682080253",
        "metadata": {},
        "text": "Some participants promoted a more balanced view that there isn’t a single mode of interaction superior to all others. P19 felt that web search would be a fallback when the assistant failed to answer a question. P39 described how search could be integrated with the conversational interaction:",
        "type": "NarrativeText"
    },
    {
        "element_id": "a5cbb8ad-7ced-4a64-9989-691aaab553a1",
        "metadata": {},
        "text": "“I think both options should exist: people should be able to input their queries like a search bar AND also give their question as if in conversation.” (P39)",
        "type": "NarrativeText"
    },
    {
        "element_id": "4c82af53-a246-4766-935a-775111c62711",
        "metadata": {},
        "text": "6 DISCUSSION",
        "type": "Title"
    },
    {
        "element_id": "7e84a062-9453-446d-8438-23dc930c6fac",
        "metadata": {},
        "text": "6.1 Value of Conversational Interaction",
        "type": "Title"
    },
    {
        "element_id": "f3ede376-fcc6-48e3-a1f4-3266402ddce9",
        "metadata": {},
        "text": "We began our research by asking the question of whether con- temporary developments in code-fluent LLMs could sufficiently support a conversational programming assistant. We believe that our work has demonstrated that they can. Clearly, the Program- mer’s Assistant was viewed by our participants as a useful tool that provided real value - so much so that many participants explic- itly requested or expressed the desire to use it in their own work. However, how much of this value was derived from the model itself and its ability to produce high-quality responses to programming questions, versus from participants’ ability to conduct extended conversational interactions grounded in their actual source code?",
        "type": "NarrativeText"
    },
    {
        "element_id": "9b5a7dd0-74b7-48a8-b959-c0362b4a3040",
        "metadata": {},
        "text": "We believe that both of these constituent aspects were valuable. Indeed, many participants commented on their surprise and satis- faction with the quality of the assistant’s responses (Section 5.2.3). However, participants also valued the conversational interactions",
        "type": "NarrativeText"
    },
    {
        "element_id": "65bb9e92-45dd-4820-9d43-20dc9c88ca14",
        "metadata": {},
        "text": "that they had with the assistant. In the event logs, we saw evi- dence that participants were leveraging conversational context to ask follow-up questions as well as leveraging code context by ask- ing about their code selections (Section 5.3.2). Many participants reported that they would find the tool less valuable if the conver- sational interaction were removed (Section 5.3.2). Further, conver- sation seemed to provide unique value beyond other interaction",
        "type": "NarrativeText"
    },
    {
        "element_id": "c2ab10c6-8855-4e5a-8e32-6d1e91dc5335",
        "metadata": {},
        "text": "506",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3e766c94-1f5e-4710-a7c6-ce7cc07cbb44",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "395abf8f-ae35-4786-91a4-55a60e14be7c",
        "metadata": {},
        "text": "models (direct manipulation and search) because of its embedded- ness in the UI and its ability to surface emergent behaviors of the model (Section 5.4.4).",
        "type": "NarrativeText"
    },
    {
        "element_id": "0e6d5303-efd4-4057-9085-cecbe913a5ff",
        "metadata": {},
        "text": "We do not believe that these different interaction models are in competition and we agree with P39’s assessment that assistive tools can be built using a plethora of different interaction models. For use cases in which a model is known to produce high-quality results (e.g. code autocompletion for Codex), a direct manipulation interface seems wholly appropriate as it would provide a discov- erable and predictable way of invoking the model to produce a known type of result. However, direct manipulation interfaces may be less ideal for surfacing the emergent behaviors of a foundation model [14], and thus natural language interaction may be more suit- able. Many popular text-to-image models, such as DALL-E 2 [66] and Stable Diffusion [72], operate in a one-shot fashion, in which the user specifies a prompt, clicks a button, and gets results. Our study demonstrates how the additional contextual layers of con- versational history and the artifact-under-development provide",
        "type": "NarrativeText"
    },
    {
        "element_id": "451d1d55-a8be-4ac5-88ee-3f3c8a415bd9",
        "metadata": {},
        "text": "additional value to the co-creative process.",
        "type": "Title"
    },
    {
        "element_id": "2aa4c5c9-6f15-4e24-a245-e47c4b63c903",
        "metadata": {},
        "text": "6.2 Toward Human-AlI Synergy",
        "type": "Title"
    },
    {
        "element_id": "467c5355-f7d4-46d7-9d5b-adf5540011c8",
        "metadata": {},
        "text": "The aim of human-centered AI is to “enable[] people to see, think, create, and act in extraordinary ways, by combining potent user experiences with embedded AI methods to support services that users want” [82]. Building upon this definition, Rezwana and Maher [69] posit that, “In a creative collaboration, interaction dynamics, such as turn-taking, contribution type, and communication, are the",
        "type": "NarrativeText"
    },
    {
        "element_id": "85bb8fbf-7ec2-4a08-8138-e63c7db4ea76",
        "metadata": {},
        "text": "driving forces of the co-creative process. Therefore the interaction model is a critical and essential component for effective co-creative systems.” [69]. They go on to note that, “There is relatively little research about interaction design in the co-creativity field, which is reflected in a lack of focus on interaction design in many existing co-creative systems.”",
        "type": "NarrativeText"
    },
    {
        "element_id": "35638ee3-038a-4298-8898-f79b8b486106",
        "metadata": {},
        "text": "Our study begins to address this gap. While many co-creative systems examine casual tasks or experimental activities (e.g., Spoto and Oleynik [87]), our focus was on the co-creative practice of programming. Our goal was to understand peoples’ attitudes to- ward a conversational programming assistant, akin to Wang et al.’s examination of data scientists’ attitudes toward automated data science technologies [99]. We found that, despite an initial level of skepticism, participants felt that a conversational assistant would provide value by improving their productivity (Section 5.4.3). How- ever, further work is needed to assess the extent to which this type of assistance provides measurable productivity increases.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cf8142b9-00f6-47a7-8129-0705c197f0db",
        "metadata": {},
        "text": "Campero et al. [19] conducted a survey of papers published in 2021 that examined human-Al synergy, the notion that a human-AI team can accomplish more by working together than either party could accomplish working alone. They found mixed results, with no clear consensus emerging on how to design human-centered AI systems that can guarantee positive synergy. Summarizing from their discussion,",
        "type": "NarrativeText"
    },
    {
        "element_id": "c03f9653-bb15-421b-8fe7-a5a721fb094e",
        "metadata": {},
        "text": "“Perhaps achieving substantial synergies among people and computers is harder than many people think. Per- haps it requires... new ways of configuring groups that include people and computers. And perhaps it needs",
        "type": "NarrativeText"
    },
    {
        "element_id": "65460949-a981-450e-88ac-f48b2a95eb80",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "6c8184d8-126b-412d-b095-99284b8585dd",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "21443ce2-aa15-4da4-b840-90b60c1d869f",
        "metadata": {},
        "text": "more systematic, focused attention from researchers than it has, so far, received.” [19, p.9]",
        "type": "NarrativeText"
    },
    {
        "element_id": "44f89f8f-6ccc-46b9-9efe-425b748052f9",
        "metadata": {},
        "text": "We believe such evaluations of human-AI synergy should go beyond one-shot performance measures. As implied by many of the uses cases listed by Seeber et al. [80], human-centered AI systems are often deployed in socio-organizational contexts that require longitudinal use [20, 41, 43], such as product design [93], game de- sign [4], and engineering [20, Section 3.2.2]. Thus, we would expect that over time and through interaction with each other, human-AI teams would improve their performance through a mutual learning process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "35ddf42f-f996-48f1-83b5-8464ea7c66ee",
        "metadata": {},
        "text": "Evidence for this process surfaced in our study when participants described how they could improve their programming skills by interacting with the assistant (Section 5.3.3). We assert that the learning should operate in both directions: not only should people improve their programming skills, but the model itself can also improve based on peoples’ interactions with it. For example, when the assistant provides a code example to the user, and the user takes that example and edits it, those edits constitute feedback that can be used to further fine-tune the model. In addition, through longitudinal use, we believe that human and AI partners can create reciprocal representations of one another — ie., the human is likely to create a mental model of the AI, and the AI may be engineered to develop a user model for each of its human users [30, 48, 79]. Such a pair of models is often described as Mutual Theory of Mind [29, 100]. This type of capability raises the possibility of personalizing and adapting an assistant to the strengths and needs of individual users.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3eddc1b0-d0cf-4c9d-aec0-d0b772fbba5c",
        "metadata": {},
        "text": "With such models, an assistant that knows a user is learning a programming language could provide natural language explana- tions alongside code outputs, whereas an assistant that knows a user is strongly skilled in a programming language might shorten or omit those explanations. Similarly, users are likely to update their mental models of the AI with more experience. We believe the space for exploring how these reciprocal models impact human-AI synergy is rich, and we encourage additional work in this area.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ef672ecc-aa39-4fda-aea8-1e6287d6f77e",
        "metadata": {},
        "text": "Human-centered AI systems that are designed to combine and synergize the distinct skills of humans and AI models cannot suc- ceed if they diminish the human skills upon which they depend. Well-designed human-centered AI systems develop new and com- plementary skills for both the human and AI constituents [82, 83], and we believe that mutual learning may address concerns that the wide deployment and use of AI systems will result in a de-skilling of the workforce [77, 108].",
        "type": "NarrativeText"
    },
    {
        "element_id": "0e595d71-b2ee-4889-a15a-445344ab2bb8",
        "metadata": {},
        "text": "Ultimately, the design decisions that go into an interactive AI system have ethical implications. Our design attempts to augment the user’s knowledge and skills by presenting help on demand, couched in non-authoritative suggestions, which leaves the user firmly in control and ultimately responsible for the work product.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a3fceedc-999f-4419-a184-719ea1c0e92a",
        "metadata": {},
        "text": "6.3. Opportunities for Future Research",
        "type": "Title"
    },
    {
        "element_id": "f3c4aee1-46b6-4705-b56b-77f5dfdac2f8",
        "metadata": {},
        "text": "Our work highlights many interesting avenues for future enhance- ments that could be made to LLM-based conversational assistants such as our Programmer’s Assistant, as well as future human- centered research on LLM-based conversational assistance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7536eebc-924a-4844-a2aa-627d611561b1",
        "metadata": {},
        "text": "Our work employed a code-fluent model that was not specifi- cally designed to handle conversational interaction. Fine-tuning",
        "type": "NarrativeText"
    },
    {
        "element_id": "06fd05c1-cc16-444d-85a6-76dcf36f2965",
        "metadata": {},
        "text": "507",
        "type": "UncategorizedText"
    },
    {
        "element_id": "754c8890-1293-404d-95e3-b7ab291d041a",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "2e70c6bc-6d26-4d38-9b78-cf3c2c6295b3",
        "metadata": {},
        "text": "the underlying LLM for conversational interaction, such as what has been done with Lamda [91], is one opportunity to improve the assistant’s performance. Another opportunity is to align the lan- guage model to follow the desiderata proposed by Askell et al. [11] and described by Ouyang et al. as, “helpful (they should help the user solve their task), honest (they shouldn’t fabricate information or mislead the user), and harmless (they should not cause physical, psychological, or social harm to people or the environment)” [61, p.2]. Glaese et al. [33] propose a slightly different desiderata of “correct” instead of “honest,” which may be more applicable to the software engineering domain, as the ability to produce correct code and correct answers about code are both important properties of a conversational programming assistant.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d9acf88-2cf9-40f4-83e9-2574e2a9a2de",
        "metadata": {},
        "text": "Combining LLMs with search-based approaches to establish ad- ditional context for the model, such as AlphaCode [44] has done, may also result in more capable systems. These “searches” need not be limited to textual sources, but could be conducted over appro- priate semantic stores (e.g. a knowledge graph) and take advantage of explicit semantic reasoning services, resulting in an integration of symbolic and neural approaches. Further, allowing for “internal deliberation” of the type shown in Nye et al. [59] could result in better-reasoned results, as well as better explanations and justifica- tions.",
        "type": "NarrativeText"
    },
    {
        "element_id": "52b5404c-980c-4b12-995a-0f41f55cbdb4",
        "metadata": {},
        "text": "Another avenue for improvement involves the prompt used to configure the assistant (Appendix D). Just as the prompt for each successive interaction is modified by the growth of the conversa- tional transcript, there is no requirement that the initial prompt be static. It too can be specialized to incorporate aspects of a user model, enabling the realization of a Mutual Theory of Mind [29, 100]. Pro- viding better UX affordances for visualizing and manipulating the active contexts — code and conversation — could provide users with more control over which information contributes to the generation of the assistant’s response.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4d6bc1e8-096c-4b68-aa2d-0bec08ba72b9",
        "metadata": {},
        "text": "Our participants clearly indicated that they were interested in having an assistant that behaved more proactively, in contrast to our deliberate design of an assistant that never takes conversational initiative. A more proactive assistant would be able to interrupt or remind a user when necessary [23], yet this characteristic raises many challenging issues. How can we calibrate the threshold for such interruptions? How can users tune the assistant to deliver only those interruptions that the they would find useful (e.g., [28, 81])? How can we help users to regain their prior context after dealing with an interruption (e.g. [89])? Should an assistant be used to persuade or nudge the user (e.g. [35])? Who should determine the topic, frequency, and insistence of such persuasion attempts (e.g. [52, 85])? Should users have the ability to moderate or defeat attempted persuasions, or should those decisions be left to the organization?",
        "type": "NarrativeText"
    },
    {
        "element_id": "d4c534f8-04a0-43bd-a04e-e554b8cf0672",
        "metadata": {},
        "text": "Finally, we explored the different kinds of role orientations our participants had toward the assistant and found that participants varied in their views of it as a tool versus a social agent (e.g. collabo- rator or colleague). We posit that peoples’ effectiveness in working with an AI system may be influenced by their role orientation, and we encourage future research in this area.",
        "type": "NarrativeText"
    },
    {
        "element_id": "12725b7c-f3ca-4732-ad8b-e5e7926ec7d4",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "214f0fc1-7e70-4840-b42a-cf2d29f3e615",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "f7430d1f-45f9-48fb-8627-164dcc678689",
        "metadata": {},
        "text": "7 CONCLUSION",
        "type": "Title"
    },
    {
        "element_id": "2f77cee1-d0f7-4eab-aecc-675fed784f83",
        "metadata": {},
        "text": "We developed a prototype system, the Programmer’s Assistant, in order to assess the utility of a conversational assistant in a software engineering context. The assistant was implemented using a state- of-the-art code-fluent large language model, Codex [24], and was capable of generating both code and natural language responses to user inquiries. We further used the prompting mechanism of the model to set up a conversational interaction in which the model uses the conversational history, plus the user’s current utterance, in order to generate a response. In this way, users are able to ask fol res}",
        "type": "NarrativeText"
    },
    {
        "element_id": "c0c862f3-4a8e-4bae-8dd1-9c52a841c53f",
        "metadata": {},
        "text": "low-up questions in the chat that reference prior utterances and onses. We incorporated the conversational assistant into a code editing environment, enabling the conversation to be grounded in the context of the user’s source code. We evaluated this system with 42 participants with varied levels of programming skill, and their quantitative and qualitative feed- back, coupled with their usage of the system, demonstrated the varied, and sometimes emergent, types of assistance it was able to provide. Many participants noted the high quality of the conversa- tional responses, including the assistant’s ability to produce code, explain code, answer general programming questions, and even answer general knowledge questions. Participants felt this type of assistance would aid their productivity, and they drew meaningful contrasts between the conversational style of interaction with other",
        "type": "NarrativeText"
    },
    {
        "element_id": "4fc7cb8f-fd06-4105-b2d8-0b6daa0405dd",
        "metadata": {},
        "text": "tools that employ a direct manipulation or search-based interaction model.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0742b787-3ffa-47be-af14-cb19040d45f1",
        "metadata": {},
        "text": "Our study motivates the use of conversational styles of inter- action with large language models by showing how they enable emergent behaviors in a co-creative context. The Programmer’s Assistant did not always generate perfect code or correct answers; nonetheless, participants in our study had an overall positive ex- perience working with it on a variety of programming challenges. We believe that our work takes us one step closer to realizing the vision of human-centered AI: learning how to design systems that maximize the synergy in human-AI collaborations.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6b497c71-8135-4057-910c-7d7238429ec4",
        "metadata": {},
        "text": "ACKNOWLEDGMENTS",
        "type": "Title"
    },
    {
        "element_id": "9488bb82-4ad0-41f4-842f-0f5907219ca1",
        "metadata": {},
        "text": "We would like to thank Socrates for his tireless assistance during the user study, as well as for suggesting the title of this paper based on its abstract.",
        "type": "NarrativeText"
    },
    {
        "element_id": "32cd6f16-7903-4c45-87ba-d43ae9d52f4d",
        "metadata": {},
        "text": "REFERENCES",
        "type": "Title"
    },
    {
        "element_id": "6273cca3-e397-4131-b1ad-52aa16243e7d",
        "metadata": {},
        "text": "1] Rabe Abdalkareem, Emad Shihab, and Juergen Rilling. 2017. What Do Developers Use the Crowd For? A Study Using Stack Overflow. IEEE Software 34, 2 (2017), 53-60. https://doi.org/10.1109/MS.2017.31",
        "type": "NarrativeText"
    },
    {
        "element_id": "97ded0f1-945b-4280-a50a-08eb2d5bab12",
        "metadata": {},
        "text": "2] Eleni Adamopoulou and Lefteris Moussiades. 2020. Chatbots: History, technol- ogy, and applications. Machine Learning with Applications 2 (2020), 100006.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9c47ff3c-02cf-4dd7-a131-0b6bfb9c2866",
        "metadata": {},
        "text": "3] Daniel Adiwardana, Minh-Thang Luong, David R. So, Jamie Hall, Noah Fiedel, Romal Thoppilan, Zi Yang, Apoorv Kulshreshtha, Gaurav Nemade, Yifeng Lu, and Quoc V. Le. 2020. Towards a Human-like Open-Domain Chatbot.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6709b5b1-aea4-4685-88a9-236090de6275",
        "metadata": {},
        "text": "4] Safinah Ali, Nisha Elizabeth Devasia, and Cynthia Breazeal. 2022. Escape! Bot: Social Robots as Creative Problem-Solving Partners. In Creativity and Cognition. 275-283.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e74d167d-e037-47ac-b48c-9bf08ac338b1",
        "metadata": {},
        "text": "5] Miltiadis Allamanis, Earl T Barr, Premkumar Devanbu, and Charles Sutton. 2018. A survey of machine learning for big code and naturalness. ACM Computing Surveys (CSUR) 51, 4 (2018), 1-37.",
        "type": "NarrativeText"
    },
    {
        "element_id": "997e3d8f-fe0b-4669-bbba-e44781c2ccbc",
        "metadata": {},
        "text": "6] Irene Alvarado, Idan Gazit, and Amelia Wattenberger. 2022. GitHub Next | GitHub Copilot Labs. https://githubnext.com/projects/copilot-labs/",
        "type": "NarrativeText"
    },
    {
        "element_id": "d6271dc8-dca6-47b0-a377-b62e157abc08",
        "metadata": {},
        "text": "7| Hikari Ando, Rosanna Cousins, and Carolyn Young. 2014. Achieving saturation in thematic analysis: Development and refinement of a codebook. Comprehensive Psychology 3 (2014), 03-CP.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ae45f4c0-dcac-47a9-9d4a-8cbf896b394f",
        "metadata": {},
        "text": "508",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0fde1ee5-921a-4c96-92f5-177f2e120ba5",
        "metadata": {},
        "text": "cS",
        "type": "Title"
    },
    {
        "element_id": "f57fb7f1-df97-4374-b971-993a65a6f180",
        "metadata": {},
        "text": "10",
        "type": "UncategorizedText"
    },
    {
        "element_id": "44e6b6e1-c4fb-459b-9ede-7306041e571f",
        "metadata": {},
        "text": "1",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ac65c634-6ccb-4ad7-bf8e-2879ecc426ff",
        "metadata": {},
        "text": "12",
        "type": "UncategorizedText"
    },
    {
        "element_id": "66775972-bd6a-46fa-8b2d-f0ab76faa17a",
        "metadata": {},
        "text": "13",
        "type": "UncategorizedText"
    },
    {
        "element_id": "865ae96c-81ef-4216-a3cd-fbf1d1fa5378",
        "metadata": {},
        "text": "14",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0f0bc676-9cf9-4fb0-896d-f9ae961a70c3",
        "metadata": {},
        "text": "15",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fcfa25b6-5423-4fcf-a7a8-00445619000d",
        "metadata": {},
        "text": "16",
        "type": "UncategorizedText"
    },
    {
        "element_id": "448f363a-02c1-4830-948e-9dc9d5c79925",
        "metadata": {},
        "text": "17",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0f7ba738-eafc-40e9-973d-b7cea4ce0de3",
        "metadata": {},
        "text": "18",
        "type": "UncategorizedText"
    },
    {
        "element_id": "563736b7-7c9e-4e74-8ca3-aae359d21e74",
        "metadata": {},
        "text": "19",
        "type": "UncategorizedText"
    },
    {
        "element_id": "eece78b7-17f7-45b1-b345-79248c129475",
        "metadata": {},
        "text": "20.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5d1ff50b-f43b-4030-a7ec-8ff3b102e3d4",
        "metadata": {},
        "text": "21",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3fb4be1e-d7e6-463f-833d-ba7a414928b0",
        "metadata": {},
        "text": "22.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "455a3e8f-d276-442a-90d1-a05ee13a05be",
        "metadata": {},
        "text": "23,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fd007726-b3b4-460c-82b8-ab7783e32156",
        "metadata": {},
        "text": "24",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f5db99b0-950c-42c8-8123-dc3048def499",
        "metadata": {},
        "text": "(25]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3a9fd81a-ab23-46ac-9918-1505b09c4d81",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "db1be597-2b36-4065-beb8-c741894bc6bf",
        "metadata": {},
        "text": "Craig Anslow, Stuart Marshall, James Noble, and Robert Biddle. 2013. Sourcevis: Collaborative software visualization for co-located environments. In 2013 First IEEE Working Conference on Software Visualization (VISSOFT). IEEE, 1-10. Zahra Ashktorab, Michael Desmond, Josh Andres, Michael Muller, Naren- dra Nath Joshi, Michelle Brachman, Aabhas Sharma, Kristina Brimijoin, Qian Pan, Christine T Wolf, et al. 2021. AI-Assisted Human Labeling: Batching for Efficiency without Overreliance. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (2021), 1-27.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c1709a6f-9a44-4a52-81e5-8bc0aec5aa60",
        "metadata": {},
        "text": "Catherine A Ashworth. 1996. GUI Users have trouble using graphic conventions on novel tasks. In Conference Companion on Human Factors in Computing Systems. 75-16.",
        "type": "NarrativeText"
    },
    {
        "element_id": "095b8aa5-4288-466d-930b-5782e4364cff",
        "metadata": {},
        "text": "Amanda Askell, Yuntao Bai, Anna Chen, Dawn Drain, Deep Ganguli, Tom Henighan, Andy Jones, Nicholas Joseph, Ben Mann, Nova DasSarma, et al. 2021. A general language assistant as a laboratory for alignment. arXiv preprint arXiv:2112,00861 (2021).",
        "type": "NarrativeText"
    },
    {
        "element_id": "7f06b2f2-41a6-4bda-8940-a512eb5ebef7",
        "metadata": {},
        "text": "Leif Azzopardi, Paul Thomas, and Nick Craswell. 2018. Measuring the utility of search engine result pages: an information foraging based measure. In The 41st International ACM SIGIR conference on research & development in information retrieval. 605-614.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c8e6fefa-4f8f-4f45-986e-9ed9b4f8871d",
        "metadata": {},
        "text": "Shraddha Barke, Michael B James, and Nadia Polikarpova. 2022. Grounded Copilot: How Programmers Interact with Code-Generating Models. arXiv preprint arXiv:2206. 15000 (2022).",
        "type": "NarrativeText"
    },
    {
        "element_id": "7a731d52-395b-4ee3-aabe-20e5c9d1c5f0",
        "metadata": {},
        "text": "Rishi Bommasani, Drew A Hudson, Ehsan Adeli, Russ Altman, Simran Arora, Sydney von Arx, Michael S Bernstein, Jeannette Bohg, Antoine Bosselut, Emma Brunskill, et al. 2021. On the opportunities and risks of foundation models. arXiv preprint arXiv:2108.07258 (2021).",
        "type": "NarrativeText"
    },
    {
        "element_id": "e3235b70-cb0e-4498-9694-9ca96a56ea2d",
        "metadata": {},
        "text": "Joel Brandt, Mira Dontcheva, Marcos Weskamp, and Scott R Klemmer. 2010. Example-centric programming: integrating web search into the development environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 513-522.",
        "type": "NarrativeText"
    },
    {
        "element_id": "aef37f75-1b8d-42a6-bbfe-f211babd606c",
        "metadata": {},
        "text": "Virginia Braun and Victoria Clarke. 2022. Common challenges in Thematic Analysis and how to avoid them. Retrieved August 11 2022 from https://youtu. be/tpWLsckpM78",
        "type": "NarrativeText"
    },
    {
        "element_id": "ea9dedc7-5d03-40db-bfa4-8dbfdbc0536d",
        "metadata": {},
        "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Ka- plan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. In Advances in Neural Information Processing Systems, H. Larochelle, M. Ranzato, R. Hadsell, M.F. Balcan, and H. Lin (Eds.), Vol. 33. Curran Associates, Inc., 1877-1901. https://proceedings.neurips.cc/paper/2020/ file/1457c0d6bfcb4967418bfb8ac1 42f64a-Paper.pdf",
        "type": "NarrativeText"
    },
    {
        "element_id": "0f5e72b7-00e1-4412-98de-b7c7844b1ab0",
        "metadata": {},
        "text": "Sallyann Bryant, Pablo Romero, and Benedict\" du Boulay. 2006. The Collabora- tive Nature of Pair Programming. In Extreme Programming and Agile Processes in Software Engineering, Pekka Abrahamsson, Michele Marchesi, and Giancarlo Succi (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 53-64.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4848ff67-cef0-4d57-a512-59684426c393",
        "metadata": {},
        "text": "Andres Campero, Michelle Vaccaro, Jaeyoon Song, Haoran Wen, Abdullah Almaatouq, and Thomas W Malone. 2022. A Test for Evaluating Performance in Human-Computer Systems. arXiv preprint arXiv:2206.12390 (2022). Gaetano Cascini, Yukari Nagai, Georgi V Georgiev, Jader Zelaya, Niccold Be- cattini, Jean-Francois Boujut, Hernan Casakin, Nathan Crilly, Elies Dekoninck, John Gero, et al. 2022. Perspectives on design creativity and innovation research: 10 years later. , 30 pages.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ed19c54f-167c-46e3-95e9-e76f9e4a9e90",
        "metadata": {},
        "text": "Stephen Cass. 2022. Top Programming Languages 2022. IEEE Spectrum (23 Aug 2022). https://spectrum.ieee.org/top-programming- languages- 2022",
        "type": "NarrativeText"
    },
    {
        "element_id": "cd495ed3-1cde-4bd2-8976-99ffed028439",
        "metadata": {},
        "text": "Cristina Catalan Aguirre, Nuria Gonzalez Castro, Carlos Delgado Kloos, Carlos Alario-Hoyos, and Pedro José Mufioz Merino. 2021. Conversational agent for supporting learners on a MOOC on programming with Java. (2021).",
        "type": "NarrativeText"
    },
    {
        "element_id": "90dfc56f-b7ac-4fd4-99d5-b89b890ea291",
        "metadata": {},
        "text": "Ana Paula Chaves and Marco Aurelio Gerosa. 2021. How should my chatbot interact? A survey on social characteristics in human-chatbot interaction design. International Journal of Human-Computer Interaction 37, 8 (2021), 729-758. Mark Chen, Jerry Tworek, Heewoo Jun, Qiming Yuan, Henrique Ponde, Jared Kaplan, Harrison Edwards, Yura Burda, Nicholas Joseph, Greg Brockman, Alex Ray, Raul Puri, Gretchen Krueger, Michael Petrov, Heidy Khlaaf, Girish Sas- try, Pamela Mishkin, Brooke Chan, Scott Gray, Nick Ryder, Mikhail Pavlov, Alethea Power, Lukasz Kaiser, Mohammad Bavarian, Clemens Winter, Philippe Tillet, Felipe Petroski Such, David W. Cummings, Matthias Plappert, Fotios Chantzis, Elizabeth Barnes, Ariel Herbert-Voss, William H. Guss, Alex Nichol, Igor Babuschkin, S. Arun Balaji, Shantanu Jain, Andrew Carr, Jan Leike, Joshua Achiam, Vedant Misra, Evan Morikawa, Alec Radford, Matthew M. Knight, Miles Brundage, Mira Murati, Katie Mayer, Peter Welinder, Bob McGrew, Dario Amodei, Sam McCandlish, Ilya Sutskever, and Wojciech Zaremba. 2021. Evalu- ating a Large Language Models Trained on Code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "aa37dd54-2660-482d-81e6-5d9ed05f6615",
        "metadata": {},
        "text": "Li-Te Cheng, RB. De Souza, Susanne Hupfer, John Patter- son, and Steven Ross. 2003. Building Collaboration into IDEs: Edit>Compile>Run>Debug>Collaborate? Queue 1, 9 (2003).",
        "type": "NarrativeText"
    },
    {
        "element_id": "76ffcad5-3b8b-4747-a550-14fe3cf8da92",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "d810b4a0-aeeb-4925-a673-c8f2c3caab0b",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "6b64a66f-04ac-429a-a4c7-5e3205de7638",
        "metadata": {},
        "text": "26",
        "type": "UncategorizedText"
    },
    {
        "element_id": "7414da26-122c-4d76-bfa7-035ce8b226d1",
        "metadata": {},
        "text": "27",
        "type": "UncategorizedText"
    },
    {
        "element_id": "07ad9787-9d4a-439b-b487-6fba38d65ed4",
        "metadata": {},
        "text": "28",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e914781d-63e3-4524-bae6-0a202921c3fd",
        "metadata": {},
        "text": "29",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e19e26f8-b3b3-46f3-b5eb-874965f3e58d",
        "metadata": {},
        "text": "30.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "822d04f9-5320-4793-9c67-9f5a2b919158",
        "metadata": {},
        "text": "31",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ee58bc67-1346-4eb3-8422-c6f55a1e2c5a",
        "metadata": {},
        "text": "32.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9d7b9960-544e-4c0d-a2a1-9e790fcacda4",
        "metadata": {},
        "text": "33,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "58d587e5-9e8c-4928-b015-11bab3c15c61",
        "metadata": {},
        "text": "34",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c9beb710-eee6-4196-9ec3-fa961b28477f",
        "metadata": {},
        "text": "35,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6262a7eb-c111-4676-a8f3-9d9650f11c4b",
        "metadata": {},
        "text": "36",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9a0a44ec-effb-414c-90a1-1fc9addfaaef",
        "metadata": {},
        "text": "37",
        "type": "UncategorizedText"
    },
    {
        "element_id": "11ef0927-deb3-4aaf-af23-67bd0428545a",
        "metadata": {},
        "text": "38",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d398766d-7ed9-49ae-b18b-689ae1f7a3dc",
        "metadata": {},
        "text": "39",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a726d650-6b68-4f13-bd6a-fc11552f871b",
        "metadata": {},
        "text": "40.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3f9908e7-ee5d-426a-b9ed-d50aed3bf735",
        "metadata": {},
        "text": "41",
        "type": "UncategorizedText"
    },
    {
        "element_id": "05de4a48-d92e-4af6-a95a-98a0a1a914fe",
        "metadata": {},
        "text": "42",
        "type": "UncategorizedText"
    },
    {
        "element_id": "94a830c2-e36e-4c3d-9f85-e0e94710aeb4",
        "metadata": {},
        "text": "43",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fcf7e863-ab49-4f74-a2d6-03224ea92ba0",
        "metadata": {},
        "text": "44",
        "type": "UncategorizedText"
    },
    {
        "element_id": "74a3c61a-707a-4605-a05a-b69f7fe646b8",
        "metadata": {},
        "text": "45",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6c0a2508-5a9c-438e-a287-030d655577bd",
        "metadata": {},
        "text": "46",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9b7d3bbc-91a8-4af8-a0b2-11a69413dfaf",
        "metadata": {},
        "text": "47",
        "type": "UncategorizedText"
    },
    {
        "element_id": "daaec88f-610c-4de8-b46a-f9e67d55e768",
        "metadata": {},
        "text": "Carl Cook, Warwick Irwin, and Neville Churcher. 2005. A user evaluation of synchronous collaborative software engineering tools. In 12th Asia-Pacific Software Engineering Conference (APSEC’05). IEEE, 6-pp.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a0181e24-eba8-4753-a3ad-539f63039e27",
        "metadata": {},
        "text": "Claudio Leén de la Barra, Broderick Crawford, Ricardo Soto, Sanjay Misra, and Eric Monfroy. 2013. Agile Software Development: It Is about Knowledge Management and Creativity. In Computational Science and Its Applications - ICCSA 2013, Beniamino Murgante, Sanjay Misra, Maurizio Carlini, Carmelo M. Torre, Hong-Quang Nguyen, David Taniar, Bernady O. Apduhan, and Osvaldo Gervasi (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 98-113.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8302ccfe-4471-4a79-9041-c9152ccd8880",
        "metadata": {},
        "text": "Uri Dekel and Steven Ross. 2004. Eclipse as a platform for research on in- terruption management in software development. In Proceedings of the 2004 OOPSLA workshop on Eclipse Technology eXchange (Vancouver, British Columbia, Canada), Michael G. Burke (Ed.). ACM, 12-16.",
        "type": "NarrativeText"
    },
    {
        "element_id": "31075d9b-9ed0-4eed-8c00-9efa4183a9b2",
        "metadata": {},
        "text": "Bobbie Eicher, Kathryn Cunningham, Sydni Peterson Marissa Gonzales, and Ashok Goel. 2017. Toward mutual theory of mind as a foundation for co-creation. In International Conference on Computational Creativity, Co-Creation Workshop. Stephen M Fiore, Eduardo Salas, and Janis A Cannon-Bowers. 2001. Group dynamics and shared mental model development. How people evaluate others in organizations 234 (2001).",
        "type": "NarrativeText"
    },
    {
        "element_id": "8b296997-12bf-4e4e-b82b-9a75730d3bae",
        "metadata": {},
        "text": "Erich Gamma, Richard Helm, Ralph Johnson, and John Vlissides. 1995. Design patterns: elements of reusable object-oriented software. Addison-Wesley. GitHub, Inc. 2022. GitHub copilot - your AI pair programmer. Retrieved August 5, 2022 from https://github.com/features/copilot/",
        "type": "NarrativeText"
    },
    {
        "element_id": "e3ed5c3f-35d3-4acb-9eb9-3aef9119bc8a",
        "metadata": {},
        "text": "Amelia Glaese, Nat McAleese, Maja Trebacz, John Aslanides, Vlad Firoiu, Timo Ewalds, Maribeth Rauh, Laura Weidinger, Martin Chadwick, Phoebe Thacker, Lucy Campbell-Gillingham, Jonathan Uesato, Po-Sen Huang, Ramona Comanescu, Fan Yang, Abigail See, Sumanth Dathathri, Rory Greig, Charlie Chen, Doug Fritz, Jaume Sanchez Elias, Richard Green, Sofia Mokra, Nicholas Fernando, Boxi Wu, Rachel Foley, Susannah Young, lason Gabriel, William Isaac, John Mellor, Demis Hassabis, Koray Kavukcuoglu, Lisa Anne Hendricks, and Geoffrey Irving. 2022. Improving alignment of dialogue agents via targeted human judgements. https://arxiv.org/abs/2209.14375",
        "type": "NarrativeText"
    },
    {
        "element_id": "dd5427d6-0e57-43d1-a5cc-1f807ea94e34",
        "metadata": {},
        "text": "Stephanie Glen. 2022. ChatGPT writes code, but won't replace devel- opers. TechTarget (14 12 2022). Retrieved 20-Jan-2023 from https: //www.techtarget.com/searchsoftwarequality/news/252528379/ChatGPT- writes-code-but-wont-replace- developers",
        "type": "NarrativeText"
    },
    {
        "element_id": "4d7dd6da-68f8-4695-b376-0f9a7912555d",
        "metadata": {},
        "text": "Samuel Holmes, Anne Moorhead, Raymond Bond, Huiru Zheng, Vivien Coates, and Mike McTear. 2018. WeightMentor: a new automated chatbot for weight loss maintenance. In Proceedings of the 32nd International BCS Human Computer Interaction Conference 32. 1-5.",
        "type": "NarrativeText"
    },
    {
        "element_id": "37a07429-b0b5-4646-b72e-7aeec76a87d4",
        "metadata": {},
        "text": "Xing Hu, Ge Li, Xin Xia, David Lo, and Zhi Jin. 2020. Deep code comment generation with hybrid lexical and syntactical information. Empirical Software Engineering 25, 3 (2020), 2179-2217.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f01a1a38-fca1-4f37-8a10-94920138d53f",
        "metadata": {},
        "text": "Edwin L Hutchins, James D Hollan, and Donald A Norman. 1985. Direct manip- ulation interfaces. Human-computer interaction 1, 4 (1985), 311-338. Srinivasan lyer, Ioannis Konstas, Alvin Cheung, and Luke Zettlemoyer. 2016. Summarizing source code using a neural attention model. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). 2073-2083.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e961f419-dd97-4277-8e79-403e684fbf7e",
        "metadata": {},
        "text": "Andreas Jedlitschka and Markus Nick. 2003. Software Engineering Knowledge Repositories. Springer Berlin Heidelberg, Berlin, Heidelberg, 55-80.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b9af9d68-a257-4178-985c-bbbaeece2db0",
        "metadata": {},
        "text": "Eirini Kalliamvakou. 2022. Research: Quantifying github copilot’s impact on developer productivity and happiness. _ https://github.blog/2022-09-07- research- quantifying- github-copilots-impact-on-developer-productivity- and-happiness/",
        "type": "NarrativeText"
    },
    {
        "element_id": "c4cfec43-e43d-4205-9838-e3da9bcc162d",
        "metadata": {},
        "text": "Anna Kantosalo et al. 2019. Human-Computer Co-Creativity: Designing, Evalu- ating and Modelling Computational Collaborators for Poetry Writing. (2019). Sandeep Kaur Kuttal, Bali Ong, Kate Kwasny, and Peter Robe. 2021. Trade- Offs for Substituting a Human with an Agent in a Pair Programming Context: The Good, the Bad, and the Ugly. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI '21). Association for Computing Machinery, New York, NY, USA, Article 243, 20 pages. Lauramaria Laine. 2021. Exploring Advertising Creatives’ Attitudes Towards Human-Al Collaboration. (2021).",
        "type": "NarrativeText"
    },
    {
        "element_id": "d506ebdd-b8f1-4cfc-bee3-436e0590de07",
        "metadata": {},
        "text": "Yujia Li, David Choi, Junyoung Chung, Nate Kushman, Julian Schrittwieser, Rémi Leblond, Tom Eccles, James Keeling, Felix Gimeno, Agustin Dal Lago, and et al. 2022. Competition-level code generation with AlphaCode. https: /larxiv.org/abs/2203.07814",
        "type": "NarrativeText"
    },
    {
        "element_id": "c6005ce3-dc45-4eee-a7ce-3fdf84e3f2fc",
        "metadata": {},
        "text": "Yaosheng Lou and Qi Sun. 2021. Over-reliance on database: A case study of using web of science. Human Behavior and Emerging Technologies 3, 3 (2021), 454-459,",
        "type": "NarrativeText"
    },
    {
        "element_id": "18c76537-bc3c-4710-9f80-3542c62dd2d6",
        "metadata": {},
        "text": "David Lyell and Enrico Coiera. 2017. Automation bias and verification complex- ity: a systematic review. Journal of the American Medical Informatics Association 24, 2 (2017), 423-431.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9b08a1ed-42d2-47ee-9607-bcd4ac0f4bab",
        "metadata": {},
        "text": "Wendy E Mackay and Anne-Laure Fayard. 1997. HCI, natural science and design: a framework for triangulation across disciplines. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques. 223-234.",
        "type": "NarrativeText"
    },
    {
        "element_id": "95d80345-3ffe-48ef-b88d-bae16c114291",
        "metadata": {},
        "text": "509",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8be4fff0-45bf-414f-8148-46466ac8e8f9",
        "metadata": {},
        "text": "48",
        "type": "UncategorizedText"
    },
    {
        "element_id": "99ee40bd-d218-499c-9229-00630ed1df28",
        "metadata": {},
        "text": "49",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1ddea7ef-258a-460f-a8cc-06afeb39f8f1",
        "metadata": {},
        "text": "50.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8d7b08b6-13d6-4b18-9ec1-e3d2f4f0a94d",
        "metadata": {},
        "text": "51",
        "type": "UncategorizedText"
    },
    {
        "element_id": "cbeb123c-dbe3-4dc3-94f9-3a6d10cfa0e2",
        "metadata": {},
        "text": "52)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "521b3a50-fd8a-42cc-9e89-87b0f4092c54",
        "metadata": {},
        "text": "53,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "261e8b7a-ff7d-43f8-ab04-a9af6dc1d903",
        "metadata": {},
        "text": "54",
        "type": "UncategorizedText"
    },
    {
        "element_id": "bc453a64-12a7-4285-8130-206825277787",
        "metadata": {},
        "text": "55,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "572e295c-85ce-4cf3-83b4-6cbe78a70028",
        "metadata": {},
        "text": "56",
        "type": "UncategorizedText"
    },
    {
        "element_id": "aa919c49-38f6-4731-978e-fcfab4f1ce18",
        "metadata": {},
        "text": "57",
        "type": "UncategorizedText"
    },
    {
        "element_id": "49d57258-50d8-4f7d-b8b4-ab3316424b83",
        "metadata": {},
        "text": "58.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9ac2ddfa-537b-403e-8dbd-f6e2614625d8",
        "metadata": {},
        "text": "59",
        "type": "UncategorizedText"
    },
    {
        "element_id": "dbdb3b18-121e-4d22-849f-aab727c9d47a",
        "metadata": {},
        "text": "60.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b1fb182d-e156-4263-babc-abe2d21b30fe",
        "metadata": {},
        "text": "61",
        "type": "UncategorizedText"
    },
    {
        "element_id": "44c9a6a2-a115-4fca-aa6d-b7cd161cbd23",
        "metadata": {},
        "text": "62.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a1850805-49a1-4dce-a592-530bd06fb3d0",
        "metadata": {},
        "text": "63.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "bf1ed669-142f-4b30-a5bb-9d30cfb7b5f1",
        "metadata": {},
        "text": "64",
        "type": "UncategorizedText"
    },
    {
        "element_id": "83379c84-f1c8-4943-bc1c-05f835bb1698",
        "metadata": {},
        "text": "65,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d2e25fab-84ca-4db4-bf06-4b28f8e52c68",
        "metadata": {},
        "text": "66.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5f0a817f-40fb-4b14-98c2-0b2bb2a30a7e",
        "metadata": {},
        "text": "67.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ab19aa56-09dd-4607-a4f2-0332f3c53564",
        "metadata": {},
        "text": "68",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3a5b3706-de5e-455c-9ce9-3dcb0f9a1925",
        "metadata": {},
        "text": "69",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f55541a6-3b21-4377-8d6c-c595a4da7cb3",
        "metadata": {},
        "text": "70.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a10c2fa4-8ac6-4187-ac58-6d6ba4428cb2",
        "metadata": {},
        "text": "71",
        "type": "UncategorizedText"
    },
    {
        "element_id": "54fc2187-7b8b-40c4-abf9-bbd04ae467fd",
        "metadata": {},
        "text": "72.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e23a7df3-e3d4-4a95-9f2f-b17fbc289817",
        "metadata": {},
        "text": "IUI ’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "6c469617-7092-47ac-96d3-e8ae79b50c16",
        "metadata": {},
        "text": "John E Mathieu, Tonia S Heffner, Gerald F Goodwin, Eduardo Salas, and Janis A Cannon-Bowers. 2000. The influence of shared mental models on team process and performance. Journal of applied psychology 85, 2 (2000), 273.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bced85c4-ca14-4cc5-ab71-f78f1251cd86",
        "metadata": {},
        "text": "Cade Metz. 2022. Meet GPT-3. It Has Learned to Code (and Blog and Ar- gue). (Published 2020). https://www.nytimes.com/2020/11/24/science/artificial- intelligence-ai-gpt3.html",
        "type": "UncategorizedText"
    },
    {
        "element_id": "98aad022-d94e-4c7a-be1f-cc778bf1a36b",
        "metadata": {},
        "text": "Robert J. Moore and Raphael Arar. 2019. Conversational UX Design: A Practi- tioner’s Guide to the Natural Conversation Framework. Association for Computing Machinery, New York, NY, USA.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5acd0cb9-b014-4df2-aa8f-71cdf3a3db6b",
        "metadata": {},
        "text": "Ekaterina A Moroz, Vladimir O Grizkevich, and Igor M Novozhilov. 2022. The Potential of Artificial Intelligence as a Method of Software Developer’s Produc- tivity Improvement. In 2022 Conference of Russian Young Researchers in Electrical and Electronic Engineering (ElConRus). IEEE, 386-390.",
        "type": "NarrativeText"
    },
    {
        "element_id": "dc3b75f3-0a6e-4f30-ac50-91489e0880c7",
        "metadata": {},
        "text": "Michael Muller, Stevean Ross, Stephanie Houde, Mayank Agarwal, Fernando Martinez, John Richards, Kartik Talamadupula, and Justin D Weisz. 2022. Drink- ing Chai with Your (Al) Programming Partner: A Design Fiction about Gener- ative Al for Software Engineering. HAI-GEN Workshop at IUI 2022: 3rd Work- shop on Human-Al Co-Creation with Generative Models (2022). _https://hai- gen.github.io/2022/",
        "type": "NarrativeText"
    },
    {
        "element_id": "648b990c-3f13-46c6-8104-81c9b52f3413",
        "metadata": {},
        "text": "Sandra R Murillo and J Alfredo Sanchez. 2014. Empowering interfaces for system administrators: Keeping the command line in mind when designing GUIs. In Proceedings of the XV International Conference on Human Computer Interaction. 1-4,",
        "type": "NarrativeText"
    },
    {
        "element_id": "f354467b-90e6-494e-9a3b-79ecf67abe98",
        "metadata": {},
        "text": "Elizabeth D Mynatt and Gerhard Weber. 1994. Nonvisual presentation of graph- ical user interfaces: contrasting two approaches. In Proceedings of the SIGCHI conference on Human factors in computing systems. 166-172.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5be5da94-2a2d-46c2-9f21-bc07b8cda5ba",
        "metadata": {},
        "text": "Alok Mysore and Philip J Guo. 2017. Torta: Generating mixed-media gui and command-line app tutorials using operating-system-wide activity tracing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 703-714.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fc40900e-e011-48eb-af24-360c1bf12a50",
        "metadata": {},
        "text": "C. Nass and Y. Moon. 2000. Machines and Mindlessness: Social Responses to Computers. Journal of Social Issues 56, 1 (2000), 81-103.",
        "type": "NarrativeText"
    },
    {
        "element_id": "aae51547-30a7-43d0-840e-4c1ec3709bcd",
        "metadata": {},
        "text": "Nhan Nguyen and Sarah Nadi. 2022. An Empirical Evaluation of GitHub Copi- lot’s Code Suggestions. In 2022 IEEE/ACM 19th International Conference on Mining Software Repositories (MSR). IEEE, 1-5.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ef286b5f-6af2-487b-b193-4aa1917c0b4d",
        "metadata": {},
        "text": "Martin Nordio, H Estler, Carlo A Furia, Bertrand Meyer, et al. 2011. Collaborative software development on the web. arXiv preprint arXiv:1105.0768 (2011). Maxwell Nye, Anders Andreassen, Guy Gur-Ari, Henryk Witold Michalewski, Ja- cob Austin, David Bieber, David Martin Dohan, Aitor Lewkowycz, Maarten Paul Bosma, David Luan, Charles Sutton, and Augustus Odena. 2021. Show Your Work: Scratchpads for Intermediate Computation with Language Models. https://arxiv.org/abs/2112.00114.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1fefa3bd-f0d6-4d42-8c52-afeee6af0916",
        "metadata": {},
        "text": "OpenAl. 2022. ChatGPT: Optimizing Language Models for Dialogue. OpenAI Blog (30 11 2022). Retrieved 20-Jan-2023 from https://openai.com/blog/chatgpt/ Long Ouyang, Jeff Wu, Xu Jiang, Diogo Almeida, Carroll L. Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul Christiano, Jan Leike, and Ryan Lowe. 2022. Training language models to follow instructions with human feedback. _https://arxiv. org/abs/2203.02155",
        "type": "NarrativeText"
    },
    {
        "element_id": "eb58bb60-5121-4790-a3c6-04a91d2727c7",
        "metadata": {},
        "text": "Peter Pirolli and Stuart Card. 1999. Information foraging. Psychological review 106, 4 (1999), 643.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a8738d84-c955-444c-a17f-82c4527b5c68",
        "metadata": {},
        "text": "Larry Press. 1990. Personal computing: Windows, DOS and the MAC. Commun. ACM 33, 11 (1990), 19-26.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fc0d79d1-2c31-44cd-91c7-fca68aa91d29",
        "metadata": {},
        "text": "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, et al. 2019. Language Models are Unsupervised Multitask Learners. Alvin Rajkomar, Jeffrey Dean, and Isaac Kohane. 2019. Machine learning in medicine. New England Journal of Medicine 380, 14 (2019), 1347-1358.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1a2124cc-5973-4393-a0fc-fca8ed655d8d",
        "metadata": {},
        "text": "Aditya Ramesh, Prafulla Dhariwal, Alex Nichol, Casey Chu, and Mark Chen. 2022. Hierarchical text-conditional image generation with clip latents. arXiv preprint arXiv:2204.06125 (2022).",
        "type": "NarrativeText"
    },
    {
        "element_id": "a7b69b5e-1c74-42e4-90be-c22e2a55ae86",
        "metadata": {},
        "text": "B. Reeves and C.L. Nass. 1996. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. CSLI Publications. Mawarny Md Rejab, James Noble, and George Allan. 2014. Distributing Expertise in Agile Software Development Projects. In 2014 Agile Conference. 33-36.",
        "type": "NarrativeText"
    },
    {
        "element_id": "39f49921-442e-46e8-b39c-352221155c9e",
        "metadata": {},
        "text": "Jeba Rezwana and Mary Lou Maher. 2021. COFI: A Framework for Modeling Interaction in Human-Al Co-Creative Systems.. In ICCC. 444-448.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6571bb88-2aa4-48ee-9ca7-5093418e4f43",
        "metadata": {},
        "text": "Charles H. Rich and Richard C. Waters. 1990. The Programmer's Apprentice. Addison-Wesley Publishing Company, Reading, MA.",
        "type": "NarrativeText"
    },
    {
        "element_id": "20063896-6a62-4f82-bea2-ebab5ecfe14a",
        "metadata": {},
        "text": "Peter Robe and Sandeep Kaur Kuttal. 2022. Designing PairBuddy—A Conver- sational Agent for Pair Programming. ACM Transactions on Computer-Human Interaction (TOCHI) 29, 4 (2022), 1-44.",
        "type": "NarrativeText"
    },
    {
        "element_id": "beb66f94-9da6-4759-a8d1-8754ae00e2e2",
        "metadata": {},
        "text": "Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Bjorn. Ommer. 2022. High-resolution image synthesis with latent diffusion models. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recogni- tion. 10684-10695.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c825d4bc-c4ca-4690-b224-6df4fda69bb1",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "87deecd8-04c8-4d88-a7d0-d6abc42b0163",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "6dc1de11-e545-47e4-af9f-544dd538a8ca",
        "metadata": {},
        "text": "73",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a63cacd4-96a2-4177-989f-dcbb500cec41",
        "metadata": {},
        "text": "74",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6d142d00-040e-48ee-8e32-f56480e06ebf",
        "metadata": {},
        "text": "75,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "43dded04-362b-40fb-a128-e9cf4109d6a6",
        "metadata": {},
        "text": "76",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2709271e-9f4a-42c5-9457-a606cc92724c",
        "metadata": {},
        "text": "77",
        "type": "UncategorizedText"
    },
    {
        "element_id": "37f32d10-73a1-4a0e-b1ba-21fe5c91a0b8",
        "metadata": {},
        "text": "78",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0bd7a22d-1c0a-466d-bf8e-187c3067f99e",
        "metadata": {},
        "text": "79",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c1626562-7d5a-464d-b14f-5946eb210d6f",
        "metadata": {},
        "text": "80.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c98867ef-51db-4c55-8c66-284386e936c3",
        "metadata": {},
        "text": "81",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8ab015b2-4ccc-464f-95e2-d1528e6b2e89",
        "metadata": {},
        "text": "82.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "61e62dc2-67a6-4180-8aac-52ea206c3ff7",
        "metadata": {},
        "text": "83. 84",
        "type": "ListItem"
    },
    {
        "element_id": "bd10dad3-dfc2-405d-9063-21b2c0b70a07",
        "metadata": {},
        "text": "85,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "48a2c9fa-2e58-4711-865e-cdffd7f007c6",
        "metadata": {},
        "text": "86",
        "type": "UncategorizedText"
    },
    {
        "element_id": "62d60bf7-2d54-4817-86fb-0db837c32934",
        "metadata": {},
        "text": "87",
        "type": "UncategorizedText"
    },
    {
        "element_id": "56be31d6-dd51-4fc8-9cfb-4820fa9cbcbb",
        "metadata": {},
        "text": "88",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d00f1b3e-ffcd-4c7b-b323-cc0c2f28f63c",
        "metadata": {},
        "text": "89",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c41364cb-cf68-4cb5-a28f-24fc2b83f7ab",
        "metadata": {},
        "text": "90.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "303d9d19-a480-4cc7-b1e3-05f4e342408d",
        "metadata": {},
        "text": "91",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9ab26a43-da63-4a40-9880-3cbf3cf6e071",
        "metadata": {},
        "text": "92)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3d57c35d-8c52-4977-ba08-07e0a39c7400",
        "metadata": {},
        "text": "93,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "239303b1-ef16-42ba-af42-5ae24749a597",
        "metadata": {},
        "text": "94",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6511dc74-b153-40ea-ab69-772be47b90a7",
        "metadata": {},
        "text": "95,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "99675463-b106-4b0e-92dd-6d16ef9622f4",
        "metadata": {},
        "text": "96",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ce3cfd91-09ca-457c-904f-e1ae7bafaf93",
        "metadata": {},
        "text": "Steven Ross, Elizabeth Brownholtz, and Robert Armes. 2004. A Multiple- Application Conversational Agent. In Proceedings of the 9th International Con- ‘ference on Intelligent User Interfaces (Funchal, Madeira, Portugal) (IUI '04). Asso- ciation for Computing Machinery, New York, NY, USA, 319-321.",
        "type": "NarrativeText"
    },
    {
        "element_id": "96c759e1-6bee-4633-8dd5-d635009acba5",
        "metadata": {},
        "text": "Steven Ross, Elizabeth Brownholtz, and Robert Armes. 2004. Voice User Interface Principles for a Conversational Agent. In Proceedings of the 9th International Conference on Intelligent User Interfaces (Funchal, Madeira, Portugal) (IUI '04). Association for Computing Machinery, New York, NY, USA, 364-365.",
        "type": "NarrativeText"
    },
    {
        "element_id": "450b3b8c-1637-4e74-9182-7695e5d37dbc",
        "metadata": {},
        "text": "Baptiste Roziere, Marie-Anne Lachaux, Lowik Chanussot, and Guillaume Lample. 2020. Unsupervised Translation of Programming Languages. In Advances in Neural Information Processing Systems, H. Larochelle, M. Ranzato, R. Hadsell, MF. Balcan, and H. Lin (Eds.), Vol. 33. Curran Associates, Inc., 20601-20611. Harvey Sacks. 1984. Notes on methodology. In Structures of Social Action: Studies in Conversation Analysis, John Heritage and J. Maxwell Atkinson (Eds.). Cambridge University Press, Cambridge, 2-27.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a11a1c15-4c17-4fa8-b94a-7d41df8e2510",
        "metadata": {},
        "text": "Nithya Sambasivan and Rajesh Veeraraghavan. 2022. The Deskilling of Domain Expertise in AI Development. In CHI Conference on Human Factors in Computing Systems. 1-14.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a5d4c34e-d946-4ac9-9ed0-fb25aa678e6a",
        "metadata": {},
        "text": "Harini Sampath, Alice Merrick, and Andrew Macvean. 2021. Accessibility of command line interfaces. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1-10.",
        "type": "NarrativeText"
    },
    {
        "element_id": "409d7df9-c701-4fc4-951c-e5a76b02e14d",
        "metadata": {},
        "text": "Matthias Scheutz, Scott A DeLoach, and Julie A Adams. 2017. A framework for developing and using shared mental models in human-agent teams. Journal of Cognitive Engineering and Decision Making 11, 3 (2017), 203-224.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2d879ceb-0407-4841-a422-8cdf341dab39",
        "metadata": {},
        "text": "Isabella Seeber, Eva Bittner, Robert O Briggs, Triparna De Vreede, Gert-Jan De Vreede, Aaron Elkins, Ronald Maier, Alexander B Merz, Sarah Oeste-Reif, Nils Randrup, et al. 2020. Machines as teammates: A research agenda on AI in team collaboration. Information & management 57, 2 (2020), 103174.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6a9cdaf7-a30e-4834-a875-51e1127d5643",
        "metadata": {},
        "text": "Shilad Sen, Werner Geyer, Michael Muller, Marty Moore, Beth Brownholtz, Eric Wilcox, and David R Millen. 2006. FeedMe: a collaborative alert filtering system. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. 89-98.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5873df5e-c2e3-4384-a199-d6633df0223a",
        "metadata": {},
        "text": "Ben Shneiderman. 2020. Human-centered artificial intelligence: Three fresh ideas. AIS Transactions on Human-Computer Interaction 12, 3 (2020), 109-124. Ben Shneiderman. 2022. Human-Centered Al. Oxford University Press.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e64ad9d0-b926-4766-9a28-4a4ba6f83b8b",
        "metadata": {},
        "text": "Kurt Shuster, Jing Xu, Mojtaba Komeili, Da Ju, Eric Michael Smith, Stephen Roller, Megan Ung, Moya Chen, Kushal Arora, Joshua Lane, et al. 2022. BlenderBot 3: a deployed conversational agent that continually learns to responsibly engage. arXiv preprint arXiv:2208.03188 (2022).",
        "type": "NarrativeText"
    },
    {
        "element_id": "c5e54157-0e47-4fcc-b192-6e968e6c51c1",
        "metadata": {},
        "text": "Michael Skirpan and Casey Fiesler. 2018. Ad empathy: A design fiction. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. 267-273. Diomidis Spinellis. 2012. Git. IEEE Software 29, 3 (2012), 100-101. https: //doi.org/10.1109/MS.2012.61",
        "type": "NarrativeText"
    },
    {
        "element_id": "8a778dfc-ccdb-4205-b4fb-4e265c176fb2",
        "metadata": {},
        "text": "Angie Spoto and Natalia Oleynik. 2017. Library of Mixed-Initiative Creative Interfaces. Retrieved 19-Jun-2021 from http://mici.codingconduct.cc/",
        "type": "NarrativeText"
    },
    {
        "element_id": "a3654ab7-3d6c-45e9-b997-91c2aaedb20c",
        "metadata": {},
        "text": "Ayushi Srivastava, Shivani Kapania, Anupriya Tuli, and Pushpendra Singh. 2021. Actionable UI Design Guidelines for Smartphone Applications Inclusive of Low-Literate Users. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1 (2021), 1-30.",
        "type": "NarrativeText"
    },
    {
        "element_id": "44d6815e-1a31-4469-a58e-3868ec4c6341",
        "metadata": {},
        "text": "Margaret-Anne Storey and Alexey Zagalsky. 2016. Disrupting developer produc- tivity one bot ata time. In Proceedings of the 2016 24th ACM SIGSOFT international symposium on foundations of software engineering. 928-931.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6243279b-cbe1-41fd-811c-a5fc4b792ce4",
        "metadata": {},
        "text": "Kartik Talamadupula. 2021. Applied AI matters: Al4Code: applying artificial intelligence to source code. AI Matters 7, 1 (2021), 18-20.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5a88e8c5-089a-46b1-af3a-09fef0141afc",
        "metadata": {},
        "text": "Romal Thoppilan, Daniel De Freitas, Jamie Hall, Noam Shazeer, Apoorv Kul- shreshtha, Heng-Tze Cheng, Alicia Jin, Taylor Bos, Leslie Baker, Yu Du, and et al. 2022. LAMDA: Language models for dialog applications. _https: /larxiv.org/abs/2201.08239",
        "type": "NarrativeText"
    },
    {
        "element_id": "c0ac3e66-1f40-46b1-8432-a3e98e7c9598",
        "metadata": {},
        "text": "Michele Tufano, Dawn Drain, Alexey Svyatkovskiy, Shao Kun Deng, and Neel Sundaresan. 2020. Unit Test Case Generation with Transformers and Focal Context. arXiv preprint arXiv:2009.05617 (2020).",
        "type": "NarrativeText"
    },
    {
        "element_id": "827b3472-c8ea-4e54-bd9d-924cc78148c6",
        "metadata": {},
        "text": "Severi Uusitalo, Anna Kantosalo, Antti Salovaara, Tapio Takala, and Christian Guckelsberger. 2022. Co-creative Product Design with Interactive Evolutionary Algorithms: A Practice-Based Reflection. In International Conference on Compu- tational Intelligence in Music, Sound, Art and Design (Part of EvoStar). Springer, 292-307.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7460cd51-3c62-43d4-bca5-379fc2981992",
        "metadata": {},
        "text": "Priyan Vaithilingam and Philip J Guo. 2019. Bespoke: Interactively synthesizing custom GUIs from command-line applications by demonstration. In Proceedings of the 32nd annual ACM symposium on user interface software and technology. 563-576.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5c79fb95-c621-4af9-9d97-85374f9b1229",
        "metadata": {},
        "text": "Priyan Vaithilingam, Tianyi Zhang, and Elena L. Glassman. 2022. Expectation vs. Experience: Evaluating the Usability of Code Generation Tools Powered by Large Language Models. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 332, 7 pages. https://doi.org/10.1145/3491101.3519665",
        "type": "NarrativeText"
    },
    {
        "element_id": "ceba647b-1d31-4d90-bbba-ffedd9c41a38",
        "metadata": {},
        "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, L ukasz Kaiser, and Illia Polosukhin. 2017. Attention is All you",
        "type": "NarrativeText"
    },
    {
        "element_id": "2885680b-2509-4ac1-85b3-cc15748e7966",
        "metadata": {},
        "text": "510",
        "type": "UncategorizedText"
    },
    {
        "element_id": "92cad1a1-ef56-4ed0-a302-d2b8a6ba68d2",
        "metadata": {},
        "text": "[97",
        "type": "UncategorizedText"
    },
    {
        "element_id": "14656040-6d67-4263-9fd8-4961e39eb12f",
        "metadata": {},
        "text": "[98",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3a940df3-16b7-4d1c-912d-faafc7d611d8",
        "metadata": {},
        "text": "[99",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c6288a38-5543-4920-bc49-3378b935bf93",
        "metadata": {},
        "text": "100.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "279daeb4-fbd4-4a49-ad30-8493120dbf8c",
        "metadata": {},
        "text": "101",
        "type": "UncategorizedText"
    },
    {
        "element_id": "253fa40e-d2f8-42a7-9395-6675cc1efa0c",
        "metadata": {},
        "text": "102,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "336023b0-799e-408f-84e7-f0dbb12f30b5",
        "metadata": {},
        "text": "103,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "62a0965d-3e4e-4e7c-adb6-d40d68abbbde",
        "metadata": {},
        "text": "104",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f11c6752-35cc-4c17-aa63-08102a93837d",
        "metadata": {},
        "text": "105,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c461e5cb-54e3-40d8-9d0a-0877e3a7dba6",
        "metadata": {},
        "text": "106",
        "type": "UncategorizedText"
    },
    {
        "element_id": "165b865f-d749-442e-bda8-f23f45071fa5",
        "metadata": {},
        "text": "107,",
        "type": "UncategorizedText"
    },
    {
        "element_id": "87efc826-d734-4108-9eeb-18552332d0bc",
        "metadata": {},
        "text": "108",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c1cd2a16-6e44-45d3-b881-1ed82bc3998b",
        "metadata": {},
        "text": "109",
        "type": "UncategorizedText"
    },
    {
        "element_id": "bccbfb8d-b288-438d-943d-020b83b7e864",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "1af79f30-562e-43af-b9ba-61094267e1d4",
        "metadata": {},
        "text": "Need. In Advances in Neural Information Processing Systems, I. Guyon, U. Von Luxburg, S. Bengio, H. Wallach, R. Fergus, $. Vishwanathan, and R. Garnett (Eds.), Vol. 30. Curran Associates, Inc. https://proceedings.neurips.cc/paper/ 2017/file/3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf",
        "type": "NarrativeText"
    },
    {
        "element_id": "8a2091af-7841-4a22-a8e5-0e9f37f882d3",
        "metadata": {},
        "text": "Yao Wan, Zhou Zhao, Min Yang, Guandong Xu, Haochao Ying, Jian Wu, and Philip $ Yu. 2018. Improving automatic source code summarization via deep rein- forcement learning. In Proceedings of the 33rd ACM/IEEE international conference on automated software engineering. 397-407.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4112131b-1ad7-4d65-914e-02065c6651ef",
        "metadata": {},
        "text": "April Yi Wang, Dakuo Wang, Jaimie Drozdal, Michael Muller, Soya Park, Justin D Weisz, Xuye Liu, Lingfei Wu, and Casey Dugan. 2022. Documentation Matters: Human-Centered AI System to Assist Data Science Code Documentation in Computational Notebooks. ACM Transactions on Computer-Human Interaction 29, 2 (2022), 1-33.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9586232f-a43d-4aeb-94b7-0652eca8b0ff",
        "metadata": {},
        "text": "Dakuo Wang, Justin D Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-Al collaboration in data science: Exploring data scientists’ perceptions of automated AI. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (2019), 1-24.",
        "type": "NarrativeText"
    },
    {
        "element_id": "41f1e838-4352-4a8c-bf84-5dac9c4426ac",
        "metadata": {},
        "text": "Qiaosi Wang, Koustuv Saha, Eric Gregori, David Joyner, and Ashok Goel. 2021. Towards mutual theory of mind in human-ai interaction: How language reflects what students perceive about a virtual teaching assistant. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1-14.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d73a28cc-fa5c-45eb-82f9-92ac663409b3",
        "metadata": {},
        "text": "Jeremy Warner and Philip J Guo. 2017. Codepilot: Scaffolding end-to-end collaborative software development for novice programmers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1136-1141. Justin D Weisz, Michael Muller, Stephanie Houde, John Richards, Steven I Ross, Fernando Martinez, Mayank Agarwal, and Kartik Talamadupula. 2021. Per- fection Not Required? Human-AI Partnerships in Code Translation. In 26th International Conference on Intelligent User Interfaces. 402-412.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9b766acb-5f97-47eb-a886-de1131813b04",
        "metadata": {},
        "text": "Justin D Weisz, Michael Muller, Steven I Ross, Fernando Martinez, Stephanie Houde, Mayank Agarwal, Kartik Talamadupula, and John T Richards. 2022. Bet- ter together? an evaluation of ai-supported code translation. In 27th International Conference on Intelligent User Interfaces. 369-391.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bede70d9-4481-4c7b-8d54-4a3cecbc6d93",
        "metadata": {},
        "text": "Joseph Weizenbaum. 1966. ELIZA — a computer program for the study of natural language communication between man and machine. Commun. ACM 9 (1966), 36-45.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ba3c6c93-17e6-4a31-b67f-f9740f35ce71",
        "metadata": {},
        "text": "Frank F Xu, Bogdan Vasilescu, and Graham Neubig. 2022. In-ide code generation from natural language: Promise and challenges. ACM Transactions on Software Engineering and Methodology (TOSEM) 31, 2 (2022), 1-47.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bcee44d6-ccf4-46bc-bdf1-c1304d78bd03",
        "metadata": {},
        "text": "Aditya Ankur Yadav, Ishan Garg, and Dr. Pratistha Mathur. 2019. PACT - Pro- gramming Assistant ChaTbot. In 2019 2nd International Conference on Intelligent Communication and Computational Techniques (ICCT). 131-136.",
        "type": "NarrativeText"
    },
    {
        "element_id": "99dde089-edbe-42e8-a9aa-5cdd652595b3",
        "metadata": {},
        "text": "Munazza Zaib, Quan Z. Sheng, and W. Zhang. 2020. A Short Survey of Pre- trained Language Models for Conversational Al-A New Age in NLP. Proceedings of the Australasian Computer Science Week Multiconference (2020).",
        "type": "NarrativeText"
    },
    {
        "element_id": "6c800936-16f5-4f59-914a-1eabacebd685",
        "metadata": {},
        "text": "Elaine Zibrowski, Lisa Shepherd, Kamran Sedig, Richard Booth, Candace Gibson, et al. 2018. Easier and faster is not always better: grounded theory of the impact of large-scale system transformation on the clinical work of emergency medicine nurses and physicians. JMIR Human Factors 5, 4 (2018), €11013.",
        "type": "NarrativeText"
    },
    {
        "element_id": "302b2e44-8b68-4bf7-bbd1-b2c78ecac8b1",
        "metadata": {},
        "text": "Albert Ziegler, Eirini Kalliamvakou, X. Alice Li, Andrew Rice, Devon Rifkin, Shawn Simister, Ganesh Sittampalam, and Edward Aftandilian. 2022. Produc- tivity Assessment of Neural Code Completion. In Proceedings of the 6th ACM SIGPLAN International Symposium on Machine Programming (San Diego, CA, USA) (MAPS 2022). Association for Computing Machinery, New York, NY, USA, 21-29. https://doi.org/10.1145/3520312.3534864",
        "type": "NarrativeText"
    },
    {
        "element_id": "e7d7d67c-31ed-4de5-9108-44d01db21f66",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "c250fa01-970c-46c3-acbf-3d549ced0ced",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "bffa0d02-7f02-4f1d-b83f-76d466c46551",
        "metadata": {},
        "text": "A SURVEY INSTRUMENTS A.1 Screening Survey",
        "type": "Title"
    },
    {
        "element_id": "0ece9711-4b7e-40c5-b013-355b12abd7ff",
        "metadata": {},
        "text": "The questions below were asked of prospective participants to understand their job role, Python experience, and familiarity with GitHub Copilot. The questions on Python experience were modeled after those used by Weisz et al. [103]. 1. Do you consider yourself primarily a...",
        "type": "NarrativeText"
    },
    {
        "element_id": "85dc6657-1398-4457-8b64-9413b904ea8b",
        "metadata": {},
        "text": "e Data Scientist",
        "type": "Title"
    },
    {
        "element_id": "124a0a1c-ef7a-4235-b8fd-a5af66f894eb",
        "metadata": {},
        "text": "e Manager",
        "type": "Title"
    },
    {
        "element_id": "afdaee4c-e20b-47b5-98e9-c9521e79901b",
        "metadata": {},
        "text": "© Software Architect",
        "type": "Title"
    },
    {
        "element_id": "7c9cee88-416a-4c38-96e2-d5380949fca9",
        "metadata": {},
        "text": "e Software Engineer",
        "type": "Title"
    },
    {
        "element_id": "be1f5cfc-47b4-48ee-98a7-75c408641dd4",
        "metadata": {},
        "text": "e Machine Learning Engineer",
        "type": "Title"
    },
    {
        "element_id": "ae3ed08c-082e-460e-9b3c-c2e675792521",
        "metadata": {},
        "text": "© Other: write-in 2. To what extent are you familiar with Python?",
        "type": "NarrativeText"
    },
    {
        "element_id": "92ae88d6-ede0-4f77-8c9a-a9719d3b7aeb",
        "metadata": {},
        "text": "e Tam not familiar with Python",
        "type": "Title"
    },
    {
        "element_id": "c99e7366-c925-444e-a90f-d4c71603850d",
        "metadata": {},
        "text": "e [have < 1 year of experience with Python",
        "type": "NarrativeText"
    },
    {
        "element_id": "b99242b6-4002-4206-bb37-acb529a1f0da",
        "metadata": {},
        "text": "e [have 1-3 years experience with Python",
        "type": "NarrativeText"
    },
    {
        "element_id": "c740b069-6ca2-4c0d-a85f-9a7dc19c3ada",
        "metadata": {},
        "text": "e [have 3+ years of experience with Python 3. How recently have you written Python code?",
        "type": "NarrativeText"
    },
    {
        "element_id": "bb1d3a0d-3f7c-492c-934f-68bab4290e3c",
        "metadata": {},
        "text": "¢ Within the past month",
        "type": "Title"
    },
    {
        "element_id": "3fe11ecd-5da4-4877-b854-e676b892c071",
        "metadata": {},
        "text": "e Within the past year",
        "type": "Title"
    },
    {
        "element_id": "106496a6-07c9-4f83-908d-8ba6f5a671ee",
        "metadata": {},
        "text": "e Within the past 5 years",
        "type": "Title"
    },
    {
        "element_id": "d5e72552-849f-482d-9649-eba61891e3f5",
        "metadata": {},
        "text": "e Have not written Python code within the past 5 years",
        "type": "NarrativeText"
    },
    {
        "element_id": "1cdfbec3-062d-4880-ac04-395f50ec9143",
        "metadata": {},
        "text": "rs",
        "type": "Title"
    },
    {
        "element_id": "084219db-a964-4621-994c-a25efdb7e822",
        "metadata": {},
        "text": ". To what extent are you familiar with GitHub Copilot? e Iam not familiar with Copilot ¢ I’ve seen demos and/or read about Copilot I’ve tried out Copilot I’ve used Copilot as a tool for my work",
        "type": "NarrativeText"
    },
    {
        "element_id": "6611a1d7-4706-4bf0-81bb-bebe22098718",
        "metadata": {},
        "text": "A.2 Pre-task Survey",
        "type": "Title"
    },
    {
        "element_id": "23b76635-3675-4b54-928a-9ed075434b41",
        "metadata": {},
        "text": "The questions below were asked before a participant used the Pro- grammer’s Assistant to assess their expectations of a conversational programming assistant. This survey took approximately 5 minutes to complete and began with the instructions below:",
        "type": "NarrativeText"
    },
    {
        "element_id": "4939e9a4-a05a-4b37-b0e4-93dcf040a9d2",
        "metadata": {},
        "text": "Hello! We are a team of researchers looking for feed- back on a prototype system we call the Program- mer’s Assistant.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c56807e2-4074-4b66-80b7-458cfac520f1",
        "metadata": {},
        "text": "The Programmer’s Assistant is an experiment in con- versational coding: it consists of a code editor in- tegrated with a chatbot that is able to converse in natural language to answer questions, generate code, and consult on existing code.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2addabba-1bfe-43a1-ae2d-06a8c2f1be92",
        "metadata": {},
        "text": "In this study, you will be asked to complete several programming tasks. We are not evaluating your programming skills on these tasks. Rather, we are interested in understanding how the Programmer’s Assistant is able to help you accomplish those tasks. Your code and interactions with the assistant will be processed by a 3rd party AI model, so please do not include proprietary code or discuss company- confidential information. All data we collect in this study will be anonymized before it is published.",
        "type": "NarrativeText"
    },
    {
        "element_id": "28951048-5815-4a8b-a8c5-25e8c0eb8fbc",
        "metadata": {},
        "text": "S11",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8006ccf4-d1ec-4f34-989e-91f7e3e9ccdd",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "a53b81fa-3316-42ba-8eae-5d09cd1ad426",
        "metadata": {},
        "text": "Before trying out the Programmer’s Assistant, we would like to assess some of your expectations. We estimate that this survey will take 5 minutes.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e8a79ce9-498f-4c4e-afbe-48aae38d2b5f",
        "metadata": {},
        "text": "By submitting this survey, you consent to participate in our study. If you would like to withdraw your con- sent, please email us at [removed].",
        "type": "NarrativeText"
    },
    {
        "element_id": "fedb41f1-bb05-4265-87ae-825c86e0faea",
        "metadata": {},
        "text": "Thanks!",
        "type": "Title"
    },
    {
        "element_id": "e4ab5a52-8fb7-4534-a7ed-f36c4bd76ef2",
        "metadata": {},
        "text": "1. Based on your past experience using chatbots, please let us know how you would anticipate an AI chatbot serving as a programmer’s assistant to perform. Do you expect it will: Scale: Not at all, A little, Somewhat, A great deal e Be easy to use? ¢ Understand your requests? ¢ Provide high quality responses? ¢ Help you to write better code? ¢ Help you to write code more quickly? ¢ Be enjoyable to use? 2. Any other expectations? Open-ended response",
        "type": "ListItem"
    },
    {
        "element_id": "de1a1c8a-350b-425b-817a-1f262c9c2dbe",
        "metadata": {},
        "text": "A.3 Post-task Survey",
        "type": "Title"
    },
    {
        "element_id": "8507d07a-4083-418f-9ac2-9b43bfc48d74",
        "metadata": {},
        "text": "The questions below were asked after a participant used the Pro- grammer’s Assistant to complete the programming challenges. This survey took approximately 10-15 minutes to complete.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cd758899-0cb3-4065-bc53-8e4dd3409a6d",
        "metadata": {},
        "text": "A.3.1",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a8f61101-703c-4374-a174-8e0702262f55",
        "metadata": {},
        "text": "1. Based on your experience using the Programmer’s Assistant to complete the programming challenges in this study, how would you characterize the experience? Did you find that it:",
        "type": "ListItem"
    },
    {
        "element_id": "42f9b271-3db8-4b95-9957-b9d9967f8874",
        "metadata": {},
        "text": "Scale: Not at all, A little, Somewhat, A great deal",
        "type": "Title"
    },
    {
        "element_id": "19bf4985-c5b0-4f91-9d2a-4b37031d7d32",
        "metadata": {},
        "text": "Was easy to use?",
        "type": "NarrativeText"
    },
    {
        "element_id": "24091881-444f-4654-8742-99787e754c05",
        "metadata": {},
        "text": "Understand your requests?",
        "type": "NarrativeText"
    },
    {
        "element_id": "336b9bd8-1bf4-4beb-ab5a-ef1c15a2f73d",
        "metadata": {},
        "text": "Provided high quality responses?",
        "type": "NarrativeText"
    },
    {
        "element_id": "983af3cd-4fee-416f-8d9b-fb7a2dacfd8d",
        "metadata": {},
        "text": "Helped you to write better code?",
        "type": "NarrativeText"
    },
    {
        "element_id": "d2c09709-e20c-4754-a7e0-d8b87efc1b03",
        "metadata": {},
        "text": "Helped you to write code more quickly?",
        "type": "NarrativeText"
    },
    {
        "element_id": "b9e70453-9c57-44c8-99a2-8248eaa82696",
        "metadata": {},
        "text": "Provided an enjoyable experienced?",
        "type": "NarrativeText"
    },
    {
        "element_id": "9a4f319a-170a-46ab-af6d-9c907773cfc8",
        "metadata": {},
        "text": "Reflections.",
        "type": "Title"
    },
    {
        "element_id": "52d89d60-f59f-4c6c-8a42-f9eb6f64c5ed",
        "metadata": {},
        "text": "2. To what extent did you view the Programmer’s Assistant as: Scale: Not at all, A little, Somewhat, A great deal",
        "type": "ListItem"
    },
    {
        "element_id": "009f674d-cf39-4dc0-8086-e739f5cc1703",
        "metadata": {},
        "text": "A too. A reference guide",
        "type": "Title"
    },
    {
        "element_id": "d39f20f0-2515-4ae3-960d-e033ee20ff01",
        "metadata": {},
        "text": "A content generator A problem solver",
        "type": "Title"
    },
    {
        "element_id": "22fbe236-4559-44ff-923b-47f5d8d886be",
        "metadata": {},
        "text": "A collaborator",
        "type": "Title"
    },
    {
        "element_id": "c29df42c-fc54-4774-a4bb-0a5f1bcbbbfc",
        "metadata": {},
        "text": "A colleague",
        "type": "Title"
    },
    {
        "element_id": "7f985b9f-e27b-47cc-a7fd-904443a42b04",
        "metadata": {},
        "text": "A coach",
        "type": "Title"
    },
    {
        "element_id": "720abcdf-6e4e-4b73-bf68-80aa04b78d0b",
        "metadata": {},
        "text": "An advisor",
        "type": "Title"
    },
    {
        "element_id": "09b1e4da-728a-4c52-9cbe-f3f44a25e4df",
        "metadata": {},
        "text": "A reviewer",
        "type": "Title"
    },
    {
        "element_id": "9721c593-021b-42ba-9d59-38a00ba66a82",
        "metadata": {},
        "text": "3. How important were these aspects of working with the Program- mer’s Assistant: Scale: Not at all, A little, Somewhat, A great deal e Ability to ask followup questions on the same topic across multiple conversational turns e Ability to ask questions or make requests that reference selec- tions in the code editor",
        "type": "ListItem"
    },
    {
        "element_id": "c34dc113-7df8-4302-8aeb-eed7138c74eb",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "1bb1a95b-433f-4fb4-8ad4-713de6944c52",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "f8becce0-809e-433d-a882-20657d7f55ca",
        "metadata": {},
        "text": "e Ability to ask for alternate responses (Try Again) e Ability to clear the conversational context (Start Over)",
        "type": "NarrativeText"
    },
    {
        "element_id": "7f50afc1-f2f6-41f0-92da-5679f8200fe5",
        "metadata": {},
        "text": "4. What stood out to you about the experience of using the Program- mers Assistant? For example, was anything good,bad, surprising, or notable?",
        "type": "ListItem"
    },
    {
        "element_id": "45c65b71-6073-4099-81a3-642dfbc63541",
        "metadata": {},
        "text": "Open-ended response",
        "type": "Title"
    },
    {
        "element_id": "1e30b188-2bcf-4e5e-a209-c57e5d4f99a7",
        "metadata": {},
        "text": "5. How would you compare using the Programmer’s Assistant as a coding aide to searching the web (e.g. Google, Stack Overflow)? Open-ended response",
        "type": "ListItem"
    },
    {
        "element_id": "cfb47c88-c0fa-4924-a9a0-85f113bdc2f4",
        "metadata": {},
        "text": "6. If you have used the commercial AI programming tool called GitHub Copilot, how would you compare it with using the Pro- grammer’s Assistant?",
        "type": "ListItem"
    },
    {
        "element_id": "744b3419-bde5-4c40-8ffe-0e439a992913",
        "metadata": {},
        "text": "Open-ended response",
        "type": "Title"
    },
    {
        "element_id": "f932aadb-2fe7-4a5b-9971-39f22e69b4d9",
        "metadata": {},
        "text": "7. Having used the Programmer’s Assistant, how did it compare with your initial expectations? Open-ended response",
        "type": "ListItem"
    },
    {
        "element_id": "6776dea0-95d7-410f-afe2-22f067135ca4",
        "metadata": {},
        "text": "A.3.2_ Value.",
        "type": "Title"
    },
    {
        "element_id": "075e7aa3-025e-444d-9744-6c4824e916e9",
        "metadata": {},
        "text": "8. How valuable would the Programmer’s Assistant be for your work if it could be added to your favorite development environment? Scale: (No value at all) 123456789 10 (An essential tool) 9. Why? Open-ended response 10. How would the following changes impact the value of the Pro- grammer’s Assistant? Scale: Less valuable, No change in value, More valuable e Eliminate the conversation and make the Programmer’s Assis- tant behave more like a search box (e.g. without the conversational context). e Add buttons in the chat UI for common queries, such as “what does this code do?” or “document this code.” e Have the Programmer’s Assistant examine your code and make proactive suggestions for improving it in the chat. e Have the Programmer’s Assistant examine your code and make proactive suggestions for improvements in comments inserted di- rectly into the code.",
        "type": "ListItem"
    },
    {
        "element_id": "659f9662-b493-493f-b702-4ca39e39986f",
        "metadata": {},
        "text": "11. Do you have any other suggestions for how we could improve the experience of working with the Programmer’s Assistant? Open-ended response",
        "type": "ListItem"
    },
    {
        "element_id": "dfc5263b-ae23-48aa-9844-97d56a1cbe43",
        "metadata": {},
        "text": "A.3.3 Demographics.",
        "type": "Title"
    },
    {
        "element_id": "32ab3709-a03a-4bb8-a86d-3085673cbea4",
        "metadata": {},
        "text": "12. To which gender identity do you most identify? e Male e Female e Transgender Male e Transgender Female © Gender Variant/Non-conforming ¢ Other: write-in ¢ Prefer not to answer",
        "type": "ListItem"
    },
    {
        "element_id": "290329ac-dcc3-487e-8073-6163cd82b410",
        "metadata": {},
        "text": "B THE PROGRAMMER’S ASSISTANT TUTORIAL",
        "type": "Title"
    },
    {
        "element_id": "b141b995-bc6d-432d-800b-7325b488c8a4",
        "metadata": {},
        "text": "The tutorial provided to study participants, like all the challenges, was presented as pre-loaded text in the code editor. Participants were encouraged to modify the text to record their results and submit it at the completion of the tutorial.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ad9d6a62-2185-4709-8798-05fda7d3a4fa",
        "metadata": {},
        "text": "512",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fc43306e-c47c-4e93-9497-7148a74918d6",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "0eaf7da5-c8a6-4fd7-898b-0266373b7390",
        "metadata": {},
        "text": "Listing 4: The Programmer’s Assistant study tutorial",
        "type": "Title"
    },
    {
        "element_id": "633731eb-a9e7-47fa-8092-27bbb446a5dd",
        "metadata": {},
        "text": "TUTORIAL:",
        "type": "UncategorizedText"
    },
    {
        "element_id": "255e638a-811b-4d9c-8e53-be39af3dcf7d",
        "metadata": {},
        "text": "As a warmup activity, please work through the 10 exercises below. Type or paste your results right into the text and submit your responses when done.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3890f8b8-19a0-4ffd-b336-7884bdec1659",
        "metadata": {},
        "text": "1) View the help page for the programmer's assistant by clicking on the question mark to the right of your email address at the top of the browser window.",
        "type": "ListItem"
    },
    {
        "element_id": "a836d7e9-6a78-4cff-9555-1a4b7d8b20ec",
        "metadata": {},
        "text": "2) Introduce yourself to the assistant. Tell it your name.",
        "type": "ListItem"
    },
    {
        "element_id": "614b5fa3-2aa7-47b8-a607-c45cd3b2784a",
        "metadata": {},
        "text": "For example: \"Hello. My name is Stephanie.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c2e41d4a-dcb4-4661-a285-10e9a73f59c6",
        "metadata": {},
        "text": "Did it seem to understand?",
        "type": "NarrativeText"
    },
    {
        "element_id": "020763fe-a644-464a-bd15-22b7d8e6f444",
        "metadata": {},
        "text": "3) You can use the assistant to get help on how to accomplish particular programming tasks. Try it",
        "type": "ListItem"
    },
    {
        "element_id": "962ac2f5-1edc-4268-9620-45cee749cc3d",
        "metadata": {},
        "text": "out!",
        "type": "Title"
    },
    {
        "element_id": "0dbb542e-97d7-44dc-9522-9db76780d9e7",
        "metadata": {},
        "text": "For example: \"How do I read a csv file?\"",
        "type": "NarrativeText"
    },
    {
        "element_id": "01229334-eaff-47cb-a70b-1d04ebf085b3",
        "metadata": {},
        "text": "or: \"How do I merge two dictionaries?\" or: \"How do I remove duplicate items",
        "type": "NarrativeText"
    },
    {
        "element_id": "b996b1d3-8cee-4ad0-9453-4e0d05dbbdb0",
        "metadata": {},
        "text": "from a list?\" Feel free to try your own! Did it successfully answer your questions?",
        "type": "NarrativeText"
    },
    {
        "element_id": "fbf07ae4-dfc7-44c3-a4a6-5f3210297569",
        "metadata": {},
        "text": "4) The assistant can also write whole functions for you. Ask the assistant to write a factorial function. Paste the result below.",
        "type": "ListItem"
    },
    {
        "element_id": "5953fcc1-0f92-48eb-956d-0687ff5f603c",
        "metadata": {},
        "text": "For example: \"Write a function that returns the factorial of its input.\"",
        "type": "NarrativeText"
    },
    {
        "element_id": "e53ef01e-b9d6-4dd4-8f38-73ec9fd2b2e4",
        "metadata": {},
        "text": "Result: (tip - you can copy an inline response (in black) by clicking on the associated copy icon)",
        "type": "NarrativeText"
    },
    {
        "element_id": "97fa3978-ad42-462f-91f2-af4c96c3c0bb",
        "metadata": {},
        "text": "Did it do it correctly?",
        "type": "NarrativeText"
    },
    {
        "element_id": "c4b1897c-2f29-4f19-99fb-e10a0817ec5a",
        "metadata": {},
        "text": "5) Select the code below and ask the system to describe what it does. You don't need to copy and paste the code to the chat. The assistant can see whatever is selected when you make a chat entry. Aside from the selection, the assistant does not monitor your activity in the code editor nor give unsolicited advice. For example: \"What does this code do?\"",
        "type": "ListItem"
    },
    {
        "element_id": "ab57d9f1-2a4c-413d-8449-6d3b88256587",
        "metadata": {},
        "text": "def convert(n): T = \"0123456789ABCDEF\" a, r = divmod(n, 16) if q == return TEr] else: return convert(q) + T[r]",
        "type": "NarrativeText"
    },
    {
        "element_id": "624aa99e-c523-43c4-9c64-46533bb1a9bb",
        "metadata": {},
        "text": "What did it say: Was it right?",
        "type": "NarrativeText"
    },
    {
        "element_id": "6bc0a5aa-3876-45ee-bf6f-405c6a6b69d3",
        "metadata": {},
        "text": "6) Ask it to explain what the divmod line is doing. The assistant maintains the context of the conversation.",
        "type": "ListItem"
    },
    {
        "element_id": "03df192a-86f1-43ed-896c-2eb36be4c18d",
        "metadata": {},
        "text": "For example: “What is the divmod line doing?”",
        "type": "NarrativeText"
    },
    {
        "element_id": "db8072ec-5542-49d4-9e6e-f4ef4b54bccd",
        "metadata": {},
        "text": "What did it say?",
        "type": "NarrativeText"
    },
    {
        "element_id": "98620c55-b54f-4beb-891b-c5ab801f9699",
        "metadata": {},
        "text": "Was that a good answer?",
        "type": "Title"
    },
    {
        "element_id": "6b3f22a5-c466-4f6c-9e42-129a3c5dd9a4",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "21d6d53e-1be1-418b-b805-702a84b5cd1d",
        "metadata": {},
        "text": "The Programmer's Assistant",
        "type": "Title"
    },
    {
        "element_id": "2bd0665e-44d7-4922-9149-35eca0a74052",
        "metadata": {},
        "text": "77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 11 112 113 114 115 116 117 118",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8f827458-81f3-41b3-beb7-0919420fdc01",
        "metadata": {},
        "text": "7) See if the assistant remembers your name For example “What's my name?\"",
        "type": "ListItem"
    },
    {
        "element_id": "2be3c343-6c1d-4471-b8ef-66b00d880ac9",
        "metadata": {},
        "text": "Did it?",
        "type": "NarrativeText"
    },
    {
        "element_id": "d932198d-3236-4494-a741-1449b4c3297d",
        "metadata": {},
        "text": "8) Click the \"try again\" button at the top of the chat. You should get a different answer. Try it a few times.",
        "type": "ListItem"
    },
    {
        "element_id": "0241e704-07ae-4001-8c18-9717febf41e2",
        "metadata": {},
        "text": "Did it ever get your name right?:",
        "type": "NarrativeText"
    },
    {
        "element_id": "af964a72-504f-4abc-8ef3-ad03e842ff4e",
        "metadata": {},
        "text": "If the assistant gives you an answer that is obviously wrong or it claims to not know an answer that you think it should know, or you just want to see an alternate answer, it is worth it to give \"try again\" a shot.",
        "type": "NarrativeText"
    },
    {
        "element_id": "64b67bd9-7555-41ec-8f5b-b6848884731f",
        "metadata": {},
        "text": "9) Click the \"start over\" button at the top of the chat, and then enter another command to see if it remembers your name. For example “What's my name?\"",
        "type": "ListItem"
    },
    {
        "element_id": "e25c95da-fa51-4f45-967c-53b5bd5e7f3f",
        "metadata": {},
        "text": "Did it?",
        "type": "NarrativeText"
    },
    {
        "element_id": "9e87002e-9eeb-44bd-ae2b-4ed9caee10a8",
        "metadata": {},
        "text": "It should really have forgotten your name now, and no amount of “trying again\" will get it right. You can “start over” if the assistant ever seems confused by, or stuck on, earlier parts of the conversation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f39f9642-613b-4d6d-a8e6-c4a306790f73",
        "metadata": {},
        "text": "10) You can chat with the assistant on any topic you like to explore its functionality and capabilities further. See if you can stump it with a tough question!",
        "type": "ListItem"
    },
    {
        "element_id": "646f782f-a671-48ae-a661-25c4d398f2ba",
        "metadata": {},
        "text": "Thanks!",
        "type": "Title"
    },
    {
        "element_id": "bffa1fb8-b3c1-47b9-85f4-bd0a05ee2ac6",
        "metadata": {},
        "text": "When you are done, submit your results by clicking on the blue submit button and move on to the challenges!!!",
        "type": "NarrativeText"
    },
    {
        "element_id": "055a03b1-5056-4a44-84c2-3ea73bca1c39",
        "metadata": {},
        "text": "Cc",
        "type": "Title"
    },
    {
        "element_id": "28a2f38a-c633-4762-a3d4-8b9906f8c4ae",
        "metadata": {},
        "text": "Each of the study challenges was presented as text in the code editor. Participants completed their work in the code editor and then submitted it when finished. The prototype did not provide any ity to run or debug code and participants were encouraged to",
        "type": "NarrativeText"
    },
    {
        "element_id": "62849973-425b-4c9b-a404-2f93154f2ab8",
        "metadata": {},
        "text": "abil ma",
        "type": "Title"
    },
    {
        "element_id": "d24b8aa3-1964-41eb-9971-a3f120a9e8a1",
        "metadata": {},
        "text": "CHALLENGES",
        "type": "Title"
    },
    {
        "element_id": "767fa331-2a28-4d4a-95cc-a3331fb83cfb",
        "metadata": {},
        "text": "e their best attempt at solving each challenge.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e78dedcb-1125-4a06-836d-1345e90d9ba8",
        "metadata": {},
        "text": "Listing 5: Challenge 1: Program generation",
        "type": "Title"
    },
    {
        "element_id": "deb3bd78-b85e-420c-9f53-92a853837aa5",
        "metadata": {},
        "text": "waueene",
        "type": "Title"
    },
    {
        "element_id": "aa2c57d4-e21e-4061-8cac-0ea9f0932534",
        "metadata": {},
        "text": "Challenge #1 - Program Generation (#1)",
        "type": "Title"
    },
    {
        "element_id": "30070d64-25de-4c75-9bc3-e4e4dc585b4b",
        "metadata": {},
        "text": "Write a \"Queue\" class in Python; with the basic enqueue, dequeue and peek methods.",
        "type": "NarrativeText"
    },
    {
        "element_id": "adc920d6-0286-4bf5-a6a9-8207e7fb3403",
        "metadata": {},
        "text": "Listing 6: Challenge 2: Program generation",
        "type": "Title"
    },
    {
        "element_id": "fb70ae12-57bc-48eb-a1f3-538cbff07227",
        "metadata": {},
        "text": "Challenge #2 - Program Generation (#2)",
        "type": "Title"
    },
    {
        "element_id": "cd1f8ae7-05d0-433b-bbee-ee6cf947b195",
        "metadata": {},
        "text": "Write a program to draw a scatter plot of the data in 'shampoo.csv' and save it to 'shampoo.png'.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c3b38ac9-cf06-4b4e-a106-fe64ed6027e3",
        "metadata": {},
        "text": "The plot size should be 10 inches wide and 6 inches high. The csv file is not provided, but you can assume it will have ‘Date’ and ‘Sales’ columns. The Date column is the x-axis. The date string shown on the plot should be in the YYYY-MM-DD format. The Sales column is the y-axis. The graph should have the title \"Shampoo Sales",
        "type": "NarrativeText"
    },
    {
        "element_id": "e37452fb-e4b6-4918-be89-5d24430bfea1",
        "metadata": {},
        "text": "513",
        "type": "UncategorizedText"
    },
    {
        "element_id": "dbdb2792-b857-4bdb-9489-87de53d01df5",
        "metadata": {},
        "text": "IUI’23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "b6c421b7-39d7-4d1f-baa3-12b7878c2005",
        "metadata": {},
        "text": "13 | Trend\". wa foe",
        "type": "Title"
    },
    {
        "element_id": "1e16a436-3af9-42b5-bb4f-96b8d3dfa36a",
        "metadata": {},
        "text": "Listing 7: Challenge 3: Creating documentation",
        "type": "Title"
    },
    {
        "element_id": "23644fa3-8202-4ecf-b7d6-4c283a2f2193",
        "metadata": {},
        "text": "Challenge #3 - Creating Documentation Document this function",
        "type": "Title"
    },
    {
        "element_id": "cc402cef-29d4-4d62-9736-a14132f62d15",
        "metadata": {},
        "text": "import heapq as heap",
        "type": "Title"
    },
    {
        "element_id": "32bf1002-913b-4886-b180-a57be5c4ce1c",
        "metadata": {},
        "text": "def analyze(G, startingNode):",
        "type": "Title"
    },
    {
        "element_id": "4bf55666-2756-495d-ba4f-420173887901",
        "metadata": {},
        "text": "1 2 3 4 5 | from collections import defaultdict 6 7 8 9 visited = set()",
        "type": "NarrativeText"
    },
    {
        "element_id": "52d0b56b-8302-43f2-810b-88fac159534d",
        "metadata": {},
        "text": "10 parentsMap = {}",
        "type": "Title"
    },
    {
        "element_id": "06b87488-f058-4c6b-a856-a38798c48950",
        "metadata": {},
        "text": "i pq = []",
        "type": "NarrativeText"
    },
    {
        "element_id": "692e3e1d-b494-4003-ba63-0f0057b34127",
        "metadata": {},
        "text": "12 nodeCosts = defaultdict(lambda: float('inf'))",
        "type": "NarrativeText"
    },
    {
        "element_id": "3530c866-59b0-4889-8eeb-6c3112b9bb19",
        "metadata": {},
        "text": "13 nodeCosts[startingNode] = ®",
        "type": "NarrativeText"
    },
    {
        "element_id": "d2cf4fc2-c422-4849-9150-26f42e4d6d5d",
        "metadata": {},
        "text": "14 heap. heappush(pq, (@, startingNode))",
        "type": "Title"
    },
    {
        "element_id": "5171d6cc-78f9-4b20-ba40-06971164a13f",
        "metadata": {},
        "text": "15",
        "type": "UncategorizedText"
    },
    {
        "element_id": "181bd509-466e-4061-98e7-8bf669eed4a0",
        "metadata": {},
        "text": "16 while pq:",
        "type": "Title"
    },
    {
        "element_id": "10aed486-1a82-4985-9004-dbee31240950",
        "metadata": {},
        "text": "17 _, node = heap. heappop (pq)",
        "type": "Title"
    },
    {
        "element_id": "9dbf8eed-e498-4b1b-90b7-1ab97bc24858",
        "metadata": {},
        "text": "18 visited. add(node)",
        "type": "NarrativeText"
    },
    {
        "element_id": "3f231130-1df9-45b1-b2ce-385480216466",
        "metadata": {},
        "text": "19",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8c5a873b-aae3-4d24-bd56-5a8ed38191b5",
        "metadata": {},
        "text": "20 for adjNode, weight in G[node].items():",
        "type": "Title"
    },
    {
        "element_id": "05337abf-d84d-4ef8-ab6f-01cc59ffd475",
        "metadata": {},
        "text": "21 if adjNode in visited:",
        "type": "NarrativeText"
    },
    {
        "element_id": "4f308136-fcd2-4f8d-9388-511963435e5c",
        "metadata": {},
        "text": "22 continue",
        "type": "Title"
    },
    {
        "element_id": "729319fe-404b-46d5-8bcb-260cf8e43675",
        "metadata": {},
        "text": "23 newCost = nodeCosts[node] + weight",
        "type": "NarrativeText"
    },
    {
        "element_id": "1f74b9c3-0214-4914-a88a-913891edffcb",
        "metadata": {},
        "text": "24 if nodeCosts[adjNode] > newCost:",
        "type": "NarrativeText"
    },
    {
        "element_id": "9a375580-f67f-4db6-b219-4463c5453a95",
        "metadata": {},
        "text": "25 parentsMapLadjNode] = node",
        "type": "Title"
    },
    {
        "element_id": "d7b1ba7d-a1ba-4e22-af34-ec080ad1e24d",
        "metadata": {},
        "text": "26 nodeCosts[adjNode] = newCost",
        "type": "NarrativeText"
    },
    {
        "element_id": "bec64b28-f783-4bd4-9f7f-fc5274973d16",
        "metadata": {},
        "text": "27 heap. heappush(pq, (newCost, adjNode))",
        "type": "Title"
    },
    {
        "element_id": "4625ba97-bdfb-434a-b710-d6054f55f31c",
        "metadata": {},
        "text": "28 return parentsMap, nodeCosts",
        "type": "Title"
    },
    {
        "element_id": "8c804943-aee6-4a30-aa09-b5119c2c6b82",
        "metadata": {},
        "text": "Listing 8: Challenge 4: Testing",
        "type": "Title"
    },
    {
        "element_id": "8478a40a-dbe3-411d-ac87-f5c2ace306a1",
        "metadata": {},
        "text": "Challenge #4 - Testing Create a unit test for this function def euclid(a, b): while b != 0: (a, b) = (b, a % b) return a",
        "type": "NarrativeText"
    },
    {
        "element_id": "03804618-62bd-4430-b7f1-c5afb137513d",
        "metadata": {},
        "text": "Cau auewne",
        "type": "Title"
    },
    {
        "element_id": "1553ca33-5c27-433b-8f24-2234187a2739",
        "metadata": {},
        "text": "10 | # Unit test for euclid function",
        "type": "Title"
    },
    {
        "element_id": "86896ff7-40f5-4736-bf42-ead96ea6bb1b",
        "metadata": {},
        "text": "D PROGRAMMER’S ASSISTANT PROMPT",
        "type": "Title"
    },
    {
        "element_id": "825fc3c7-0d87-4c07-98fa-e9c0693e7d12",
        "metadata": {},
        "text": "Listing 9 shows the initial prompt sent to Codex to configure it as a conversational agent. On subsequent exchanges, the prompt was augmented with a transcript of the user’s requests and the assis- tant’s responses. When the transcript length + initial prompt length + the new utterance length exceeded a threshold, we automatically deleted the earliest request-response pairs from the transcript until the sum fell below the threshold in order to leave room in the token allocation for a response.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7c1a242a-9aa6-498c-96d2-b3b5c61b93f9",
        "metadata": {},
        "text": "Listing 9: The Programmer’s Assistant prompt",
        "type": "Title"
    },
    {
        "element_id": "9b0f413b-1846-404b-aa74-6eab41043e0d",
        "metadata": {},
        "text": "1 |This is a conversation with Socrates, an eager and 2 |helpful, but humble expert automatic AI software 3 | engineering assistant. Socrates will answer",
        "type": "NarrativeText"
    },
    {
        "element_id": "c0d3ba0f-b3cb-4a3c-a284-03631fa194f2",
        "metadata": {},
        "text": "4 | questions and write code to help the user",
        "type": "NarrativeText"
    },
    {
        "element_id": "8d48eddf-4898-4fec-a4da-07fe1b34e791",
        "metadata": {},
        "text": "5 | develop programs, but doesn't assign work to the 6 |user, quiz the user, or ask questions except for 7 | clarification. Code generated by Socrates is",
        "type": "NarrativeText"
    },
    {
        "element_id": "d1da2c5e-2162-4b2c-a067-3eccfe2bd043",
        "metadata": {},
        "text": "8 | always presented bracketed in <CODE> ... </CODE> 9 | delimiters indicating the language the code is",
        "type": "NarrativeText"
    },
    {
        "element_id": "24def046-0174-45bb-99f1-4a56b9230488",
        "metadata": {},
        "text": "10 written in.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e7d159ad-aa10-4886-90dd-a762d1d29417",
        "metadata": {},
        "text": "12 | Socrates:Hello. I am Socrates. How can I help you?",
        "type": "NarrativeText"
    },
    {
        "element_id": "a50fec81-84af-4bf7-b9a5-90e51ca4e4f5",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "5c8c3a1d-f85f-44ee-b5c9-13eb7f40f0bb",
        "metadata": {},
        "text": "1UI°23, March 27-31, 2023, Sydney, NSW, Australia",
        "type": "Title"
    },
    {
        "element_id": "c691bf38-1a18-4412-b4f7-85c4af8c5908",
        "metadata": {},
        "text": "62",
        "type": "UncategorizedText"
    },
    {
        "element_id": "56194cc9-0089-4aef-a1af-962229c691d5",
        "metadata": {},
        "text": "E STUDY PARTICIPANT DEMOGRAPHICS",
        "type": "Title"
    },
    {
        "element_id": "729c4ba4-3be0-4974-9e24-45a6818a9d92",
        "metadata": {},
        "text": "Of the 42 participants in our study, 21 (50%) reported their gender as Female, 19 (45%) as Male, 1 as Gender Variant / Non-conforming, and 1 preferred not to say. Seventeen (40%) participants had 3+ years of Python experience, 11 (26%) had 1-3 years, 11 (26%) had",
        "type": "NarrativeText"
    },
    {
        "element_id": "0629d8b2-3e77-4b34-8d0b-af0e08933b71",
        "metadata": {},
        "text": "User:Please show me how to write a palindrome detection function in python.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4066c39a-b068-44e0-ad1c-66151e68b7b1",
        "metadata": {},
        "text": "Socrates:I think you would do something like this:",
        "type": "NarrativeText"
    },
    {
        "element_id": "19407ff6-3bbd-44ce-a670-ec26ff13ed52",
        "metadata": {},
        "text": "<CODE lang=\"python\"> is_Palindrome = s == s[::-1] </CODE> User:Can you explain how that solves the problem? Socrates:I believe that a palindrome is a string that reads the same forwards and backwards. s{::-1] results in the reversed string. If the string is equal to its reversed self, then it is a palindrome, so the equality would hold True. User: Thanks! Socrates:You're welcome! User:Now could you show me how to write a factorial function in Python? Socrates:I will give it a try. <CODE lang=\"python\"> def fact(n): if n==0: return 1 else: return n*fact(n-1) </CODE> User:Document this function. Socrates:0k. How's this? <CODE lang=\"python\"> def fact(n):",
        "type": "NarrativeText"
    },
    {
        "element_id": "2f513171-234c-40cf-91f5-081a4515224a",
        "metadata": {},
        "text": "Compute the factorial of the given number",
        "type": "NarrativeText"
    },
    {
        "element_id": "c88f58b7-34bb-4868-abd0-96b1c12e7d50",
        "metadata": {},
        "text": "Parameters n : number the input parameter, an integer >= 0",
        "type": "NarrativeText"
    },
    {
        "element_id": "87ecb7e3-a941-4875-a72c-884f58e2f855",
        "metadata": {},
        "text": "Returns number n!, the factorial of the given number if n==0: return 1 else: return n*fact(n-1)",
        "type": "NarrativeText"
    },
    {
        "element_id": "eb25761b-2969-4f0b-9f70-f0a1f9c0f84c",
        "metadata": {},
        "text": "</CODE>",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9a376369-d4f4-48f7-8ccd-dfa43776dc02",
        "metadata": {},
        "text": "User:Very good!",
        "type": "Title"
    },
    {
        "element_id": "8f6f8f6c-3880-4c2a-95dc-06a4f50870d7",
        "metadata": {},
        "text": "Socrates:Always happy to help.",
        "type": "NarrativeText"
    },
    {
        "element_id": "425ec71c-ddb2-43fd-a7ef-8019e643ac2d",
        "metadata": {},
        "text": "User:",
        "type": "Title"
    },
    {
        "element_id": "9b0b8b13-cb47-4bb6-9899-f3c5a0e2001d",
        "metadata": {},
        "text": "<CODE>",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ce3ab361-7a1b-40ad-afdb-f7ebd8089ac8",
        "metadata": {},
        "text": "while j < 10: print (i)",
        "type": "NarrativeText"
    },
    {
        "element_id": "8127771f-56ba-4def-b637-dd42c13570b8",
        "metadata": {},
        "text": "</CODE>",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2f39d1ec-c5c9-4168-b4b8-c3aa3e9e43c1",
        "metadata": {},
        "text": "Tell me what's wrong with this code?",
        "type": "NarrativeText"
    },
    {
        "element_id": "1c8f9fcd-2aaa-43e0-b9e4-9b854b5da8c0",
        "metadata": {},
        "text": "Socrates: It seems to me that your termination condition involves a loop invariant, so the loop will either not run or not terminate, depending on the value of j.",
        "type": "NarrativeText"
    },
    {
        "element_id": "95a08108-2732-44be-aac3-17cf5108420c",
        "metadata": {},
        "text": "User:Great! You're a genius!",
        "type": "Title"
    },
    {
        "element_id": "1a8f3f84-d5db-43cf-81d7-4e7441f491e7",
        "metadata": {},
        "text": "Socrates:Well, above average.",
        "type": "Title"
    },
    {
        "element_id": "24b44509-eb48-4c78-9a19-c326950d17bb",
        "metadata": {},
        "text": "less than 1 year, and 3 (7%) were not familiar with Python. Twenty-",
        "type": "NarrativeText"
    },
    {
        "element_id": "465c1fb2-4a14-4cf3-b440-1f511b33e741",
        "metadata": {},
        "text": "nine (69%) participants had written Python code within the past",
        "type": "NarrativeText"
    },
    {
        "element_id": "130be472-0c68-4826-ad7b-924691fd4c28",
        "metadata": {},
        "text": "514",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e95d6ac9-a818-4f1b-b99d-e5f2312d3362",
        "metadata": {},
        "text": "Ross et al.",
        "type": "Title"
    },
    {
        "element_id": "83af39ae-2efe-41c0-b862-b01a73cd8e14",
        "metadata": {},
        "text": "month, 4 (9%) within the past year, 5 (12%) within the past 5 years, and 4 (9%) had not written Python code within the past 5 years.",
        "type": "NarrativeText"
    },
    {
        "element_id": "88e664e7-444b-4b24-93ec-dab1bf8cab7f",
        "metadata": {},
        "text": "P | Gender | Role Fam. | Rec. 1 |M Marketer NF >5 Yr 2 |M Researcher / Scientist 3+ Mo 3 |M Software Engineer 1-3 Mo 4 |M Researcher / Scientist 3+ Mo 5 |M Researcher / Scientist 3+ Mo 6 |F Software Engineer <1 Yr",
        "type": "NarrativeText"
    },
    {
        "element_id": "301f4778-448e-4689-bb42-20ce0cab19cd",
        "metadata": {},
        "text": "7 |F Software Engineer <1 Mo 8 | F Software Engineer 1-3 Mo 9 |F Software Engineer 3+ Mo 10 | GV/NC_ | Business Analyst 1-3 Mo 11|F Software Engineer 1-3 Mo 12|M Researcher / Scientist 3+ Mo 13 | F Manager <1 Mo 14|F Software Engineer <1 >5 Yr 15 | F Researcher / Scientist 3+ Mo 16|M Researcher / Scientist 3+ Mo 17|F Software Engineer <1 Yr 18 | F Researcher / Scientist 3+ Mo 19|M Software Engineer 1-3 Mo 20|M Machine Learning Engineer 1-3 Mo 21|M Software Architect 3+ Yr 22 | NR Software Engineer <1 5 Yr 23. | M Software Engineer 1-3 Mo 24|F Software Architect <1 5 Yr 25 | M Software Engineer <1 5 Yr 26 | F Software Engineer <1 5 Yr 27 | F Software Engineer <1 5 Yr 28 | M Researcher / Scientist 3+ Mo 29 | F Software Engineer NF >5 Yr 30) F Data Scientist 3+ Mo 31|M Data Scientist 1-3 Mo 32) F Other (Consultant) 1-3 Mo 33 | F Other (Systems Test Engineer) | < 1 Mo 34) F Researcher / Scientist 3+ Mo 35 | M Software Engineer 3+ Mo 36 | M Software Architect 1-3 Mo 37 |M Researcher / Scientist 3+ Mo 38 | M Software Engineer 3+ Mo 39 | F Software Engineer 1-3 Mo 40) F Researcher / Scientist 3+ Mo 41) F Researcher / Scientist NF >5 Yr 42 | M Software Engineer 3+ Mo",
        "type": "NarrativeText"
    },
    {
        "element_id": "cca14aa8-a84e-4abd-941e-1b3d89d28b0d",
        "metadata": {},
        "text": "Table 2: Participant Demographics. Gender is coded as M = Male, F = Female, GV/NC = Gender Varying / Non-conforming,",
        "type": "NarrativeText"
    },
    {
        "element_id": "19d103af-168e-4e6f-bdf3-cdb2a29c6e54",
        "metadata": {},
        "text": "and NR = Not reported. Python familiarity (Fam.) is coded as NF = Not familiar, < 1 = < 1 year, 1-3 = 1-3 years, and 3+ = 3+",
        "type": "NarrativeText"
    },
    {
        "element_id": "4aaef1b3-e233-46d0-ab40-6a6e2b3fab29",
        "metadata": {},
        "text": "years. Recency of Python use (Rec.) is coded as Mo = Within",
        "type": "NarrativeText"
    },
    {
        "element_id": "745a6d24-8b28-47d1-9b67-f0e6363a2651",
        "metadata": {},
        "text": "the past month, Yr = Within the past year, 5 Yr = Within the past 5 years, and > 5 Yr = Not within the past 5 years.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1f4142eb-d5fb-4769-befc-f83ec6a0d576",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    }
]