[
    {
        "element_id": "a3211f0b-ea8f-4aa9-a936-8a424a7e9231",
        "metadata": {},
        "text": "Check for updates.",
        "type": "Title"
    },
    {
        "element_id": "8740461e-250b-42c9-9ed5-539b9d7e7b21",
        "metadata": {},
        "text": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "type": "Title"
    },
    {
        "element_id": "6c91ddaf-a633-4b50-a049-c3fb8d17a686",
        "metadata": {},
        "text": "Ed Wilson Junior* Universidade do Vale do Rio dos Sinos Sao Leopoldo, Rio Grande do Sul, Brazil edwjr7@edu.unisinos.br",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4fec20f2-26b6-4518-ba15-16393edb1656",
        "metadata": {},
        "text": "ABSTRACT",
        "type": "Title"
    },
    {
        "element_id": "308d4367-421a-41bd-8267-a461581bcb23",
        "metadata": {},
        "text": "Gamification has been adopted in software development tasks in recent years. This adoption seeks, for example, to improve the en- gagement of developers while creating UML models or writing code. Empirical studies report that UML models suffer from incom- pleteness and inconsistency problems. This study conjectures that gamification mechanics can improve learner engagement while learning software modeling, mitigating such problems concern- ing UML models. The current literature lacks studies that explore gamification and UML model quality in the context of software modeling learning. This article, therefore, proposes ModelGame, which is a quality model to support software modeling learning in a gamified way. It serves as a reference framework so that instructors can obtain a parameterized way to evaluate UML models created by learners. The quality of UML models can be improved by apply- ing gamified activities and providing guidelines aware of quality issues. A qualitative questionnaire was answered by 19 instructors who teach software modeling at higher education institutions. The results show that (1) 94.7% recognize that the proposed model can improve the quality of UML models, indicating that they would adopt the ModelGame in their learning practices; and (2) 47.4% do not use any gamification mechanics in their classes. The results are encouraging, showing the potential for applying and improving the teaching and learning of software modeling.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bd430a23-6138-465b-9366-92ba1dc37c01",
        "metadata": {},
        "text": "CCS CONCEPTS",
        "type": "Title"
    },
    {
        "element_id": "0ad4b074-fa3f-4f79-912c-9be806393a54",
        "metadata": {},
        "text": "+ Software and its engineering — Software design engineer- ing.",
        "type": "Title"
    },
    {
        "element_id": "d29cc4a9-900e-48ae-809c-78f7c17e2777",
        "metadata": {},
        "text": "KEYWORDS",
        "type": "Title"
    },
    {
        "element_id": "b080cd2a-92a0-4d16-ab49-5835973af111",
        "metadata": {},
        "text": "Model design, learning model, Gamification",
        "type": "NarrativeText"
    },
    {
        "element_id": "3430cc26-c26c-4028-9ca2-86b7c5bea41f",
        "metadata": {},
        "text": "ACM Reference Format:",
        "type": "Title"
    },
    {
        "element_id": "0001ce4d-2520-4d01-a8cd-06739e639115",
        "metadata": {},
        "text": "Ed Wilson Junior and Kleinner Farias. 2021. ModelGame: A Quality Model for Gamified Software Modeling Learning. In 15th Brazilian Symposium on Software Components, Architectures, and Reuse (SBCARS ’21), September 27-October 1, 2021, Joinville, Brazil. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3483899.3483910",
        "type": "NarrativeText"
    },
    {
        "element_id": "498abcb4-36a3-4186-8cec-c1c55e4496c5",
        "metadata": {},
        "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ce89a5ac-2c46-482b-bade-b9f803d7821f",
        "metadata": {},
        "text": "SBCARS 21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "6b5acbea-1b9a-4fb4-aa5e-7993a01a3c89",
        "metadata": {},
        "text": "© 2021 Association for Computing Machinery.",
        "type": "Title"
    },
    {
        "element_id": "bb8011dd-9f84-4cca-bac7-a5ef10721942",
        "metadata": {},
        "text": "ACM ISBN 978-1-4503-8419-3/21/09...$15.00 https://doi.org/10.1145/3483899.3483910",
        "type": "UncategorizedText"
    },
    {
        "element_id": "47fa731b-bb72-41a0-8404-6da004b63f7a",
        "metadata": {},
        "text": "100",
        "type": "UncategorizedText"
    },
    {
        "element_id": "649e113f-2f1a-472b-af90-c712112975fa",
        "metadata": {},
        "text": "Kleinner Farias Universidade do Vale do Rio dos Sinos Sao Leopoldo, Rio Grande do Sul, Brazil",
        "type": "UncategorizedText"
    },
    {
        "element_id": "20e1750a-be06-4979-b146-43bb77fa983b",
        "metadata": {},
        "text": "kleinnerfarias@unisinos.br",
        "type": "EmailAddress"
    },
    {
        "element_id": "615ee623-4b3a-4bc3-92ce-3c5c928e744c",
        "metadata": {},
        "text": "1 INTRODUCTION",
        "type": "Title"
    },
    {
        "element_id": "acdd3c37-667b-4d91-be73-2df94593c4bc",
        "metadata": {},
        "text": "Gamification has been adopted in software development tasks in recent years. This adoption seeks, for example, to improve the en- gagement of developers while creating UML models or writing code. Empirical studies [7, 9, 14] report that UML models suffer from incompleteness and inconsistency problems. Lange [14] rein- forces that these defects bring potential risks that can cause mis- interpretation and communication failure, representing a risk to software quality. Thus, finding formats that favor student learning and consequently in generating increasingly effective UML mod- els can become one of the main challenges faced by instructors that include UML (Unified Modeling Language) as part of software modeling content.",
        "type": "NarrativeText"
    },
    {
        "element_id": "43d338fc-3547-4517-872b-a7ba5a034d0d",
        "metadata": {},
        "text": "Some studies [3, 12, 25] sought to understand how to apply gam- ification in software modeling teaching using some elements such",
        "type": "NarrativeText"
    },
    {
        "element_id": "f9d11e38-bbac-49d9-9a21-daf8e3be04ad",
        "metadata": {},
        "text": "as points, emblems and levels. However, instructors and researchers still find limitations when applying, evaluating, and measuring the use of this tool in the learning of software modeling students and, consequently, in the models developed by them, since in the current literature there is no “frame of reference” that guides them. This",
        "type": "NarrativeText"
    },
    {
        "element_id": "245d8722-efdc-4d7e-a3fd-5c95b9a144ab",
        "metadata": {},
        "text": "study conjectures that gamification mechanics can improve learner engagement while learning software modeling, mitigating such problems concerning UML models. The current literature lacks studies that explore gamification and model quality in the context of software modeling learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7eba5ab3-1270-4b58-a8fb-6760dc548313",
        "metadata": {},
        "text": "This article, therefore, introduces ModelGame, which is a quality model to support software modeling learning in a gamified way. It serves as a reference framework so that instructors can obtain a parameterized way to evaluate UML models created by learners. The quality of UML models can be improved by applying gami- fied activities and providing guidelines aware of quality issues. A",
        "type": "NarrativeText"
    },
    {
        "element_id": "a92626ab-c889-4b34-8c9b-7020cea80a28",
        "metadata": {},
        "text": "reference framework would help to (1) establish parameters for eval- uating UML models created by learners; (2) provide guidelines to improve the quality of these artifacts; (3) to analyze which elements of gamification could be included in each of the phases of modeling using UML; (4) identify intrinsic and extrinsic aspects of students during the modeling stages, to improve the models; (5) to compare validated theories about the inclusion of gamification in software modeling teaching, taking into account the types of learning and methodologies used; and (6) contributing to the identification of gamification use objectives in modeling activities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "649153f5-88b9-4324-a5b4-c62217183535",
        "metadata": {},
        "text": "A qualitative questionnaire was answered by 19 instructors who teach software modeling at higher education institutions. The re- sults show that (1) 94.7% recognize that the proposed model can improve the quality of UML models, indicating that they would adopt it in their learning practices; and (2) 47.4% do not use any",
        "type": "NarrativeText"
    },
    {
        "element_id": "994f98ff-3643-4ea3-9560-479e0a03d231",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "31c822f5-ed13-4c0d-b90d-b561e68a7014",
        "metadata": {},
        "text": "SBCARS ’21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "5b415e92-626d-4590-b0d0-9763d7e647f7",
        "metadata": {},
        "text": "gamification mechanics in their classes. These results are encourag- ing, showing the potential for applying and improving the teaching and learning of software modeling.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d919aed-c227-4197-b2b8-702a49e86936",
        "metadata": {},
        "text": "The remainder of the paper is organized as follows. Section 2 presents the main concepts discussed throughout the article. Sec- tion 3 discusses the related work, highlighting research opportu- nities. Section 4 introduces the proposed quality model. Section 5 presents how the quality model was evaluated. Section 6 points out some threats to validity. Finally, Section 7 presents some concluding remarks and future work.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1cc9f66a-b9a9-4fcd-b61c-1db0729b0822",
        "metadata": {},
        "text": "2 BACKGROUND",
        "type": "Title"
    },
    {
        "element_id": "d5e9e0b9-ace7-4fab-b464-a37d1fc84f96",
        "metadata": {},
        "text": "This section presents the essential concepts for understanding this work, including gamification and software engineering teaching (Section 2.1), and software modeling and model quality (Section 2.2).",
        "type": "NarrativeText"
    },
    {
        "element_id": "309d7cb5-9217-401d-a611-6e3e61123403",
        "metadata": {},
        "text": "2.1 Gamification and Software Engineering Teaching",
        "type": "Title"
    },
    {
        "element_id": "48addc7b-1862-431f-b754-3da319254ef9",
        "metadata": {},
        "text": "Gamification aims to use game elements in the context of not game [5], bringing all positive aspects they provide as a way to encourage and engage “players,” thereby broadening their motivations.",
        "type": "NarrativeText"
    },
    {
        "element_id": "67f4eeed-2593-42f6-84ad-c46d02c8c8eb",
        "metadata": {},
        "text": "Werbach [23] classifies gamification into three dimensions: Dy- namics, Mechanics, and Components. Dynamicsinclude all game aspects related to the emotional responses of “players” (e.g., rela- tionship, progression, and narrative).Mechanics offer elements that promote the action of a game — usually elaborated via a rule-based development —, so that the player can interact with such elements, e.g., challenges, feedback, and rewards. Components represent the aesthetic elements of gamification, whose goal is to present visual aspects with which players can perform the interaction, for example, points, scores, and emblems (badges).",
        "type": "NarrativeText"
    },
    {
        "element_id": "a99e38d8-545d-4de3-9178-600ee11f4702",
        "metadata": {},
        "text": "Knowing that the teaching of Software Engineering should in- volve students to experience the professional practices of the area so that they can understand which practices and techniques are useful in several different situations [2]. The challenges of teaching new software engineers are not limited to learning programming, but also include paying attention to detail, considering the quality of created models, established schedule and defined budgets [1]. In addition to understanding the technical challenges, these future professionals must be up to date with nontechnical issues, including teamwork, communication and management.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4ea7dfc9-929b-4038-8064-23b152d58075",
        "metadata": {},
        "text": "To meet these new demands of the current context, the format with exhibition classes is no longer considered enough and may even become demotivating and ineffective in learning students. In this sense, gamification has been increasingly used in the teach- ing of software engineering as a way to promote behavioral and psychological changes [11] providing an environment that favors communication, cooperation, feedback, reward, achievement and other recurring elements that are capable of improving perfor- mance, efficiency and engagement in educational activities , and can enhance, for example, the learning of software modeling.",
        "type": "NarrativeText"
    },
    {
        "element_id": "73a49021-bea3-4815-97d7-1573434f1cfc",
        "metadata": {},
        "text": "2.2 Software Modeling and Model Quality",
        "type": "Title"
    },
    {
        "element_id": "4a3698c5-2049-4e14-9374-a43bcfecf1af",
        "metadata": {},
        "text": "Software modeling encompasses the set of principles, concepts, and practices that lead to the development of a high-quality system or",
        "type": "NarrativeText"
    },
    {
        "element_id": "3ff6cb9a-b9c9-43db-8633-8d9f34a6bec2",
        "metadata": {},
        "text": "101",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f2446d64-0e7f-4ab4-b46b-bec4cba4b0a4",
        "metadata": {},
        "text": "Ed Wilson Junior and Kleinner Farias",
        "type": "Title"
    },
    {
        "element_id": "79fcb144-612f-4afa-8c7c-9a58670e34a9",
        "metadata": {},
        "text": "product. The principles of this activity establish a philosophy that guides the entire software development process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4def1ce7-552c-41f9-9331-4351c95593aa",
        "metadata": {},
        "text": "In this scenario, UML models play a crucial role in software development tasks, for example, documenting project decisions, understanding development details, promoting better communica- tion between teams, and generating greater efficiency in software development [19]. However, these models suffer problems of in- consistency and incompleteness [10, 18], as well as end up being overlooked within the modeling process, as pointed out in some empirical studies in the literature [14, 15]. Class and sequence dia- grams, for example, present inconsistencies when sequence diagram objects are not found in the class diagram, consequently developers end up living with inconsistencies throughout the development process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "23240e99-54fb-4644-a032-9ec2db029054",
        "metadata": {},
        "text": "A research challenge still open is how to evaluate these diagrams, both in industry and in the teaching process, in terms of quality, such as syntactic and semantic, for example.",
        "type": "NarrativeText"
    },
    {
        "element_id": "db3abc3a-6b8d-4960-bab0-850f2b728e78",
        "metadata": {},
        "text": "3 RELATED WORK",
        "type": "Title"
    },
    {
        "element_id": "08c30938-5d4a-460d-be9c-c54f187b809e",
        "metadata": {},
        "text": "The selection of related works was carried out following two steps: (1) search in digital repositories, such as Google Scholar and Scopus (Elsevier) of articles related to gamification, quality modeling, and modeling learning; and (2) filter selected articles considering the alignment of such works with the objective of the work (Section 4). After selecting the works, they were analyzed (Section 3.1) and compared (Section 3.2), seeking to identify research opportunities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9e5410df-5cff-4e1c-8756-0d77786881d7",
        "metadata": {},
        "text": "3.1 Analysis of Related Works",
        "type": "Title"
    },
    {
        "element_id": "4fcd33fc-a982-42c0-ace9-d93f32cb250c",
        "metadata": {},
        "text": "Porto et al. (2021) [4]. This work performed a systematic map- ping with the objective of characterizing how gamification has been adopted in noneducational contexts of software engineering activities. The main results of this study show that gamification provided benefits for activities such as requirements specification, development, testing, project management, and support process. In addition, he pointed out that the number of publications and new research initiatives has increased over the years, many posi- tive results have been achieved in software engineering activities. Nevertheless, the study reinforced that gamification can still be explored for other tasks in this area, as empirical evidence is very limited.",
        "type": "NarrativeText"
    },
    {
        "element_id": "eed6e879-4685-449e-b758-3f27667db1d4",
        "metadata": {},
        "text": "Marin (2021) [17]. It performed the application of gamification on some topics of a software engineering course to engage students and increase their motivation and argued that, with due motiva- tion, students can better exercise the topics and obtain more solid knowledge. There were five games related to risk management, BPMN modeling, Scrum process, design and inspection of class diagrams, and cosmic functional size measurement to assist in the learning process of the software engineering course. This study also presented the lessons learned about the application of gamification and serious games in software engineering, including limitations or disadvantages.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0296a1f0-2ed4-4494-a311-9c4b8ce42bb3",
        "metadata": {},
        "text": "Jurgelaitis et al. (2018) [12]. This work conducted a research to investigate how gamification could be inserted into an Information Systems Modeling course, which covers a range of topics on UML. As a result, an implementation of the gamified system modeling course in the Moodle environment was presented, using additional",
        "type": "NarrativeText"
    },
    {
        "element_id": "7588ae95-f1dc-4d32-bd3c-c6c9e81295b9",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "9fa61f28-39dc-4ec4-b6b1-9a1f5439632c",
        "metadata": {},
        "text": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "type": "Title"
    },
    {
        "element_id": "b3ae766b-1317-4ffa-a649-b0fdaa6ac53f",
        "metadata": {},
        "text": "plugins for the use of the necessary gamified elements. The study showed good results and obtained a positive acceptance by the participating students.",
        "type": "NarrativeText"
    },
    {
        "element_id": "096219ed-f564-4349-a5dc-1049cd9c55fc",
        "metadata": {},
        "text": "Rodrigues et al. (2018) [22]. They investigated the use of games and game elements in software engineering education, through a research that had the participation of 88 instructors of this disci- pline. The results showed that most instructors are aware of these educational approaches, however, the games were adopted by only 21 participants and game elements were adopted only by 19. Games are most often used to cover “Software Process” and “Project Man- agement”. The most commonly used game elements are points, quizzes, and challenges. The results also show that the main rea- sons for not adopting the resources are the lack of knowledge, information about games relevant to the engineering of teaching software, and the lack of time to plan and include these approaches in the classroom.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e8e3e565-c3d7-4d8e-a285-50616f961552",
        "metadata": {},
        "text": "Cosentino et al. (2017) [3]. They present a model-based ap- proach to learning modeling in a gamified way. The approach in- cludes a new language to model the gamification process itself and an environment where it can be incorporated into current mod- eling tools to allow instructors and students to design and use a complete modeling framework, including gamification elements. In addition, the approach also had as a proposal to provide support to collect and analyze gamification data, thus facilitating monitoring activities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0284fb0e-95cf-48de-b5f6-85742c157e90",
        "metadata": {},
        "text": "Yohannis (2016) [25]. This research presents an exploration of game design as an approach to strengthening the student’s mas- tery in software modeling by developing their abstraction skills. It brought together concepts of gamification development, such as the lens of atoms of intrinsic skill and principles of pedagogical design of various theories and models of learning. The research follows the Design Science Research Methodology and explores the best practices of Model Oriented Engineering. As a result, a modeling game design framework and generation structure and a series of produced games are presented.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0ab095ae-c427-4864-b164-67651d859624",
        "metadata": {},
        "text": "Pedreira et al. (2015) [21]. They developed a systematic map- ping of gamification in Software Engineering based on 29 studies. The mapping revealed that software implementation is the area in which most studies focus, followed by software requirements, few others in different areas, such as project planning and software testing, and even to a lesser extent in activities involving software modeling. However, the highlight of this work was to highlight that gamification in software engineering is still at a very early stage and the evidence on its impact in this field remains inconclusive.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e82c5a31-89b0-46c6-a7fc-dd8ef2ddedb8",
        "metadata": {},
        "text": "3.2 Comparative Analysis and Opportunities",
        "type": "Title"
    },
    {
        "element_id": "c83c99cc-c494-4ee7-9fff-f81bf4b31fa4",
        "metadata": {},
        "text": "Five Comparison Criteria (CC) were defined selecting the most rele- vant variables to assist in the process of identifying similarities and differences between the proposed work and the selected articles. This comparison is crucial to make the process of identifying re- search opportunities using objective rather than subjective criteria. The criteria are described below:",
        "type": "NarrativeText"
    },
    {
        "element_id": "7fbcfa2a-f983-4874-a274-453c946825d9",
        "metadata": {},
        "text": "e Context (CC01): Works that explore the use of gamification in software modeling teaching/learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "56be2db1-d35a-4310-8c72-c3801fb4aaca",
        "metadata": {},
        "text": "¢ Participant profile (CC02): Studies that collected data from participants for screening and profile characterization.",
        "type": "NarrativeText"
    },
    {
        "element_id": "39b67afe-5414-4642-9688-0c277af10afe",
        "metadata": {},
        "text": "102",
        "type": "UncategorizedText"
    },
    {
        "element_id": "68181b74-2bc6-412e-b8c4-455661b77a97",
        "metadata": {},
        "text": "SBCARS °21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "4208c1f0-88a4-408c-8cec-539a35d4ec64",
        "metadata": {},
        "text": "e Applicability of Gamification in UML (CC03): Studies that evaluated how gamification can contribute to UML mod- els.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c7a5f7d9-1a89-45a2-bb83-bfa6db565977",
        "metadata": {},
        "text": "¢ Model creation (CC04): Studies that have developed a model to improve factors that imply the non-adoption of UML.",
        "type": "NarrativeText"
    },
    {
        "element_id": "72819ac8-f69e-4fd3-94f2-e75cae3af397",
        "metadata": {},
        "text": "e Instructor participation (CCO05): Studies that collected qualitative data through the participation of software mod- eling instructors.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8c72d660-6b55-47bc-a26f-70e356bf802f",
        "metadata": {},
        "text": "Table 1 shows the comparison of the selected works, confronting this work. Some gaps and research opportunities are observed: (1) only the proposed work was the only one to fully meet all compar- ison criteria; (2) although most of them targeted the application of gamification in software modeling teaching, they were not di- rected to the use of UML; (3) no study has developed a model to evaluate the learning and improvement of UML models developed by students; and (4) most of them did not have the participation of instructors to identify the difficulties and opportunities in the application of gamification in the teaching of software modeling. Thus, the next Section presents a quality model to explore these identified opportunities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c68baba3-e41a-4fc0-9800-6a75f75f7ac9",
        "metadata": {},
        "text": "Comparison Criterion",
        "type": "Title"
    },
    {
        "element_id": "851418c3-9b6c-4ab2-9ac6-f21731ed3264",
        "metadata": {},
        "text": "Related Work CCT] CC2 | CC3 | CC4 | CCS Proposed Work eleljele|le Porto et al (2021) [4] () () e [e) [e) Marin (2021) [17] eloyeleéfo Jurgelaitis et al 2018) [12] |_@ | oO |@ | @ | oO Rodrigues et al (2018)[22] | _@ | @ | © |.0 | © Cosentino etal 2017) [3] | @ |_O | @ | @ | Oo Yohannis (2016) [25] eLopelflefo Pedreira etal (2015) 21]_| 0 |.o | © |.O | ©",
        "type": "NarrativeText"
    },
    {
        "element_id": "054e65f0-bff5-45cb-ba5e-faf01273c656",
        "metadata": {},
        "text": "@ Completely Meets © Partially Meets © Does not attend Table 1: Comparative analysis of the selected related works",
        "type": "NarrativeText"
    },
    {
        "element_id": "cb302b91-0635-4798-b45e-6e70b32976f3",
        "metadata": {},
        "text": "4 PROPOSED QUALITY MODEL",
        "type": "Title"
    },
    {
        "element_id": "60c047d5-ee6a-4fc5-9978-83c7af0a804b",
        "metadata": {},
        "text": "This section presents the proposed quality model to support soft- ware modeling learning in a gamified way. It serves as a frame of reference so that instructors can evaluate the UML models cre- ated by students through gamified activities. Section 4.1 presents a proposal of a generic analytical framework. Section 4.2 details the abstract syntax of the proposed quality model. Section 4.3 ex- plains the quality notions related to the gamified software modeling learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bfc351c4-111c-4895-862c-550188861a69",
        "metadata": {},
        "text": "4.1 Generic Analytical Framework",
        "type": "Title"
    },
    {
        "element_id": "82a2a137-6205-4933-8569-58a6070f12c3",
        "metadata": {},
        "text": "Figure 1 presents the generic analytical framework for improving the quality of the models and serves as the basis for the creation of an evaluation scheme. The arrows (\"links\"), labeled as Evaluation and Gamified Modeling, represent the questions that the evidence must answer; dotted lines represent associations; rectangles rep- resent the Models (rounded corners) or the quality states (square corners) by which these bindings are measured. Ellipses represent the adverse effects that can be generated from the evaluation and use of gamification.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f2b9e44f-9b3a-4710-9fae-c1c0d8bed925",
        "metadata": {},
        "text": "The numbers refer to the key questions and are connected with the concepts and relationships of the abstract syntax of the Quality",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d413ff7-f8ef-44c1-aee9-919cef121cc0",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "dc229a62-7cb9-4861-afe0-b496574b0434",
        "metadata": {},
        "text": "SBCARS ’21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "8ba9236e-bdf6-42c5-9da8-80ff3ecb7873",
        "metadata": {},
        "text": "Ed Wilson Junior and Kleinner Farias",
        "type": "Title"
    },
    {
        "element_id": "18d8646a-d405-454b-81df-c00c4a25c842",
        "metadata": {},
        "text": "Gamified",
        "type": "Title"
    },
    {
        "element_id": "93f88d8d-c999-4677-bc09-57ec97327e41",
        "metadata": {},
        "text": "Evaluation Modeling",
        "type": "Title"
    },
    {
        "element_id": "00339e78-7958-4d42-8f3d-5c96e13a5788",
        "metadata": {},
        "text": "Models at Risk",
        "type": "Title"
    },
    {
        "element_id": "f5a020db-cd68-453f-930a-cadb8e3b6ffd",
        "metadata": {},
        "text": "Input models",
        "type": "Title"
    },
    {
        "element_id": "bebc5624-2438-47de-b590-f9c78fa10069",
        "metadata": {},
        "text": "Adverse effects of evaluation",
        "type": "Title"
    },
    {
        "element_id": "1be355bb-6e66-482b-9ab7-34a84836a2a3",
        "metadata": {},
        "text": "Adverse effects of gamification",
        "type": "Title"
    },
    {
        "element_id": "aa80244b-cb62-4509-9159-c7170c43fadf",
        "metadata": {},
        "text": "Output models Reduced poor quality of models",
        "type": "Title"
    },
    {
        "element_id": "a550b29d-5323-4f06-acc4-d24add3a8662",
        "metadata": {},
        "text": "Figure 1: Generic analytical framework for gamified software modeling learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "99c4dab9-8a93-449e-b120-760b3225f67d",
        "metadata": {},
        "text": "Model (presented in Section 4.2), as follows: (1) Are there tools that assist instructors in evaluating the models developed by stu- dents, thus reducing the poor quality and incompleteness of these artifacts? (2) What is the prevalence of characteristics that cause models to be at risk? (3) Are there notions of quality to evaluate the models as a way to define parameters when performing their correction? (4) Applying the use of gamification in models that need intervention would be a way to identify factors that could generate models with high quality levels? (5) Does the application of gamification improve the quality of the model? (5.a) How are the models without gamification evaluated in relation to those with gamification? (5.b) Are there reasons to expect that gamification models can have better quality results than those that are gener- ated without gamification? (6) Is the output model really effective when associated with reducing the poor quality of the model? (7) Does the absence of evaluation result in adverse effects? (7.a) is the evaluation acceptable for the model? (7.b) What are the potential harms, and how often do they occur? (8) Does gamification result in adverse effects on models?",
        "type": "NarrativeText"
    },
    {
        "element_id": "e96d57d6-bbf0-4c44-9308-f616cbd68437",
        "metadata": {},
        "text": "Fact is that it is not enough just to include this \"toolbox\" in the UML learning process, it is necessary to provide the instructor with a model (guide) that can serve as a reference to evaluate the quality of diagrams elaborated through gamified activities. For example, the instructor could create models predefining inconsistencies by making use of these questions raised to evaluate the models created by the students. The set of questions serves as the starting point for this evaluation. Knowing that the adaptation of the gamification approach requires a significant effort [20], in this study we present The ModelGame as a way to identify factors that contribute to the quality of these artifacts and, consequently, to the students’ learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b4aafd3f-beea-45fe-99b5-512e7de3a1cd",
        "metadata": {},
        "text": "4.2 Abstract Syntax",
        "type": "Title"
    },
    {
        "element_id": "93ca474f-e78b-4761-af2b-32469bc6f03d",
        "metadata": {},
        "text": "Following the specification pattern of the UML metamodel, Figure 2 presents the abstract syntax of the proposed Quality Model for gamified software modeling learning (ModelGame). It identifies the main concepts and relationships. The numbers represent the",
        "type": "NarrativeText"
    },
    {
        "element_id": "729f8d52-2037-4081-9b3c-9dc8a7f81477",
        "metadata": {},
        "text": "103",
        "type": "UncategorizedText"
    },
    {
        "element_id": "07cf0b3b-81de-45ed-b9e8-443c8f4c5047",
        "metadata": {},
        "text": "notions of quality that are discussed in Section 4.3. The following are detailed each of these concepts and relationships.",
        "type": "NarrativeText"
    },
    {
        "element_id": "51fffea3-b292-4909-8a97-8cc28de1b4c7",
        "metadata": {},
        "text": "Domain. The first concept presented in this study is the domain, which corresponds to a specific context of the application to be developed to solve the problem. In this process, the design template represents the solution given to the domain.",
        "type": "NarrativeText"
    },
    {
        "element_id": "837b8414-e1fb-40c7-bf52-76618c50babc",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "2153ebe0-061d-41a8-81f4-05c464366e2d",
        "metadata": {},
        "text": "e contextualizes: Challenges[*]",
        "type": "NarrativeText"
    },
    {
        "element_id": "8dd892b7-face-448f-a37e-167663abecae",
        "metadata": {},
        "text": "Each contextualise refers to the domain that will serve as the basis for the challenges launched.",
        "type": "NarrativeText"
    },
    {
        "element_id": "81f9d8eb-f406-47f9-83a2-86c4fe56a144",
        "metadata": {},
        "text": "Challenges. This concept represents the phase in which the problem is contextualized (domain-based), as well as what will be the missions, phases, scenarios, and other elements presented to the players, in this case the students, who must use the principles of software engineering to perform the modeling and reach the final goal.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ec2601a4-894c-4aa6-b5ac-9f10f0af750a",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "ddabff77-dc3b-4d87-b440-1ab33065b0be",
        "metadata": {},
        "text": "e influences: Design Model[*]",
        "type": "Title"
    },
    {
        "element_id": "841dcc66-36a9-46a6-aa40-7392860d473c",
        "metadata": {},
        "text": "Each influence represents that the proposed challenge interfered in aspects of the design model, causing the user to seek to make a continuous improvement.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5758401f-8e24-47c2-be89-4af827e81674",
        "metadata": {},
        "text": "Modeling Language. Software modeling is an important step for development to happen in a way that adheres to the require- ments established by the requester, for this, there is the modeling language, which offers a standardized way to document and design software. Through the use of modeling languages, it is possible to achieve a high level of understanding about the software in ques- tion, improving the communication between all those involved in the process, thus avoiding implementation errors. It points out that software engineers use these languages to communicate design decisions and verify the feasibility of implementing the intended design. The UML was consolidated as the Modeling Language in the paradigm of object orientation, in which it is possible through visual notation generated from the diagrams- presented later in this study as Design Models- to perform the representation of various perspectives of the system.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6ba16d33-d3a5-460a-a628-bd6218649346",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "b8fbff57-eb27-4cda-8730-13e32bf5b362",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "00721853-d3c5-4ea7-99cf-f1f62d76f9fa",
        "metadata": {},
        "text": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "type": "Title"
    },
    {
        "element_id": "0c6227ab-af54-46c1-be89-928f56f701d2",
        "metadata": {},
        "text": ";",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3af99582-ebff-4575-9862-cd82e3613f96",
        "metadata": {},
        "text": "Domain",
        "type": "Title"
    },
    {
        "element_id": "77abbe76-6904-4588-a942-f0927a8fcf63",
        "metadata": {},
        "text": "contextual",
        "type": "Title"
    },
    {
        "element_id": "202af23d-473f-49fa-839a-42dbf36b570e",
        "metadata": {},
        "text": "Challenges",
        "type": "Title"
    },
    {
        "element_id": "37b5412c-f19c-44e4-9244-74a470e20055",
        "metadata": {},
        "text": "zes",
        "type": "Title"
    },
    {
        "element_id": "896c2727-d971-47ce-8de5-9973ffa77c34",
        "metadata": {},
        "text": "“ influences",
        "type": "Title"
    },
    {
        "element_id": "ac3c539e-f5b8-4110-8e2d-66e01873ecd7",
        "metadata": {},
        "text": "Inconsistency",
        "type": "Title"
    },
    {
        "element_id": "5ab653cf-981a-4abb-a89d-c8c1db6cf1aa",
        "metadata": {},
        "text": "Modeling",
        "type": "Title"
    },
    {
        "element_id": "66ae560e-3b6c-4e42-ae92-ab9af41c8ed3",
        "metadata": {},
        "text": "Language",
        "type": "Title"
    },
    {
        "element_id": "fe300220-1910-48af-894f-893dfd51c1d5",
        "metadata": {},
        "text": "SBCARS °21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "3940391d-dbe0-41a3-916a-daa320b1e3c3",
        "metadata": {},
        "text": "@",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a7808e6c-ef02-4c55-b80e-c6b791a51c2c",
        "metadata": {},
        "text": "resolves",
        "type": "Title"
    },
    {
        "element_id": "d08b3e00-a86e-4da4-9f70-42456f46815a",
        "metadata": {},
        "text": "SE Tool",
        "type": "Title"
    },
    {
        "element_id": "3d3a872f-ac97-4818-b24c-6349773f17c2",
        "metadata": {},
        "text": "Figure 2: Abstract Quality Model Syntax.",
        "type": "Title"
    },
    {
        "element_id": "457f9872-1bae-4311-881d-dbcd38e91304",
        "metadata": {},
        "text": "e expresses: Design Model|[*] Performs the representation of the intended design templates, in which the Modeling Language should be applicable to the domain type.",
        "type": "NarrativeText"
    },
    {
        "element_id": "db2ba5e6-2005-4a73-a7c0-a8d3ab664e81",
        "metadata": {},
        "text": "User. This concept corresponds to the individual who performs the interpretation of the developed design models, whose objective is to be able to understand the domain in question. In the gamified context, the user has the role of player and it is he who performs the whole process, being able to perform the interpretation of ex- isting models or even creating new ones. The user can also identify and resolve inconsistencies that arise from compositions between models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "53d810b4-1eaa-44c6-9046-66a3358b56d3",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "5c2ef243-3cd0-45f9-87c6-6a5450a46a8e",
        "metadata": {},
        "text": "e creates: Design Model[1.*]",
        "type": "NarrativeText"
    },
    {
        "element_id": "acff24db-f045-4072-ae61-c31781a116a3",
        "metadata": {},
        "text": "Represents the process in which the user creates a design template, which can be one or more.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0af4878d-e7f9-467b-be62-0b4f070affef",
        "metadata": {},
        "text": "e interprets: Design Model[1.*] In this association, the user performs the interpretation of the design template. When interpreting the model, paths for the resolution of inconsistencies can be identified.",
        "type": "NarrativeText"
    },
    {
        "element_id": "72e00fd6-780a-4af6-8706-85c8b8d1a6b3",
        "metadata": {},
        "text": "e detects: Inconsistency [*] Represents the user’s discovery of design model inconsistencies, for example, those that are generated from identifying conflicts, whether a class is abstract or not.",
        "type": "NarrativeText"
    },
    {
        "element_id": "12519997-5b67-4fa0-9fbd-cc2be50b4025",
        "metadata": {},
        "text": "e resolves: Inconsistency [*] Each resolves equates to the resolution representation of the incon- sistencies by the user that happens after he analyzes and determines the best alternative to perform this action.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0f0016a6-5c11-4f00-84cf-99deacae804f",
        "metadata": {},
        "text": "e uses: Modeling Tools [*] Determines that the user can use modeling tools to generate/update design models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6aff7634-e3ec-47aa-8730-97e5e007f41f",
        "metadata": {},
        "text": "104",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6b9f7b3e-cda9-40eb-8c63-14a370160937",
        "metadata": {},
        "text": "Association e Without a directed relationship.",
        "type": "Title"
    },
    {
        "element_id": "d653199c-8bff-4708-8058-7cd8ba5edc85",
        "metadata": {},
        "text": "Modeling Tool. This concept represents the applications that are used to carry out the construction of design models. There are several tools available, online and desktop, and it is up to the user to choose the one that will best meet their needs and adapt to the context in question, that is, they work in any domain that is being considered.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7dd4951e-f9d7-49e7-a411-48a1239610a5",
        "metadata": {},
        "text": "Design Model. The design model refers to a visual notation (diagram) to represent static and dynamic aspects. These models are built according to a specific objective or task and tend to facilitate the logical interpretation of the software in several aspects. The most popular diagrams are Use Cases and Classes, the first being static and representing a set of actions generated from functional requirements (use cases) and presenting the interactions generated with external users (actors). The second is a static diagram and makes the representation of the logical structure of the software involving the classes, their attributes, methods, and relationships between them [19].",
        "type": "NarrativeText"
    },
    {
        "element_id": "97cac629-1c5e-453c-9168-7774e854612d",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "96c8c512-438c-4b1e-a24f-68b7799e81a7",
        "metadata": {},
        "text": "e describes: Domain[1]",
        "type": "NarrativeText"
    },
    {
        "element_id": "60473358-930b-44b3-bb79-4da6b5d97ee8",
        "metadata": {},
        "text": "Each describes makes the representation of a specific domain and means that every design model must describe it.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c6d77651-842e-43f2-aaa4-1fac97db9cd4",
        "metadata": {},
        "text": "Inconsistency. It corresponds to the defects found in the models developed by users. They may occur because of the nonidentifi- cation and correction of possible conflicts and even an erroneous interpretation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "96fbb67b-9e83-4dfa-bee1-ebd7cb730b77",
        "metadata": {},
        "text": "Association",
        "type": "Title"
    },
    {
        "element_id": "8cd46007-2514-4897-a07c-b362b9f8494a",
        "metadata": {},
        "text": "e affects: Design Model[*]",
        "type": "Title"
    },
    {
        "element_id": "892310ee-8bab-4055-8010-e4c074893d22",
        "metadata": {},
        "text": "This association indicates that with each occurrence of the affect, a problem is presented harming the quality of the design model.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e7966787-5ce5-48be-abad-8930e1e4bb18",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "891621e8-8d26-49ee-8153-0708cc121536",
        "metadata": {},
        "text": "SBCARS ’21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "e6773888-b8a8-4885-a37c-702487ed9444",
        "metadata": {},
        "text": "Points. This concept represents one of the most used game me- chanics in software engineering and functions as a quantitative reward for each action developed, in which it is possible to regulate the number of rewarded points of the player, defined here as user, based on the importance of each action. Through this concept, it is possible to stimulate competition, collaboration, and creativity among users, stimulating learning. Points appear as a derivation of the association affects, since when each inconsistency error is identified or not, the user will receive a score and the association describes, because the points will also be applied when making connections between the model and the domain.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cfe5b059-3ae8-49b0-b2b9-ec9bd0ab58b5",
        "metadata": {},
        "text": "Progress. The concept of progress emerges as a factor that makes the user able to perceive its evolution in the process, in this case, software modeling. Progress emerges as a derivation of the associa- tion interprets, making the user know when they have performed a correct interpretation of the proposed design model or what still needs to be improved.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3ba9b91f-4c71-4712-ac32-a21c5ffb2ebe",
        "metadata": {},
        "text": "Feedback. Feedback has the role of making the user realize that the proposed goal can be achieved and follow its evolution, includ- ing analyzing how to change or creating new strategies to achieve the goal. This concept emerges as a derivation between the associa- tions it creates, causing the user to receive a return to the model creation process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7ca99d8e-670f-4113-9071-109ebf210f48",
        "metadata": {},
        "text": "4.3 Quality Notions",
        "type": "Title"
    },
    {
        "element_id": "352f6ae9-5936-44a4-99ed-dcd7c8d70ca0",
        "metadata": {},
        "text": "As discussed in Section 2, gamification can bring important ele- ments for learning software modeling and, therefore, the objective of this section is to produce the notions of quality of the model of this study. The ModelGame is composed of ten counts, four of which are proposed in this study - scope, use, motivational and en- gagement - extracted from the main benefits that the gamification elements presented in Figure 2 can bring to the models. The others are adaptations of previous works [6, 14, 15], they are, syntactic, semantic, social, effort, detection and resolution.",
        "type": "NarrativeText"
    },
    {
        "element_id": "257783d2-aece-4266-98f4-9d53af821735",
        "metadata": {},
        "text": "Scope Quality (1). It seeks to determine how much the proposed challenge is contextualized with the design model, as well as the def- inition of the domain, problem, competencies, concepts, behaviors and attitudes that will be developed throughout the process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0fa5854f-6dd6-4b6f-9e53-c3203dcb2c52",
        "metadata": {},
        "text": "Syntactic Quality (2). This notion makes the representation of the process of correction of the design models that are produced by the modeling language, because if it is not used correctly, incon- sistencies will arise. It is important to insert this notion of quality into our study, since during the process of developing the models, users may come across the composition of two class diagrams, for example.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fd237f48-7380-45fa-bb0c-19c581a707da",
        "metadata": {},
        "text": "Semantic Quality (3). It is necessary to verify that the design model and the problem domain match, so this notion performs this type of analysis. Communication problems may occur between users if the semantic elements of the model are affected.",
        "type": "NarrativeText"
    },
    {
        "element_id": "48049576-abec-44ad-a58b-3ac291c17e79",
        "metadata": {},
        "text": "Social Quality (4). Design models are used to communicate between members of a team to inform all established decisions about software development [8]. If divergent interpretations occur, this communication will be greatly impaired.",
        "type": "NarrativeText"
    },
    {
        "element_id": "22cfb9a4-f491-4286-86d0-14f7167e3a34",
        "metadata": {},
        "text": "Quality of Effort (5). This notion refers to the production chal- lenges of the model that will be generated, including factors such as time and cost.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1ecadb0a-d5dd-4279-b866-45e9f558d399",
        "metadata": {},
        "text": "105",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8c06308e-2b1d-4804-b463-486563813704",
        "metadata": {},
        "text": "Ed Wilson Junior and Kleinner Farias",
        "type": "Title"
    },
    {
        "element_id": "d07833c6-c470-4d62-8d3a-4156d30e9102",
        "metadata": {},
        "text": "Quality of Use (6). To produce design templates, users can use unusual tools such as paper, whiteboard, and more. However, most of the time they choose to use formal tools (CASES) and can be online or desktop. This notion corresponds to the level of ease and applicability of the models elaborated when making use of these tools, it is also important to contribute to communication between users through collaboration-related functionalities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "310cdce8-9080-44f0-b36a-e9a1daeb19d2",
        "metadata": {},
        "text": "Detection Quality (7). This notion is referenced to the process of locating inconsistencies, since when users arise, they should perform traceability of them quickly. If the detection is complicated, it could hinder the process of correcting the models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8f7341e1-e355-4dad-aa4a-d120de728132",
        "metadata": {},
        "text": "Resolution Quality (8). It corresponds to the level of quality related to the effort that users take to look for alternatives to solve the identified problem.",
        "type": "NarrativeText"
    },
    {
        "element_id": "747e2d0d-bead-46bf-8304-1ae92bd664bd",
        "metadata": {},
        "text": "Motivational Quality (9). This notion refers to the motiva- tional factors involved during the learning and development of design models, which can be intrinsic and extrinsic. Elements of gamification such as points, feedback and progress bring the user a degree of satisfaction in continuing their discovery and transfor- mations throughout the process.",
        "type": "NarrativeText"
    },
    {
        "element_id": "51bd1e46-64a7-4b03-98ea-deab47110a54",
        "metadata": {},
        "text": "Quality of Engagement (10). The user in tracking their progress can feel committed to the objective in question, and this notion represents the measurement of the level of commitment of them during the development of design models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b3f6e8f5-df09-4cc8-a92c-96ce359c85fa",
        "metadata": {},
        "text": "5 EVALUATION",
        "type": "Title"
    },
    {
        "element_id": "bedb0cf8-c26f-4b2e-9209-e50844271506",
        "metadata": {},
        "text": "This section describes the methodology followed to evaluate the proposed quality model. This methodology follows well-established empirical guidelines [24]. Section 5.1 details the objective and re- search questions (RQ). Section 5.2 presents the questionnaire formu- lated to evaluate the proposed quality model. Section 5.3 explains the context and selection of participants. Section 5.4 describes the presentation of the Model. Section 5.5 presents the analysis of the collected data.",
        "type": "NarrativeText"
    },
    {
        "element_id": "18b596f1-4b73-4a40-a009-265a8224f31e",
        "metadata": {},
        "text": "5.1 Objective and Research Questions",
        "type": "Title"
    },
    {
        "element_id": "fa5d1d8a-293f-4c68-a681-44a6e5f4e951",
        "metadata": {},
        "text": "The objective (O) of this study is twofold: (01) Introduce Model- Game as a tool for teaching Software Modeling; and (02) Analyze the applicability of the quality model regarding the improvement of UML models. To analyze the different facets of the objectives, two Research Questions (RQ) have been formulated: e RQ1: How do instructors evaluate the use of gamification in software modeling? e RQ2: What is the acceptance of ModelGame by software modeling instructors?",
        "type": "NarrativeText"
    },
    {
        "element_id": "199699b1-5069-41e2-a0bd-06e7426782bb",
        "metadata": {},
        "text": "5.2 Questionnaire",
        "type": "Title"
    },
    {
        "element_id": "2ab1464c-63ad-475a-a347-7e5f93f7e19b",
        "metadata": {},
        "text": "Data was collected through an online questionnaire created through Google Forms! following well-established guidelines described in [24]. This strategy was chosen because the questionnaire could be applied quickly and easily collect data from individuals in geo- graphically diverse locations. The questions of the questionnaire",
        "type": "NarrativeText"
    },
    {
        "element_id": "e72dd88f-d643-4912-8bf6-5b8c4cb6c226",
        "metadata": {},
        "text": "‘Questionnaire: https://forms.gle/qjaFDpErEtGdLuww6",
        "type": "Title"
    },
    {
        "element_id": "62f4b476-32bd-4c50-9e00-4968d43a69f8",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "3bfa745c-4bc1-4c5a-92e6-ac2d56a36a12",
        "metadata": {},
        "text": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "type": "Title"
    },
    {
        "element_id": "abb6adbd-af88-4ef0-8dd1-1b799288089a",
        "metadata": {},
        "text": "were concerned with examining the research gaps of previous stud- ies and apprehending the structures of the previously developed questionnaire.",
        "type": "NarrativeText"
    },
    {
        "element_id": "dc19a3be-9d43-4048-b114-48bde10dfb69",
        "metadata": {},
        "text": "Part 1: Participant profile. The first part of the questionnaire consisted of collecting data that are related to the characteristics and opinions of the participants. The creation of the participant profile through this data is important to make the selection of possible users of ModelGame. Without this profile, participants with an inadequate profile may generate inconsistent assessments. Participants were asked to provide more general information, such as age, education level, academic background. Information about the time of experience in teaching was also considered, including teaching software modeling and level of knowledge about UML models.",
        "type": "NarrativeText"
    },
    {
        "element_id": "32cceb8a-ae43-4a83-be05-8488621e2ff2",
        "metadata": {},
        "text": "Part 2: TAM questionnaire. The second part addressed ques- tions about the usability and acceptance of the technique, aiming to explore q3. To this end, this part of our questionnaire is based on the technology acceptance model (TAM) [16]. This part contained nine questions, which were answered through the Likert Scale, in- cluding Totally Agree, Partially Agree, Neutral, Partially Disagree, and Totally Disagree. The questions formulated (Q) dealt with sev- eral topics, including perceived ease of use (Q1-3), perceived utility (Q4-7), attitude towards use (Q8), and behavioral intention to use",
        "type": "NarrativeText"
    },
    {
        "element_id": "b5de8482-68d8-4964-8b95-c7601a87bbcf",
        "metadata": {},
        "text": "(Q9).",
        "type": "UncategorizedText"
    },
    {
        "element_id": "002e736e-747a-4a42-be88-9b7341bcc79a",
        "metadata": {},
        "text": "5.3 Selection of participants",
        "type": "Title"
    },
    {
        "element_id": "e8fdf274-89b1-487b-89e2-377d05800490",
        "metadata": {},
        "text": "The participants were selected based on the following criteria: in- structors and/or professionals working in the teaching of software modeling in higher education institutions in Brazil. Using this cri- terion, we sought to select participants with academic training and practical experience in teaching. This finite set of all possible participants represents the target population [13]. This popula- tion represents those people who are in a position to answer the questions formulated and to whom the results of the survey apply [13]. In all, 19 people (n) answered the questionnaire. The partici- pants were invited via e-mail to participate in the study and each of them previously received the explanation/training about the model proposed through the researcher and there was no doubt, they could leave for the next step that consisted of completing the TAM questionnaire. We discussed the experimental process in the next section.",
        "type": "NarrativeText"
    },
    {
        "element_id": "05bfaf65-80ad-4b17-aefd-317bc11c6d1f",
        "metadata": {},
        "text": "5.4 Experimental Process",
        "type": "Title"
    },
    {
        "element_id": "c61de438-d8f0-4560-b0db-a6951fd9258c",
        "metadata": {},
        "text": "Figure 3 presents the experimental process used in this study, which is composed of three phases discussed below:",
        "type": "NarrativeText"
    },
    {
        "element_id": "16adf4e7-809a-415a-b13d-d5bfcec96903",
        "metadata": {},
        "text": "Phase 1: Presentation. It has an activity, presentation, in which the researcher explained to the participants through a video detail about the quality model. This process took place individually and in a standard way, where space was also made available for par- ticipants to answer possible doubts about the proposed study and model, lasting an average of 20 minutes.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2d030d00-9657-43b6-aaf3-f6d489968caa",
        "metadata": {},
        "text": "Phase 2: Application of the TAM questionnaire. It has two activities, the first being Collect demographic data. The participants answered a list of questions (input) so that we could collect their characteristics and opinions about the ModelGame. The demo- graphic data collected (output) became the result of this activity.",
        "type": "NarrativeText"
    },
    {
        "element_id": "70b30e28-88bc-4e2f-b163-39476b6f6f7c",
        "metadata": {},
        "text": "106",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3bd4fe41-7c6a-4042-9a07-36f5f109dfd3",
        "metadata": {},
        "text": "SBCARS °21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "da02d130-3322-4c13-aa40-283777107d72",
        "metadata": {},
        "text": "The second activity Apply TAM questionnaire (input). Participants received a list of questions about the perception of ease of use, per- ceived utility, attitudes, and intention of behavior, in relation to the ModelGame. Qualitative data (output) were generated, regarding the usability and acceptance of the Model under the perspective of professionals who teach software modeling. This questionnaire followed the guidelines of the TAM [16].",
        "type": "NarrativeText"
    },
    {
        "element_id": "7f8d8ec4-b869-4d26-9084-295b76f75c07",
        "metadata": {},
        "text": "Phase 3: Analysis and result report. It has two activities. The first, Analyze data sought to perform a thorough analysis of the data collected through the questionnaire and the researcher’s perception regarding the participants’ doubts during the presentation stage. For this, the collected data were analyzed separately, as well as con- fronted, aiming to perform a triangulation of them. Subsequently, there was an Evaluation data, as a way to understand in a more depth the context, the perceptions of the participants in relation to the proposed model as well as its applicability.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fed020f4-6040-4d1d-89e9-1622e61e5d28",
        "metadata": {},
        "text": "Phase 1 @ “| Presentation Phase 2",
        "type": "Title"
    },
    {
        "element_id": "2222fe97-8019-4536-be6d-7650273b8dae",
        "metadata": {},
        "text": "input.",
        "type": "Title"
    },
    {
        "element_id": "57f829ea-b891-4a8d-8820-9677ff798536",
        "metadata": {},
        "text": "“ output _>( Collect demographic oe = data List of questions List of TAM ====5\"{ Qualitative questions Apply TAM data ~ questionnaire }",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d228d5e-50a8-45fa-acae-79d309cfe683",
        "metadata": {},
        "text": "3a), a",
        "type": "UncategorizedText"
    },
    {
        "element_id": "eaa6fea5-3804-44e6-a01a-75569bda4d51",
        "metadata": {},
        "text": "Phase 3 a Study result wos.) Analyze data 2 © Evaluationdata | { Study report Legend: Activity 2) Data collected Artifacts used",
        "type": "NarrativeText"
    },
    {
        "element_id": "48d180dd-eb94-4312-bb37-e816394c1167",
        "metadata": {},
        "text": "Figure 3: The experimental process.",
        "type": "Title"
    },
    {
        "element_id": "177568f6-743c-4a44-b400-e545f91539c5",
        "metadata": {},
        "text": "5.5 Result Analysis",
        "type": "Title"
    },
    {
        "element_id": "69ada74c-8bec-45d5-9fa3-877019f12dc7",
        "metadata": {},
        "text": "5.5.1 Profile data of the participants. Table 3 describes the profile data, reporting the characteristics and opinions of the participants. These data were collected from May 18 to June 5, 2021. In total, we had 19 participants. Our participants are between 20 and 49 years old, most of them have a degree in Computer Science (52.6%), Information Systems (26.3%) or Systems Analysis (21.1%) and are specialists (36.8%), masters (36.8%) and doctors (15.8%). About the working time in teaching, the majority (42.1%) they have been teach- ing for more than 8 years and teach disciplines related to software modeling, including software engineering, systems analysis and software projects. A total of 47.4% have a full level of knowledge about UML and almost half of them (47.4%) has not yet used gamifi- cation in the teaching of software modeling. Therefore, we consider",
        "type": "NarrativeText"
    },
    {
        "element_id": "8c762e4e-ca49-4a77-b83c-8196234560d4",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "436a874b-eef5-4a2b-8b54-350e217abe29",
        "metadata": {},
        "text": "SBCARS ’21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "a5911e4b-f6b4-461e-8972-56a86f1146f3",
        "metadata": {},
        "text": "Ed Wilson Junior and Kleinner Farias",
        "type": "Title"
    },
    {
        "element_id": "1ca9055a-ffa9-4a2a-8a22-bd842b244b04",
        "metadata": {},
        "text": "Totally agree Partially agree Neutral Partially disagree __Totally disagree Perceived ease of use I found the quality model easy to use 8 9 2 0 0 I found the quality model eas 10 9 0 0 0 I found the quality model easy to master 6 12 0 1 0 Perceived usefulness The model would make it easier to understand which elements of gamification can be used in modeling 12 5 2 0 0 Using the quality model would help increase productivity. 9 8 2 0 0 ‘The model would provide an understanding of how to mitigate the incompleteness of UML diagrams. 5 8 5 1 0 ‘The model would help compare theories about gamification in software modeling teaching. 13 4 2 Attitude towards use Using the Quality Model for Gamified Software Modeling Learning is a good idea. 13, 5 1 0 0 Behavioral intention to use I would use the quality model in software modeling classes. 10 7 2 0 0",
        "type": "NarrativeText"
    },
    {
        "element_id": "f2f2a4fa-b6dc-43f3-aed5-1f7ede8df9e1",
        "metadata": {},
        "text": "Table 2: Collected data related to TAM questionnaire.",
        "type": "NarrativeText"
    },
    {
        "element_id": "13af5bba-9d79-4f1e-9807-b374a8ed1aa1",
        "metadata": {},
        "text": "that although small, our sample is adequate to carry out an initial evaluation of the proposed approach.",
        "type": "NarrativeText"
    },
    {
        "element_id": "de7d9fb7-7a3c-403b-bd28-1de26b27803a",
        "metadata": {},
        "text": "Characteristic and Opinion (n=19) Answer # % Age < 20 years 0 0.0% 20-29 years 4 211% 30-39 years 8 421% 40-49 years 5 26.3% > 49 years 2 10.5% Education Undergraduate” 0 0.0% Specialization” 7 36.8% Master* 7 36.8% PhD* 3 15.8% Others 2 10.6% Undergraduate course Information Systems 526.3% Computer Science 10 52.6% Computer Engineering 0 0.0% System Analysis 4 211% Others 0 0.0% Time of experience in teaching 4 211% 2 105% 5-6 years 3 15.8% 7-8 years 2 10.5% > 8 years 8 421% Experience in teaching < 2 years 3 15.8% software modeling 2-4 years 5 26.3% 3 15.8% 2 10.5% 6 316% Level of knowledge Beginner 2 105% about UML models Junior 5 26.3% Full 9 47am Senior 3 15.8% Used gamification in teaching Yes 9 47am No 9 47A% Maybe 1 5.3% Gamification can contribute to the quality Totally agree 10 52.6% of the models of UML diagrams generated Partially agree 8 421% by students Neutral 1 5.3% Partially disagree 0 0.0% Totally disagree 00.0%",
        "type": "NarrativeText"
    },
    {
        "element_id": "4ca94ddb-6ead-4d30-9255-cae9b8f02b44",
        "metadata": {},
        "text": "Table 3: The profile data of the participants.",
        "type": "Title"
    },
    {
        "element_id": "7e001b66-b855-4713-b5e3-1442834fa0f3",
        "metadata": {},
        "text": "5.5.2. RQI1: How do instructors evaluate the use of gamification in software modeling? Table 3 presents the collected data related to the RQ formulated. First, we begin the analysis by verifying how instructors visualize gamification in software modeling teaching. Although most of them (47.4%) have not yet used gamification",
        "type": "NarrativeText"
    },
    {
        "element_id": "4c7cc736-fd6c-49b8-8f08-0d1fd7f130a0",
        "metadata": {},
        "text": "107",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1f6df35b-8c2c-4271-ac6a-aa5f6d361ab8",
        "metadata": {},
        "text": "elements (scores, challenge, emblem, among others) in their classes, most (52.6%) totally agree and (42.1%) partially agree that the use of these can contribute to the quality of the models developed by the students.",
        "type": "NarrativeText"
    },
    {
        "element_id": "53163444-2423-40f3-8bb4-e4f2a9b2ebbd",
        "metadata": {},
        "text": "We consider the percentage of instructors who have not yet used gamification in their classes to be high and this may be tied to factors such as lack of knowledge, information about the tool, and even time to plan and include these approaches [22]. Although they were based on software modeling teaching context, previous studies [3, 4, 12, 17, 25] they did not count on the participation of instructors and we understand that this participation is fundamental to understand the perceptions of these professionals since they will be at the forefront of the use of gamification.",
        "type": "NarrativeText"
    },
    {
        "element_id": "111b6883-2e31-4591-ae2a-6f5cc158b664",
        "metadata": {},
        "text": "The ModelGame proposed in this study could help them insert gamification into their classes, according to the software modeling learning design [25], based on the assumption that for this, it is necessary to develop a better understanding of the tasks, activities, skills and operations that the different elements of gamification can offer and how they can correspond to the desired learning outcomes by developing a more concrete and motivating presentation that can involve students and facilitate deep learning with UML.",
        "type": "NarrativeText"
    },
    {
        "element_id": "94542c9e-7230-49ea-9844-31990831b7d2",
        "metadata": {},
        "text": "Summary of RQ1: The results show that (47.4%) of the participating teachers have not yet made the use of gamifi- cation elements, however, the majority (94.7%) agrees that",
        "type": "NarrativeText"
    },
    {
        "element_id": "4fd80f38-8a6b-4a84-855c-33785fc4c69f",
        "metadata": {},
        "text": "the use of these elements can contribute to the quality of the models developed by the students. These results indicate that ModelGame could help teachers to insert gamification into their classes.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6688a94d-5edb-4c0f-9107-77199041c03a",
        "metadata": {},
        "text": "5.5.3 RQ2: What is the acceptance of the ModelGame by software modeling instructors? Using the TAM questionnaire, we tried to evaluate the ease of use, perceived usefulness, attitude, and behav- ioral intention to use the Quality Model. Table 2 shows the data obtained. Our data obtained show that no one disagreed that the ModelGame is easy to use, learn, and master. On the contrary, al- most 90% of participants find the model easy to use (42.1% totally agree and 47.4% partially agrees and 10.5% neutral), learn (52.6%",
        "type": "NarrativeText"
    },
    {
        "element_id": "5f8dcb8d-7987-4a0b-8bf0-11f4ac9b7de3",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "ceb0df88-6d01-4c7b-a8bc-057f9fcf2974",
        "metadata": {},
        "text": "ModelGame: A Quality Model for Gamified Software Modeling Learning",
        "type": "Title"
    },
    {
        "element_id": "9c6b935b-ed72-41df-99d3-0aeb72e70691",
        "metadata": {},
        "text": "fully agree and 47.4% partially agree) and master (31.6% fully agree, 63.2% partially agree and 5.3% partially disagree).",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3cb93161-11b8-414f-9579-dc29c513d599",
        "metadata": {},
        "text": "The results are also favorable considering the perception of util- ity. Most participants realized that the ModelGame would make it easier to understand which elements of gamification can be used in each of the phases of modeling using UML(63.3% totally agree, 26.3% partially agree and 10.5% neutral), increase productivity (47.4% fully agree, 42.1% partially agree and 10.5% neutral), and the use of the quality model would provide an understanding of how to mitigate the incompleteness of UML diagrams (26.3% agree totalmen 42.1% partially agree, 26.3% neutral and 5.3% partially disagree). Still in the useful aspect, we tried to know if the quality model would help to compare validated theories about the inclusion of gamification in software modeling teaching (68.4% totally agree, 21.1% partially agree and 10.5% neutral).",
        "type": "NarrativeText"
    },
    {
        "element_id": "aa15efbd-cbcd-4dc7-87a6-204f0a0dff46",
        "metadata": {},
        "text": "Considering the attitude towards use, participants believe that using the ModelGame is a good idea (68.4% totally agree, 26.3% partially agree and 5.3% neutral), just as they are confident and would use the Model in software modeling classes (52.6% totally agree, 36.8% partially agree and 10.5% neutral). These findings show the potential for acceptance by people with profiles similar to those of participants. The results are encouraging and show the potential to use the proposed approach in the educational scenario.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1dce5c0a-a1dc-406d-a24a-7cd37c256e3f",
        "metadata": {},
        "text": "Summary of RQ2: The results are positive regarding the ease of use, perceived usefulness, attitude and behavioral",
        "type": "NarrativeText"
    },
    {
        "element_id": "fbb12467-f876-4a7f-921e-ae50c7c0ca06",
        "metadata": {},
        "text": "intention of using ModelGame by participating teachers and show its potential for use in the educational scenario.",
        "type": "NarrativeText"
    },
    {
        "element_id": "fb2269c7-1d85-443b-8d30-5bfcc3f28f1c",
        "metadata": {},
        "text": "6 THREATS TO VALIDITY",
        "type": "Title"
    },
    {
        "element_id": "a834be66-0dbc-4d8e-83d0-79637aa98826",
        "metadata": {},
        "text": "This section discusses the possible threats to the validity of the study.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f5e48b39-2a56-4c7a-8e99-a4ce600682f6",
        "metadata": {},
        "text": "Internal validity. The main point affecting the internal validity of our study concerns the total time used for the exploratory phase. To mitigate this threat, we performed the video recording of a pilot explaining the operating details and objectives of the ModelGame. In relation to the methods used, the threats related to internal validity relate to how we extract the perceptions of the discussions and whether they represent the perceptions of teachers about the use of the Model. We try to reduce this threat by applying the TAM questionnaire.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3d7ad179-85c2-4d67-8667-7fc4459ce070",
        "metadata": {},
        "text": "External validity. We identified threats related to external va- lidity, such as the number of participants who never applied the use of gamification. This study was limited to 19 participants (teachers) from various educational institutions, of which 9 (47.4%) never used any element of gamification in their classes, this factor can interfere in the data, since the model intends to evaluate the quality of UML diagrams from gamified activities.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5970e0b1-5db2-495c-b57c-6b129b0776c9",
        "metadata": {},
        "text": "Conclusion validity. Threats related to the validity of the con- clusion are related to treatment and outcome. We try to make the reduction by combining quantitative and qualitative data through different resources. These data were obtained through audio and questionnaires. We analyze this data to answer the research ques- tions.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f3336427-b3fb-4110-a3c6-4a1e5a8f132b",
        "metadata": {},
        "text": "108",
        "type": "UncategorizedText"
    },
    {
        "element_id": "846d13b0-e267-4a43-98aa-8ab9c7b3d8aa",
        "metadata": {},
        "text": "SBCARS °21, September 27-October 1, 2021, Joinville, Brazil",
        "type": "Title"
    },
    {
        "element_id": "79a8c10c-14ea-4608-b218-0b08a561a8c4",
        "metadata": {},
        "text": "7 CONCLUSIONS AND FUTURE WORK",
        "type": "Title"
    },
    {
        "element_id": "50e7af1f-1117-4887-a3d1-e2f589de67b4",
        "metadata": {},
        "text": "This study proposed an initial quality model (ModelGame) that serves as a reference framework for instructors for qualitative eval- uations of UML models developed from gamified activities, the application of an empirical study with 19 participants was carried out to understand their vision in relation to gamification and the acceptance of the proposed Model. It was identified that most have not yet used gamification in their classes, but agree that their use can contribute to the quality of the models developed by the stu- dents and were open to using the model. Our findings can enhance the adoption of new teaching practices through gamification, result- ing in the improvement of software modeling learning using UML, and consequently the creation of models developed by students. These approaches can stimulate students’ immersion in the design of systems as future professionals during learning.",
        "type": "NarrativeText"
    },
    {
        "element_id": "50ef74a3-6630-4137-ad48-ee88cbe49376",
        "metadata": {},
        "text": "Finally, we hope to carry out in the future a series of experimental studies to analyze each stage of application of the ModelGame and that this work represents a first step to better support the application of empirical studies on models of evaluation of the use of gamification in software modeling. We also hope that the questions described throughout the article will encourage other researchers to extend our study to different modeling languages and teaching methodologies.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3b0d3cb5-0cc7-418b-8d18-134e95a93a33",
        "metadata": {},
        "text": "REFERENCES",
        "type": "Title"
    },
    {
        "element_id": "3bee0f15-c03f-4585-8907-97bf707ded43",
        "metadata": {},
        "text": "1] Rick Adcock, Edward Alef, Bruce Amato, Mark Ardis, Larry Bernstein, Barry Boehm, Pierre Bourque, John Brackett, Murray Cantor, Lillian Cassel, et al. 2009. Curriculum guidelines for graduate degree programs in software engineering. ACM. 2] Mark Ardis, David Budgen, Gregory W Hislop, Jeff Offutt, Mark Sebern, and Willem Visser. 2015. SE 2014: Curriculum guidelines for undergraduate degree programs in software engineering. Computer 48, 11 (2015), 106-109.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d35c4500-c52b-4453-9a7e-413280353017",
        "metadata": {},
        "text": "3] Valerio Cosentino, Sébastien Gérard, and Jordi Cabot Sagrera. 2017. A model- based approach to gamify the learning of modeling. CEUR Workshop Proceed- ings.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5451c24d-1352-481b-bb28-8860b1d1d5b1",
        "metadata": {},
        "text": "4] Daniel de Paula Porto, Gabriela Martins de Jesus, Fabiano Cutigi Ferrari, and Sandra Camargo Pinto Ferraz Fabbri. 2021. Initiatives and challenges of using gamification in software engineering: A Systematic Mapping. Journal of Systems and Software 173 (2021), 110870.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c089957c-f923-489d-8fd2-ea4952674c70",
        "metadata": {},
        "text": "5] Sebastian Deterding, Miguel Sicart, Lennart Nacke, Kenton O’Hara, and Dan Dixon. 2011. Gamification. using game-design elements in non-gaming contexts. In CHI'11 extended abstracts on human factors in computing systems. 2425-2428. 6] Ana Fernandez-Saez et al. 2012. A systematic literature review on the quality of UML models. 7. Data. Manage 22, 3 (2012), 46-70.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8ea0a948-1784-4717-bbc9-90a077022a8b",
        "metadata": {},
        "text": "7) Kleinner Farias et al. 2012. Evaluating the impact of aspects on inconsistency detection effort: a controlled experiment. In International Conference on Model Driven Engineering Languages and Systems. Springer, 219-234.",
        "type": "ListItem"
    },
    {
        "element_id": "a2dbaf79-8251-4622-9a12-d32a953cfcd6",
        "metadata": {},
        "text": "8] Kleiner Frias et al. 2014. Towards a quality model for model composition effort. In 29th Annual ACM Symposium on Applied Computing. 1181-1183.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c4e3ea22-49de-4125-a9ef-bf1bdf13d06d",
        "metadata": {},
        "text": "9] Kleinner Farias et al. 2015. Evaluating the effort of composing design models: a controlled experiment. Software & Systems Modeling 14, 4 (2015), 1349-1365. Kleinner Farias et al. 2019. UML2Merge: a UML extension for model merging. IET Software 13, 6 (2019), 575-586.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7730a69e-3889-4f59-8953-038db948c171",
        "metadata": {},
        "text": "11] Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work?— a literature review of empirical studies on gamification. In 2014 47th Hawaii international conference on system sciences. leee, 3025-3034.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e6b2d3e6-9794-49b1-9272-07dad2654fe8",
        "metadata": {},
        "text": "Mantas Jurgelaitis, Vaidotas Drungilas, and Lina Ceponiené. 2018. Gamified Moodle course for teaching UML. Baltic journal of modern computing 6, 2 (2018), 119-127.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f5085a3b-ffa5-4f65-a6a2-4f82a18d25f7",
        "metadata": {},
        "text": "Barbara A Kitchenham and Shari L Pfleeger. 2008. Personal opinion surveys. In Guide to advanced empirical software engineering. Springer, 63-92.",
        "type": "NarrativeText"
    },
    {
        "element_id": "eeb59f38-5fc4-4726-87dd-bbf1ffcc1647",
        "metadata": {},
        "text": "Christian Franz Josef Lange. 2007. Assessing and Improving the Quality of Modeling: A series of Empirical Studies about the UML. (2007).",
        "type": "NarrativeText"
    },
    {
        "element_id": "eff46e6b-65e7-492a-9b5d-3aab4ff9ba7b",
        "metadata": {},
        "text": "Odd Ivar Lindland, Guttorm Sindre, and Arne Solvberg. 1994. Understanding quality in conceptual modeling. IEEE software 11, 2 (1994), 42-49.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1eb22f8d-efd2-4072-a198-bb62484aa19c",
        "metadata": {},
        "text": "Nikola Marangunié and Andrina Granié. 2015. Technology acceptance model: a literature review from 1986 to 2013. Universal access in the information society 14, 1 (2015), 81-95.",
        "type": "NarrativeText"
    },
    {
        "element_id": "194e3f9a-e8ff-4d93-9b3a-0e8eea7f15c8",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "6f524b17-289c-47a8-97b4-4ea85cf5dba1",
        "metadata": {},
        "text": "SBCARS ’21, September 27-October 1, 2021, Joinville, Brazil Ed Wilson Junior and Kleinner Farias",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3edde4f2-0b05-423f-8e04-adfe0ca9010b",
        "metadata": {},
        "text": "[17] Beatriz Marin. 2021. Lessons Learned About Gamification in Software Engineer- technology 57 (2015), 157-168. ing Education. In Latin American Women and Research Contributions to the IT [22] Pedro Rodrigues, Mauricio Souza, and Eduardo Figueiredo. 2018. Games and Field. IGI Global, 174-197. gamification in software engineering education: A survey with educators. In 2018 [18] Kleinner Oliveira, Alessandro Garcia, and Jon Whittle. 2008. On the quantitative IEEE Frontiers in Education Conference (FIE). IEEE, 1-9. assessment of class model compositions: An exploratory study. 1th ESMDE at [23] Kevin Werbach and Dan Hunter. 2012. For the win: How game thinking can MODELS (2008). revolutionize your business. Wharton digital press. [19] OMG. 2017. UML: Infrastructure _ specification. [24] Claes Wohlin, Per Runeson, Martin Hést, Magnus C Ohlsson, Bjorn Regnell, and https://www.omg.org/spec/UML/2.5.1/PDF. Anders Wesslén. 2012. Experimentation in software engineering. Springer Science [20] Sofia Ouhbi and Nuno Pombo. 2020. Software Engineering Education: Challenges & Business Media. and Perspectives. In IEEE Global Engineering Education Conference. 202-209. [25] Alfa Yohannis. 2016. Gamification of Software Modelling Learning. In DS@ [21] Oscar Pedreira, Félix Garcia, Nieves Brisaboa, and Mario Piattini. 2015. Gamifica- MODELS.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2aa24ed3-7795-4c19-bbc5-cd0e20abcdb4",
        "metadata": {},
        "text": "tion in software engineering-A systematic mapping. Information and software",
        "type": "NarrativeText"
    },
    {
        "element_id": "fa8da7dc-3508-4528-96a0-2c24453769f3",
        "metadata": {},
        "text": "109",
        "type": "UncategorizedText"
    },
    {
        "element_id": "2482c2d9-d8a0-47ad-8d8e-3fbf0cdccd14",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    }
]