[
    {
        "element_id": "5f0e5b0e-d221-4b92-93e6-330640010ec5",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "0687d0d1-3103-4f5b-9b16-4f6c52a35436",
        "metadata": {},
        "text": "Contents lists available at ScienceDirect",
        "type": "NarrativeText"
    },
    {
        "element_id": "30802993-4cd6-4605-a7df-3bfb10d598f9",
        "metadata": {},
        "text": "Advances in Engineering Software",
        "type": "Title"
    },
    {
        "element_id": "081664b2-c8f9-4fae-ba08-5787e592b566",
        "metadata": {},
        "text": "journal homepage: www.elsevier.com/locate/advengsoft",
        "type": "NarrativeText"
    },
    {
        "element_id": "8a296183-6419-4d9c-ba9e-f654e3ed2796",
        "metadata": {},
        "text": "Improved stochastic subset optimization method for structural design optimization",
        "type": "Title"
    },
    {
        "element_id": "7c8b1f39-379f-4adb-9900-f57fcbb4b64a",
        "metadata": {},
        "text": "Mohd Aman Khalid , Sahil Bansal *",
        "type": "Title"
    },
    {
        "element_id": "dbb862c5-1f7e-42e1-9f77-0c1b61a6f57d",
        "metadata": {},
        "text": "Department of Civil Engineering, Indian Institute of Technology Delhi, New Delhi 110016, India",
        "type": "NarrativeText"
    },
    {
        "element_id": "5c9d2e0f-dd10-4233-96f9-90d80d0ad889",
        "metadata": {},
        "text": "A R T I C L E I N F O",
        "type": "Title"
    },
    {
        "element_id": "134195df-cd8b-483b-a355-9f569985b066",
        "metadata": {},
        "text": "A B S T R A C T",
        "type": "Title"
    },
    {
        "element_id": "f190d1f7-bc9c-4deb-89f3-edc1d21b4da2",
        "metadata": {},
        "text": "Keywords:",
        "type": "Title"
    },
    {
        "element_id": "e9766b17-9e14-4ccd-bf9b-597031100ae9",
        "metadata": {},
        "text": "Keywords: Stochastic subset optimization Voronoi tessellation Stochastic simulation Stochastic optimization Optimization under uncertainty",
        "type": "NarrativeText"
    },
    {
        "element_id": "13cb26df-44a7-459b-a796-8b3fbf8f55b7",
        "metadata": {},
        "text": "The Stochastic Subset Optimization (SSO) algorithm was proposed for optimal reliability problems that mini- mizes the probability of system failure over the admissible space for the design parameters. It is based on the simulation of samples of the design parameters from an auxiliary Probability Density Function (PDF) and exploiting the information contained in these samples to identify subregions for the optimal design parameters within the original design space. This paper presents an improved version of SSO, named iSSO to overcome the shortcomings in the SSO. In the improved version, the Voronoi tessellation is implemented to partition the design space into non-overlapping subregions using the pool of samples distributed according to the auxiliary PDF. A double-sort approach is then used to identify the subregions for the optimal design. The iSSO is presented as a generalized design optimization approach primarily tailored for the stochastic structural systems but also adaptable to deterministic systems. Several optimization problems are considered to illustrate the effectiveness and efficiency of the proposed iSSO.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c6c82630-9b06-4e98-8e0a-0c88815d7540",
        "metadata": {},
        "text": "1. Introduction",
        "type": "Title"
    },
    {
        "element_id": "629cd575-8d70-4a47-8449-12013a7b4192",
        "metadata": {},
        "text": "1. Introduction",
        "type": "ListItem"
    },
    {
        "element_id": "bfde9451-ee58-492e-8324-352b2b9ecee7",
        "metadata": {},
        "text": "Structural optimization may be defined as the rational establishment of an economical structural design with the available resources while satisfying specific performance criteria. In general terms, the economy may be characterized by minimum weight, minimum cost, maximum utility, or even minimum probability of failure. Broadly, structural optimization can be categorized into deterministic and stochastic opti- mization [1,2]. The classical statement of unconstraint deterministic optimization is mathematically expressed as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "0b62fada-59ca-4c37-8853-99583e5ef981",
        "metadata": {},
        "text": "minimize : φ∈Φ",
        "type": "Title"
    },
    {
        "element_id": "9a93dc08-331e-410b-a707-b9a03112b393",
        "metadata": {},
        "text": "g(φ)",
        "type": "Formula"
    },
    {
        "element_id": "59bca2d6-c885-4c39-ab7c-f6a2ccbf2c58",
        "metadata": {},
        "text": "]T ∈ Φ⊂Rnφ is a set of deterministic adjustable pa- where, φ = [φ1⋯φnφ rameters that define the structural design, referred to herein as design parameters, g(φ) : Rnφ →R is the objective function to be minimized, and Φ denotes the bounded admissible design space. The deterministic constraints can be considered by the appropriate definition of the ad- missible design space Φ for deterministic design parameters φ, as mentioned in [3]. In the deterministic structural optimization problem, the uncertainties in parameters are ignored, and fixed values are assumed for all the parameters. There are numerous optimizations",
        "type": "NarrativeText"
    },
    {
        "element_id": "b63de8e1-8426-43c7-94c4-b57036a8373b",
        "metadata": {},
        "text": "(1)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0b40ef64-cd86-4314-bb7c-cf5780509c69",
        "metadata": {},
        "text": "approaches available in the literature, however, but it’s worth noting that no one-size-fits-all optimization approach is ideal for all sorts of problems [4–7]. The choice of optimization method is often determined by the specific characteristics of the problem, such as its complexity, dimensionality, constraints, and the nature of the objective function. As a result, there is always a scope for new approaches to be developed or the adaptation of existing methods to better suit specific problem clas- ses. A detailed discussion of deterministic optimization approaches can be found in the literature [8,9].",
        "type": "NarrativeText"
    },
    {
        "element_id": "47a10da4-32ad-42f7-8920-85c90905be8c",
        "metadata": {},
        "text": "In any practical situation, several parameters, such as loadings, structural parameters, geometric parameters, operation conditions, etc., are either not known at the design stage or are subjected to random fluctuations that give rise to performance variability and affect the performance of a system [10]. These parameters are characterized as uncertain parameters. Deterministic structural optimization discards the impact of uncertainty and can result in improper design. Therefore, it is desirable to account for the uncertainty in the parameters during opti- mization by using the rational methods of probabilistic structural analysis [11]. Such structural optimization that accounts for un- certainties is called stochastic optimization [12]. Although stochastic optimization refers to any method that employs randomness within some communities, in this paper, we will only consider settings where",
        "type": "NarrativeText"
    },
    {
        "element_id": "19344afa-b501-4af9-8a23-b3ea669ffdc6",
        "metadata": {},
        "text": "* Corresponding author.",
        "type": "ListItem"
    },
    {
        "element_id": "2381e81b-660b-437a-a257-c9f9aa5e207c",
        "metadata": {},
        "text": "Corresponding author.",
        "type": "ListItem"
    },
    {
        "element_id": "b459340f-eb9d-4490-b147-1316b5fc1b85",
        "metadata": {},
        "text": "E-mail addresses: mohdamankhalid@gmail.com (M.A. Khalid), sahil@iitd.ac.in (S. Bansal).",
        "type": "NarrativeText"
    },
    {
        "element_id": "8eaf02b2-a0c2-45a2-925e-763cd2ca1f68",
        "metadata": {},
        "text": "E-mail addresses: mohdamankhalid@gmail.com (M.A. Khalid), sahil@iitd.ac.in (S. Bansal).",
        "type": "NarrativeText"
    },
    {
        "element_id": "6f6b1631-6d3f-454b-9986-37933d6aaf42",
        "metadata": {},
        "text": "https: //doi.org/10.1016/j.advengsoft.2023.103568",
        "type": "Title"
    },
    {
        "element_id": "20f77ffd-a52b-4859-adff-13e387bb37b1",
        "metadata": {},
        "text": "https://doi.org/10.1016/j.advengsoft.2023.103568 Received 5 June 2023; Received in revised form 2 October 2023; Accepted 24 November 2023",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3c3985cf-b334-40ce-ab81-410461a147bd",
        "metadata": {},
        "text": "5 June 2023; Received in revised form 2 October 2023; Accepted 24 November online 12 December 2023",
        "type": "NarrativeText"
    },
    {
        "element_id": "61c6bb51-d6df-4fcd-bfa9-e98e3b76a577",
        "metadata": {},
        "text": "Available",
        "type": "Title"
    },
    {
        "element_id": "1cada2a3-c5b7-4067-97f8-5fe5fe241edd",
        "metadata": {},
        "text": "0965-9978/© 2023 Published by Elsevier Ltd.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a9070614-8ef6-419d-9566-c5c122c3a737",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "88a079a4-b1c3-4bd9-b45f-f8780d907bd2",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "cd0d0593-7268-4283-9094-0b75776e7f7c",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "1d65a17b-c98d-4cf5-b7eb-b78d585d83ce",
        "metadata": {},
        "text": "the objective function is random. Stochastic optimization or optimal design under uncertainty has been widely applied in many practical engineering fields, including civil engineering structures [13–15], composite structures [16,17], and vehicles [18,19].",
        "type": "NarrativeText"
    },
    {
        "element_id": "aed3d290-1304-4128-8610-057d0ba7894e",
        "metadata": {},
        "text": "Consider an engineering system that involves deterministic design parameters φ, and uncertain variables θ = [θ1⋯θnθ ]T ∈ Θ⊂Rnθ following a joint PDF p(θ|φ), where Θ denotes the parameter space of the uncer- tain variables. The classical statement of stochastic optimization is mathematically expressed as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "4a1d8e0c-8c91-4fc5-b66a-29020c19462e",
        "metadata": {},
        "text": "minimize : φ∈Φ",
        "type": "Title"
    },
    {
        "element_id": "38072ac0-5bbd-4f24-aa54-53398fbc282a",
        "metadata": {},
        "text": "Eθ[h(φ, θ)]",
        "type": "Formula"
    },
    {
        "element_id": "bdc1bd5c-1afc-48cd-95b4-08dc030117f3",
        "metadata": {},
        "text": "(2)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3f881d8a-8c60-4787-a34c-597e45baf1a2",
        "metadata": {},
        "text": "various challenging optimization problems, it has two shortcomings. First, the effectiveness of SSO is dependent on the correct selection of the geometrical shape of the admissible subsets. Here, it is pertinent to mention that choosing a geometrical shape that effectively investigates the sensitivity of the objective function to each design variable is essential. The shapes, such as hyper-rectangle and hyper-ellipse are suggested in the literature for the admissible subsets. However, as shown later via the illustrative example, these shapes fail to include the optimal solution in cases with complex design spaces or problems with multiple optimal solutions. And second, identifying the optimal subset that con- tains the smallest volume density involves a non-smooth optimization problem which is quite challenging.",
        "type": "NarrativeText"
    },
    {
        "element_id": "124d9ddd-6048-4be1-b7ee-cbcb32dda4b1",
        "metadata": {},
        "text": "where, h(φ, θ) : Rnθ +nφ →R is the structural performance function, and Eθ[ ⋅ ] denotes expectation with respect to the PDF for θ. Note that the objective function in the optimization problem in (2) is the expectation Eθ[h(φ, θ)] which is a deterministic function. It’s worth mentioning that stochastic optimization may also involve other stochastic measures such as variance or quantile values. However, these stochastic measures can rarely be evaluated analytically; therefore, several methods have been proposed for solving stochastic optimization problems. These special- ized methods include, for example, sample average approximation, stochastic approximation, stochastic subset optimization, and ap- proaches based on the use of Taylor series expansion [15,20,21], response surface, and metamodels [22–25]. Specific to structural engi- neering, there are two broad categories of problems involving design optimization under uncertainty [26–35]: Reliability-Based Design Optimization (RBDO) and Robust Design Optimization (RDO). The objective of RBDO is to find an optimal solution that minimizes some deterministic, objective function under observance of probabilistic constraints instead of conventional deterministic constraints [36,37]. On the other hand, RDO aims to find an optimal solution that is insen- sitive (or less sensitive) to input variations. It improves the design quality by minimizing performance variation without eliminating un- certainty [29,38].",
        "type": "NarrativeText"
    },
    {
        "element_id": "239cb2bf-0041-4c56-91a2-88cac5315d6b",
        "metadata": {},
        "text": "Taflanidis and Beck [39] introduced a novel algorithm for optimal reliability problem, the so-called SSO. SSO involves formulating an augmented problem where the design parameters are artificially considered uncertain and defining an auxiliary PDF that includes the structural performance function and the PDF of the uncertain variables. Next, SSO involves generating a pool of samples distributed according to this auxiliary PDF and identifying a subregion in the original design space, which, on average, improves the value of the objective function. By repeating this procedure several times, it is possible to determine at each step a smaller subregion in the design space, which in turn im- proves the value of the objective function. Ultimately, this subregion will be sufficiently small to directly identify the optimal solution or provide sufficient information to launch another optimization algo- rithm, such as the sample average approximation or stochastic approx- imation. The implementation of the SSO method closely resembles the Subset Simulation (SS) algorithm [40] for reliability analysis. Since SSO is based on simulation, it can deal with linear or nonlinear problems and, at least theoretically, an unbounded number of design parameters. The numerical effort for solving a given optimization problem is indepen- dent of the number of uncertain variables, and it grows linearly with the number of design parameters.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3ecf1290-b496-4cea-a2b3-4fb00f9b7c0c",
        "metadata": {},
        "text": "Since the introduction of SSO, several extensions of SSO have been proposed. An extension of SSO termed Non-Parametric SSO, which adopts kernel density estimation to approximate the objective function, is presented in [41]. In [42], efficient integration of the Moving Least Squares approximation within SSO is introduced to reduce the compu- tational effort in SSO. In [3], an augmented formulation is presented for the RDO of structures using SSO. SSO or its variants have also been applied to solve structural optimization problems. SSO has been used for reliability optimization and sensitivity analysis in system design in [39]. A framework for RDO of Tuned Mass Dampers (TMD) by SSO is dis- cussed in [43]. Even though SSO has proved to be efficient for meeting",
        "type": "NarrativeText"
    },
    {
        "element_id": "88a676ea-1ff4-470f-b912-704dc533dc89",
        "metadata": {},
        "text": "In this paper, an improved version of SSO is developed to overcome the shortcomings of the original SSO. This new version of the algorithm, as mentioned earlier, is named iSSO (improved SSO). Voronoi tessella- tion is implemented to partition the design space into non-overlapping subregions (a set of Voronoi cells) using the pool of samples distrib- uted according to the auxiliary PDF. The admissible set (a set of all admissible subregions) is then defined as a set containing all subsets of the set of Voronoi cells. This approach is able to capture the regions with lower objective function values even if they are disjointed or when the design space is complex. The details of the Voronoi tessellation are presented in Appendix A. A double-sort algorithm is then implemented to identify the optimal subset containing the smallest volume density.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bc429eac-25b4-47ee-93d5-cb1bf8a88754",
        "metadata": {},
        "text": "In the next section, the original SSO is reviewed. Section 3 presents the general theoretical and computational framework for the iSSO al- gorithm. Section 4 considers several optimization problems to illustrate the effectiveness and efficiency of the proposed iSSO algorithm.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3c53eaa4-7fa2-4c91-bb1b-17d8c708c1b2",
        "metadata": {},
        "text": "2. Original stochastic subset optimization",
        "type": "ListItem"
    },
    {
        "element_id": "48299814-20ae-49bb-b5d0-0246d8912ad1",
        "metadata": {},
        "text": "In SSO, say at the i+ 1th iteration, the design space is represented by a subset /, where M € f@~ Y... eM eo. Following the augmented formulation concept initially discussed in [44] for RBDO, the design parameters @, are artificially considered uncertain variables with a prescribed PDF py|) over the design space J [45]. For convenience, pe|l) = 1/V is considered, where V® is the volume of 1®. In this setting of the augmented stochastic design problem, the auxiliary PDF is defined as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "ae47ff97-433c-48eb-babb-00bef6734202",
        "metadata": {},
        "text": "π",
        "type": "Title"
    },
    {
        "element_id": "7136ad18-b5df-48cc-9609-08197dffc3c8",
        "metadata": {},
        "text": "(gp, 9)p (9.0 E,olhs(P,9)] x(9,|1) = och(p,0)p(p, 0!)",
        "type": "Formula"
    },
    {
        "element_id": "e1bc9890-9b20-4881-8679-66ddd983f20f",
        "metadata": {},
        "text": "φ, θ",
        "type": "Title"
    },
    {
        "element_id": "462d7714-00dd-412c-b4bf-35044608ff75",
        "metadata": {},
        "text": "where, p(g, 6|1) = p(6|p)p(g|I). Note that if h(g, @)< 0, it must be suitably transformed to ensure that 1(@, i) > 0. One way to do this is to define h,(p,0) = h(g, 8) — s, since Ep[hs(p,0)] = Eo[h(@,0)] — s, that is, the two expected values differ only by a constant, and the optimization of the expected value of h( - ) is equivalent, in terms of the optimal design choice, to optimization for the expected value for h,( - ). In the above equation, the denominator is a normalizing constant given by: E,olh(@,9)| = |, [m@.0(0,0\\0°)doa9. (4)",
        "type": "NarrativeText"
    },
    {
        "element_id": "cc2fabd3-90d2-4039-9a50-bd3674c85c70",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "eb8a30e2-649e-419c-8e44-9066995da665",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ae385217-b045-4e12-8ced-3b40faf9e870",
        "metadata": {},
        "text": "E,olh(@,9)| = |, [m@.0(0,0\\0°)doa9.",
        "type": "Formula"
    },
    {
        "element_id": "1ee7c236-8e89-46c8-b319-4c19079d0588",
        "metadata": {},
        "text": "Although this expected value is not explicitly needed, it can be determined using any state-of-the-art stochastic simulation method. The objective function Eθ[hs(φ, θ)] in this context of the auxiliary PDF is expressed as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "b9223f04-21c9-45d1-86de-b6df6a711280",
        "metadata": {},
        "text": "a(@|!”) E,[h(p,9)] = pol), Eya[h(@,9)),",
        "type": "Formula"
    },
    {
        "element_id": "53ae40a7-aca3-485c-8b83-a7968dc25589",
        "metadata": {},
        "text": "where, the marginal x(g|t) is given by:",
        "type": "NarrativeText"
    },
    {
        "element_id": "1bbed320-7fed-4d0e-814f-40a12fc17476",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "bea4ffb5-4815-4b7c-970f-03dfc70faf16",
        "metadata": {},
        "text": "⃒ ⃒I(i) φ",
        "type": "UncategorizedText"
    },
    {
        "element_id": "507e88e2-a626-4582-a02d-ad746674019f",
        "metadata": {},
        "text": ") = π(φ, θ)dθ. I(i)",
        "type": "Formula"
    },
    {
        "element_id": "5f108803-839e-4bd9-87f5-95826fc5248d",
        "metadata": {},
        "text": "π",
        "type": "Title"
    },
    {
        "element_id": "2afce9bf-0755-466f-85db-655e01f3b96f",
        "metadata": {},
        "text": "In (5), since Eφ,θ[h(φ, θ)] is a normalizing constant, minimization of",
        "type": "NarrativeText"
    },
    {
        "element_id": "0d6e6a7b-5baf-475d-af0c-5fb0ad3129d8",
        "metadata": {},
        "text": "(3)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1cb37af2-8820-4f2d-a2a9-5555184a30b5",
        "metadata": {},
        "text": "(4)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "19910ffd-eb33-4b3f-bc6f-d3775ec02dc2",
        "metadata": {},
        "text": "(5)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "741a3a7c-758f-4949-9d0f-d36853838468",
        "metadata": {},
        "text": "(6)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1ee39af2-be81-48ba-9212-ab208b5181c3",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "ed8df446-c272-41ee-bf6b-92a10d9cf447",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "7a0aad5a-6fe2-45e1-b017-0e13dcd18abd",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "NarrativeText"
    },
    {
        "element_id": "3ae0ea74-819f-412e-95e4-833bfad68f06",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "c4afe630-1a5e-45e0-b59d-40dcd4cada7c",
        "metadata": {},
        "text": "Eθ[h(φ, θ)] is equivalent to minimization of J(φ), which is equal to: ) ).",
        "type": "NarrativeText"
    },
    {
        "element_id": "3529e3cf-fa7e-494e-859e-bf8c8d29255e",
        "metadata": {},
        "text": "⃒ ⃒I(i) φ ⃒ ⃒I(i) φ",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ddcd2ed3-2d11-49bb-9c52-bb77644e89c8",
        "metadata": {},
        "text": "⃒ ⃒I(i) φ",
        "type": "UncategorizedText"
    },
    {
        "element_id": "86c1b986-7093-4b3c-bed9-f1576bf79dee",
        "metadata": {},
        "text": "yy — Eolhs(9.0)] _ 2(@|L) © E,olis(@,8)] p(plf)",
        "type": "Formula"
    },
    {
        "element_id": "6d122d54-e226-4fc5-87fc-57913915c820",
        "metadata": {},
        "text": "J",
        "type": "Title"
    },
    {
        "element_id": "fda321bc-0fd0-4014-8913-06b832b2dac9",
        "metadata": {},
        "text": "(7)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8747b5ca-4100-4f58-99c8-5e8d041cee35",
        "metadata": {},
        "text": "/",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8548352a-3f1f-4bdf-b43f-174e2c449279",
        "metadata": {},
        "text": "H(I) = arg min (i+1) I∈A ρ } / N(i) { I⊂I(i) : ρ = NI NI VI .",
        "type": "Formula"
    },
    {
        "element_id": "dd18009c-3a0b-4964-8a14-d7fd2d85b3ea",
        "metadata": {},
        "text": "I(i+1) = argmin I∈Aρ",
        "type": "NarrativeText"
    },
    {
        "element_id": "0432d8e6-291c-4a81-b4fd-7a119c28c6aa",
        "metadata": {},
        "text": "A(i+1) ρ =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c0fb4191-83de-4e2f-ae73-d51236431453",
        "metadata": {},
        "text": "(10)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1d821f42-d1d2-4e6c-82cd-e1ae1ba7793d",
        "metadata": {},
        "text": "The estimation of the marginal π(φ|I(i)) in (7) is necessary to mini- mize J(φ|I(i)). Analytical approximations of π(φ|I(i)) based on kernel density approaches or the maximum entropy method might be arduous in case of complex problems, such as when design parameters nφ are large, or the sensitivity for some design parameters is complex [44]. In the SSO framework, such approximation of π(φ|I(i)) is avoided. In SSO, samples distributed as π(φ|I(i)) are obtained, and the information in these samples is exploited to identify a smaller subset of the design space with a high likelihood of containing the optimal design parameters. Samples distributed as π(φ, θ|I(i)) are obtained using any appropriate stochastic sampling algorithm, such as Markov Chain Monte Carlo (MCMC) sampling [46]. The φ component of these samples then cor- responds to samples from the marginal distribution π(φ|I(i)).",
        "type": "NarrativeText"
    },
    {
        "element_id": "a54911a7-b0aa-4fab-98a1-d0ee19625ec8",
        "metadata": {},
        "text": "The effectiveness of SSO is dependent on the correct selection of the geometrical shape and size of the admissible subsets. Choosing a geometrical shape that effectively investigates the sensitivity of the objective function to each design variable is essential. The optimization in (10) determines the subset with the smallest average value of J(φ|I(i)) . I(i + 1) is a (or equivalently Eθ[hs(φ, θ)]) within the admissible set A subset of the design space I(i) with a high likelihood of containing the optimal design parameters. The above steps are repeated until the stopping criterion is met. This way, SSO adaptively converges to a relatively small subregion within the original design space. The imple- mentation of SSO is demonstrated in Fig. 1. The reader may refer to the original publication for a detailed explanation of SSO [39].",
        "type": "NarrativeText"
    },
    {
        "element_id": "b2ea8569-2d82-45aa-af2a-4ab6691ce908",
        "metadata": {},
        "text": "The sensitivity of objective function Eθ[hs(φ, θ)] to φ is determined by evaluating the average value (or equivalently volume density) of J(φ| I(i)) over any subset I in I(i), which is denoted by H(I) and defined as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "8091530b-5857-42d8-bc33-732514ad0f36",
        "metadata": {},
        "text": ") ) dφ =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "11d1a863-66bf-43c0-9250-ecfca6a5a86d",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ac1cbe7c-9093-4ac8-b48e-ef093e9f3d09",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b9a91872-b7d2-4766-85af-5b50944bbdcf",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "be5169c9-db7c-4b79-91e1-3fe421842407",
        "metadata": {},
        "text": "1 Ml”) 4 Vio == | (gl) dg = -7,[%% =| alo) ae x (et) oly VS, (ell )dp",
        "type": "Formula"
    },
    {
        "element_id": "32e2dfef-e727-4dd5-ae35-99cdd46506d2",
        "metadata": {},
        "text": "H(I) =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b357dbeb-7a62-4f84-802d-e0d31b6d80bc",
        "metadata": {},
        "text": "where, VI is the volume of subset I. Based on the samples distributed according to π(φ|I(i)) belonging to I(i), an estimate of H(I) is provided by:",
        "type": "NarrativeText"
    },
    {
        "element_id": "8777a1c9-a40f-44bf-bbe8-5e9817c833a5",
        "metadata": {},
        "text": "(8)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "cb141970-38a6-4654-9d72-40f1dafcf588",
        "metadata": {},
        "text": "(i)) expresses the average relative sensitivity of Eθ[h(φ,θ)] to φ. A (i)) indicates that Eθ[h(φ,θ)] is more sensitive to φ, and low value of H(I (i)), close to 1 corresponds to a sample vice versa. A high value of H(I density in design space I(i) that approximates a uniform distribution and suggests that the identified subset I(i) has a low likelihood of containing (i)) exceeds a threshold φ* [39]. Therefore, the SSO is stopped when H(I value. A threshold value of 0.75–0.80 has been found to give satisfactory results [39].",
        "type": "NarrativeText"
    },
    {
        "element_id": "dfe1316f-d53b-441e-9560-e6244ebda7cf",
        "metadata": {},
        "text": "NI/VI NI(i) /VI(i) ,",
        "type": "Formula"
    },
    {
        "element_id": "8a7df520-f155-49f6-aeed-444fe78eab7c",
        "metadata": {},
        "text": "H(I) =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "aa5c07ea-941c-431b-b05e-21e631e0eb66",
        "metadata": {},
        "text": "(9)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "09d7a2fd-5e07-4223-808a-64d2af285477",
        "metadata": {},
        "text": "3. Proposed approach",
        "type": "ListItem"
    },
    {
        "element_id": "b0f026e6-4407-4b34-b3d2-2644dbd35a02",
        "metadata": {},
        "text": "where, N,) is the number of samples distributed as n(y|I) belonging to 1®, and N; denotes the number of samples from n(g|I°) belonging to the I(N; < Ny-)since IcI*~ Y), Say N; = poNji-+). A smaller value of p re- sults in a faster decrease in the size of the identified subsets but with poorer accuracy. The use of p equal to 0.1 - 0.2 is suggested in the literature [39].",
        "type": "NarrativeText"
    },
    {
        "element_id": "faa9577c-89b4-475e-ac2f-858ac7d5d93c",
        "metadata": {},
        "text": "A deterministic optimization, based on the estimate H(I) of H(I), is (i+1) next performed to identify the subset I ∈ A is a set of ρ admissible subsets in I(i), that contains the smallest volume density NI/ VI, that is,",
        "type": "NarrativeText"
    },
    {
        "element_id": "e0ea8431-42e4-4a60-8069-cfdaaf8e4ce3",
        "metadata": {},
        "text": "In the proposed approach, the Voronoi tessellation is implemented to partition the design space into non-overlapping subregions (a set of Voronoi cells) using the pool of samples distributed according to this auxiliary PDF. Conceptually, Voronoi tessellation involves partitioning a space into convex polygons, called Voronoi cells, such that each cell contains exactly one sample, called a cell-generating sample. Every sample in a given polygon is closer to its generating sample compared to any other. In the proposed approach, the admissible set (a set of all admissible subspaces) is defined as a set containing all subsets of the set of Voronoi cells. An alternative approach to identify the optimal subset without performing any non-smooth deterministic optimization is also presented. The general theoretical and computational framework for the iSSO algorithm is presented in the following subsections, and the",
        "type": "NarrativeText"
    },
    {
        "element_id": "8c2dce7a-9d9c-42de-bf50-4de2d1b9fe6f",
        "metadata": {},
        "text": "(a) Objective function h(@) (b) Initial sample of 7(@) Co (c) Identified subset / Vo, = 58%) ; - 7 “Cae pag ea 40 ses 7 ay WQ)=93 +9 } a et +, (> 0) 0 5 -5- 44 ar Pr Q (d) Resampling within the (e) Identified subset /°) identified subset J Cys Vo (f) Identified Subset /© and ~ 35%) optimal solution (V,,.. / V, + 11%) & ny ° vu cs & i) Ss 3° & o Nu rs & w& N -",
        "type": "Image"
    },
    {
        "element_id": "8b2e18d8-a615-4667-b6da-0e3c40f1da22",
        "metadata": {},
        "text": "Fig. 1. Illustration of the original SSO algorithm.",
        "type": "FigureCaption"
    },
    {
        "element_id": "7a4af0c6-6b15-476d-bd9e-9374939e5438",
        "metadata": {},
        "text": "Fig. 1. Illustration of the original SSO algorithm.",
        "type": "Title"
    },
    {
        "element_id": "de331eb2-574e-421d-954f-1d17fc93890b",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "69078610-1371-4cfb-bf09-0206ddc7b0bc",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "c4205322-fd06-4a97-8f5d-052280b135b4",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "e885f30c-3d43-475d-8445-92e39b3b552f",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "71bb65cb-39fc-41b6-b6a6-a0015d5ffc71",
        "metadata": {},
        "text": "algorithm is demonstrated in Fig. 2.",
        "type": "NarrativeText"
    },
    {
        "element_id": "159c55b4-c85a-41e8-bc55-ba05ea7690f9",
        "metadata": {},
        "text": "3.2. Identification of an optimal subset",
        "type": "Title"
    },
    {
        "element_id": "6675c669-3202-49a2-8a32-be83a14259a4",
        "metadata": {},
        "text": "3.1. Partitioning of design space",
        "type": "NarrativeText"
    },
    {
        "element_id": "e94d60fe-244c-457c-90a5-8b55d61a4e59",
        "metadata": {},
        "text": "In the proposed approach, at the i + 1th iteration, say N(i) is the number of samples distributed as π(φ|I(i)) belonging to the design space (i) /(1 + γ), γ ≥ 0 be the number of unique samples. If I(i). Let nv = N sampling techniques such as accept rejection, importance sampling, etc., are used, then γ = 0, and each sample in the design space will be unique. However, if MCMC sampling techniques are used, the resulting samples will be correlated, that is γ > 0, and we will have repeated samples. (i) Assume that the design space I(i) is divided into v k , k = 1⋅⋅⋅nv, Voronoi k contains η(i) (i)",
        "type": "NarrativeText"
    },
    {
        "element_id": "a98c40a7-c2ad-4ac8-8fd3-61f6446284a7",
        "metadata": {},
        "text": "π",
        "type": "Title"
    },
    {
        "element_id": "44d08c7e-f8b6-4233-a89e-d7f6e3ead18b",
        "metadata": {},
        "text": "φ|I(i) ) = η(i) k N(i)V (i) k ≥ 0, ∀ φ ∈ v(i) k ,",
        "type": "Formula"
    },
    {
        "element_id": "5615cc28-43ed-452b-9f87-d848bfb96b69",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "96519177-b043-448b-bf11-4ddcfff8bc12",
        "metadata": {},
        "text": "(i) k is the volume of the kth Voronoi cell. Obviously, I(i) π(φ|I",
        "type": "NarrativeText"
    },
    {
        "element_id": "f82ca514-d0a1-4560-a0ab-897e4c637788",
        "metadata": {},
        "text": "where, V dφ = 1.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cafa6a1a-233a-4fb9-8e28-7adffbb7a002",
        "metadata": {},
        "text": "Similar to the original SSO, the sensitivity of the objective function J (|) to g is determined by evaluating the average value of J@|) over any subspace I of the design space I. Subset I is any subset of n,Voronoi cells (these cells may be disjointed). Since the design space is partitioned into n, subspaces or Voronoi cells, the number of admissible subsets (proper subsets) is given by 2” — 1. Based on the estimate 7(p\\I) provided in (11), an estimate of H(D is provided as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "920d0038-0cbd-4821-94c5-4cf88b22c43f",
        "metadata": {},
        "text": "(11)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5854575d-af84-44b7-9bd2-83b604f0615e",
        "metadata": {},
        "text": "(i))",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c6ffa01a-db0f-434f-a79f-198db8f2f6c8",
        "metadata": {},
        "text": "A deterministic optimization needs to be performed to identify a subset I that contains the smallest volume density NI/VI. In the case of unique samples, since η(i) (⋅) = 1, the solution to the minimization problem in (10) is a set of ρN(i) Voronoi cells with the largest volume. For the case with repeated samples, the optimization can be performed using methods appropriate for non-smooth optimization problems, such as sub-gradient methods, bundle methods, gradient sampling methods, etc. In this study, we propose an alternative approach to identify the optimal subset without performing any non-smooth deterministic opti- mization. A double-sort algorithm is proposed, which involves sorting the Voronoi cells in ascending order of the sample counts and then in groups of cells with the same sample count in descending order of cell volume. Finally, the top cells containing ρN(i)samples are selected as an approximate optimal solution from the sorted list.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5d1aa748-adc8-4de2-b655-05dc3823f9fa",
        "metadata": {},
        "text": "One may argue that the optimal subset can be obtained by first sorting the Voronoi cells in ascending order of the cell density, defined as η(i) (i) k , and then by selecting the top cells containing ρN(i) samples from the sorted list. However, this argument is erroneous because the ∑ (i) S (s)). The s=1V effectiveness of the proposed double-sort algorithm is demonstrated in Section 4 with the help of examples.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e3e111a8-05e4-47e8-a835-72d3b6c27f58",
        "metadata": {},
        "text": "3.3. Simulation of conditional samples",
        "type": "Title"
    },
    {
        "element_id": "7062b8ff-15a0-4dfc-9d25-471048ed4628",
        "metadata": {},
        "text": "∑",
        "type": "UncategorizedText"
    },
    {
        "element_id": "df673bc4-9410-4b36-b827-a7981059015e",
        "metadata": {},
        "text": "∫",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c24cd104-f705-4c63-b03d-c00c9f6b8e92",
        "metadata": {},
        "text": "ve _¥9 Sai? VO A) =f BM 49 = a Na (2)",
        "type": "Formula"
    },
    {
        "element_id": "2a1cbaf3-2e2f-42ae-a27d-161c0aba682c",
        "metadata": {},
        "text": "H(I) =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f039bba2-693c-45dd-b1de-ef408b35c3c8",
        "metadata": {},
        "text": "where, VI is the volume of the subset I and NI is the number of samples (i) belonging to it. Let I = {v (S)}, where S is the number of Vor- onoi cells defining the subset I. Note that the parentheses are used in the subscript to differentiate between the Voronoi cell number defined in the previous section from the Voronoi cell index describing the subset I. An estimate of H(I) is then provided as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "4aa97835-207c-4603-b194-91adae8cbfbd",
        "metadata": {},
        "text": "[",
        "type": "UncategorizedText"
    },
    {
        "element_id": "6f50bf71-70a2-451c-9785-9806eedd4edf",
        "metadata": {},
        "text": "]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "873f0c06-eb54-4e6f-b4b6-443d4fc975b4",
        "metadata": {},
        "text": "H(I) = V (i) N(i) η(i) (1) + η(i) (1) + V (i) V (i) (2) + ⋯ + η(i) (2) + ⋯ + V (i) (S) (S) .",
        "type": "Formula"
    },
    {
        "element_id": "dc4fab7a-f76c-4a7d-9da9-e9ae9bafeec4",
        "metadata": {},
        "text": "(12)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9b8aba63-97ed-40ce-8616-03bdddc377e7",
        "metadata": {},
        "text": "(13)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e242f0d2-a166-4722-967c-99fd320d6039",
        "metadata": {},
        "text": "At the i + 1th iteration, pn® samples distributed as xo |r\" *D) are available from the previous iteration. Using these samples as seeds, additional (1 — pnt + D are simulated. The proposed method to simulate additional samples involves two steps: (a) randomly selecting a Voronoi cell within the subset I“ * ? based on the estimate z(|I) and (b) applying the Metropolis-Hastings algorithm within the selected Voronoi cell.",
        "type": "NarrativeText"
    },
    {
        "element_id": "345dda99-5b4d-4331-a481-65fd4ceead12",
        "metadata": {},
        "text": "A Voronoi cell is selected according to the following weights in the",
        "type": "NarrativeText"
    },
    {
        "element_id": "b1f9204a-9354-4142-abba-c18c81006757",
        "metadata": {},
        "text": "first step:",
        "type": "Title"
    },
    {
        "element_id": "4d831ce0-0129-4e3b-a10c-16291341d585",
        "metadata": {},
        "text": "/",
        "type": "UncategorizedText"
    },
    {
        "element_id": "33c7f7cb-90a6-49ed-8a4a-c902867efb30",
        "metadata": {},
        "text": "w(i) k = η(i) k ∑ η(i) k V (i) k / V (i) k . k",
        "type": "Formula"
    },
    {
        "element_id": "7e551380-0173-491b-89ca-56b22ca723ad",
        "metadata": {},
        "text": "(14)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ab519298-f4f6-440e-baaa-4149a8a338fc",
        "metadata": {},
        "text": "(b) Initial samples of 7(@) and Voronoi cell _ (a) Objective function h(@) 0 ae a W@)=9 +9: || 30 (gy °° 10 = —| 5 . ~ _ \" a 0 5 m Q (d) Voronoi cells with combined samples of 7(@) and z(@| J“) Vv, fy) (e) Identified subset 2 / Vo ~ 29%) (c) Identified subset J and resampling within J (( /V, ~ 56%) (f) Identified subset /© and optima solution (Vj. /V_ ~ 9%)",
        "type": "Image"
    },
    {
        "element_id": "0a7fbfb2-ff0c-4957-b191-fc6130efb886",
        "metadata": {},
        "text": "Fig. 2. Illustration of the proposed iSSO algorithm.",
        "type": "FigureCaption"
    },
    {
        "element_id": "be2e76a8-3815-4399-ad65-f18355db5adc",
        "metadata": {},
        "text": "Fig. 2. Illustration of the proposed iSSO algorithm.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3319846f-b5d0-4342-9e58-aa82bee83928",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "048fe434-ce12-4820-8fd5-7207126bd630",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "c488f5f3-517c-4178-840e-8dd252014292",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "b788c147-22f5-41f7-8403-06fa209472d8",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "21235248-6850-4f35-b5d0-44be92f63232",
        "metadata": {},
        "text": "To simulate a new sample within a selected Voronoi cell, the sample that generated the selected Voronoi cell or the last simulated sample in the selected Voronoi cell is used as the seed sample, and the Metropolis- Hastings algorithm is implemented. A candidate sample [φc,θc] is simulated using the proposal q(φc,θc|φ,θ) and is accepted with the probability min(1, a0), where, a0 is given as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "9954573c-661a-43d6-81a6-968c45e8c01e",
        "metadata": {},
        "text": "h(φc, θc)p(φc, θc)q(φ, θ|φc, θc) . h(φ, θ)p(φ, θ)q(φc, θc|φ, θ)",
        "type": "Formula"
    },
    {
        "element_id": "a3636d44-fb39-4b7d-8b01-968035af6fa8",
        "metadata": {},
        "text": "a0 =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "57926827-c6fa-48aa-b847-785816cbb4b4",
        "metadata": {},
        "text": "In the present study, the proposed PDF is equal to the uniform PDF for design parameters and the initial PDF for uncertain variables, i.e., q (φ, θ|φc,θc) = p(φ, θ). Therefore, on simplifying (15), a0 is given as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "db6469b4-d00f-4786-8994-f046178b5cc1",
        "metadata": {},
        "text": "h(φc, θc) . h(φ, θ)",
        "type": "Formula"
    },
    {
        "element_id": "2d7050fc-0f4d-4566-a17d-be5aa6b33ba9",
        "metadata": {},
        "text": "a0 =",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f257d8a2-af75-499c-bb7f-3bc2fe902f92",
        "metadata": {},
        "text": "3.4. Stopping criteria",
        "type": "NarrativeText"
    },
    {
        "element_id": "077d5227-d5e7-454e-a3d4-05343b05609b",
        "metadata": {},
        "text": "3.4. Stopping criteria",
        "type": "NarrativeText"
    },
    {
        "element_id": "51124436-628b-44c2-bde1-c412d69c75ec",
        "metadata": {},
        "text": "A new stopping criterion is proposed in this study. The convergence of the expected value of the performance measure h(g, @) with respect to the PDF for g and @ in consecutive iterations is used as the stopping criterion. Mathematically the proposed stopping criterion is represented by: [E,olh(p,8)|' — Eyolh(y,@)\\\"'| <e (7)",
        "type": "NarrativeText"
    },
    {
        "element_id": "058bb87c-6471-495a-9f24-8dd5eb9e0371",
        "metadata": {},
        "text": "⃒ ⃒ ≤ ε",
        "type": "UncategorizedText"
    },
    {
        "element_id": "0175a786-4777-4ae0-a6af-1d82bf3a643a",
        "metadata": {},
        "text": "where, ε is a user-specified tolerance limit. Other stopping criteria, as indicated in [39,47], can also be chosen.",
        "type": "NarrativeText"
    },
    {
        "element_id": "57ce173d-afb5-4bc7-97e1-071c0a8cf71a",
        "metadata": {},
        "text": "(15)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ce3c6dc5-557b-47fd-9541-1bda2537626e",
        "metadata": {},
        "text": "(16)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5e70655d-8c00-4983-a0f4-918750037b12",
        "metadata": {},
        "text": "(17)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "771b61d2-f4ee-4bbd-9bd2-e95f48fd55ee",
        "metadata": {},
        "text": "3.5. Implementation issues",
        "type": "Title"
    },
    {
        "element_id": "f4c56aa0-0e6a-4f7e-8a06-9dc1ea002c2a",
        "metadata": {},
        "text": "An important issue for the effective implementation of the iSSO is the creation of the Voronoi cells at the current iteration bounded within the Voronoi cell created at the previous iterations. Although it is possible to create such bounded Voronoi cells, due to the geometrical complexities, it is usually unfeasible for the higher dimensional problems (n)>2). An alternative approach is proposed in the present study for creating the Voronoi cells at any iteration of the iSSO. The proposed approach in- volves creating Voronoi cells using the samples generated at the current and all previous iterations and then by considering Voronoi cells cor- responding to the samples from the current iteration. This is shown in Fig. 3, where Fig. 3(a) shows the N samples at the first iteration and the corresponding Voronoi cells. Fig. 3(b) shows the pN selected Voronoi cells leading to the smallest volume density and the additional (1 — p)N samples being generated using these pN samples as seeds. Fig. 3(c) shows that the Voronoi cells are generated using all N + (1 — p)N samples that are generated in the two iterations. The Voronoi cells corresponding to the N samples for consideration at the second iteration are also highlighted in Fig. 3(c). Fig. 3(d) shows a zoomed-in version of Fig. 3(c) where it can be observed that the area covered by the N Voronoi cells considered in the second iteration is not the same as the area covered by the pN Voronoi cells selected in the first iteration. On the contrary, the area covered by the Voronoi cells in the second iteration is more than the area covered by the Voronoi cells corresponding to the seed samples from the first iteration. This is because a new sample within the Voronoi cell between an existing sample and the existing Voronoi cell edge results in the relocation of the Voronoi cell edge in a",
        "type": "NarrativeText"
    },
    {
        "element_id": "9618760e-c236-4bab-b1d0-adb43ff1de36",
        "metadata": {},
        "text": "(a) Initial samples and Voronoi (c) Voronoi cells with combined samples of 7(@) and z(@| I\") 0.45 0.35 2) 0.3 0.4",
        "type": "Image"
    },
    {
        "element_id": "e5b1614e-8559-4b05-9172-a9be90612583",
        "metadata": {},
        "text": "Fig. 3. Implementation of Voronoi tessellation in iSSO.",
        "type": "FigureCaption"
    },
    {
        "element_id": "4e894241-7a8a-44b6-ac56-5e43a965f833",
        "metadata": {},
        "text": "Fig. 3. Implementation of Voronoi tessellation in iSSO.",
        "type": "Title"
    },
    {
        "element_id": "d523fe54-20ea-470f-8423-f4c2f6b8a9f3",
        "metadata": {},
        "text": "5",
        "type": "Footer"
    },
    {
        "element_id": "8a5d461c-d729-4aaa-9ada-46c0f1a2ba58",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "a3805873-8ef8-409b-913b-e3aaf4f20f46",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "f14bb6af-bc95-42fa-8273-1b3029fbc9de",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "a25d1d19-79cd-473c-b3bc-09b6542126cb",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "f79c9483-41a8-498f-8e27-372485c3d450",
        "metadata": {},
        "text": "direction away from the new sample. The increase at each iteration in- troduces a bias in the estimate of π(φ|I(i)) in (11). However, this does not affect the performance of the proposed approach as the objective is not to simulate the samples distributed as π(φ|I(i)) but to identify the subsets for an optimal solution. In addition, the increase is not substantial, as seen later in the illustrative examples in Section 4.",
        "type": "NarrativeText"
    },
    {
        "element_id": "02076560-7849-40b5-8c9f-de888feeaa4f",
        "metadata": {},
        "text": "3.6. Special case: deterministic optimization",
        "type": "Title"
    },
    {
        "element_id": "eedf47a8-3119-4d9d-b5ee-2b4226739040",
        "metadata": {},
        "text": "In the iSSO framework, a deterministic optimization problems can also be handled with the vector of uncertain variables θ set equal to a null vector (nθ = 0). Since the determination of the subset at each iSSO iteration is solely dependent on the samples distributed as π(φ), no modification to the iSSO algorithm is required to solve a deterministic optimization problem, and the entire formulation remains valid.",
        "type": "NarrativeText"
    },
    {
        "element_id": "2ba4118d-82fa-4b2d-8d03-f675b8dbbe2b",
        "metadata": {},
        "text": "4. Illustrative examples",
        "type": "ListItem"
    },
    {
        "element_id": "ce1573f7-2183-4da6-b86a-b818b5d64a9c",
        "metadata": {},
        "text": "In this section, typical optimization problems are considered to demonstrate the effectiveness and efficiency of the proposed approach. First, deterministic optimization problems are considered. These prob- lems include several local and global minima. Next, stochastic optimi- zation problems are illustrated. The second example presents an RDO problem of the TMD. In this example, the variance minimization of the protected structure’s displacement (TMD attached to the structure) is",
        "type": "NarrativeText"
    },
    {
        "element_id": "c87ded50-c116-4d19-bac0-1a9dcf20f4ef",
        "metadata": {},
        "text": "performed. In the third example, the mean minimization of 120 bars truss problems is explored to demonstrate the applicability of the pro- posed approach to a high-dimensional stochastic design problem. Finally, the fourth example investigates the reliability-based optimiza- tion of a base isolation system for a 10-story building.",
        "type": "NarrativeText"
    },
    {
        "element_id": "bec0dab3-ed4b-4bca-908a-46f3519742c5",
        "metadata": {},
        "text": "In this study, after implementing iSSO, the optimal design solution is identified as follows. Let θj, j = 1⋅⋅⋅n be a set of independent, identically distributed realizations of θ, and let h(φ, θj) be the structural perfor- mance function realization for θj. The expected structural performance function is approximated by the average of the realizations as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "08baffbb-8db7-487c-a945-9d5dfe3fec54",
        "metadata": {},
        "text": "Ey(h(@.0)] ~* > h(o.8).",
        "type": "Formula"
    },
    {
        "element_id": "f769b309-9eba-4f8e-b3f4-edb21178eb6e",
        "metadata": {},
        "text": "Eθ[h(φ, θ)] ≈",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d7295ade-2f95-4df7-b88f-58ffd17a0d18",
        "metadata": {},
        "text": "Eθ[h(φ, θ)] is evaluated for all unique φ samples obtained at the last iteration of the iSSO, and the φ sample resulting in the smallest value of Eθ[h(φ, θ)] is taken as the optimal solution. Alternatively, as the right- hand side of (18) is deterministic, any deterministic optimization method can also be used to solve the optimization problem with the approximate expectation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7c163834-5802-4c62-bf58-cbfe8b626793",
        "metadata": {},
        "text": "In the following examples, both iSSO and SSO are implemented with N = 1000nφ, ρ = 0.20 and the stopping criteria as stated in (17). Here, a value of ε = 10",
        "type": "NarrativeText"
    },
    {
        "element_id": "9b5798e1-740c-43c5-a8f9-600be9f37892",
        "metadata": {},
        "text": "is adopted.",
        "type": "NarrativeText"
    },
    {
        "element_id": "d50ba7e2-4f9e-48d6-a312-dea3239440a0",
        "metadata": {},
        "text": "(18)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fd4e14b3-3f2f-4259-b960-131abd9c7dc2",
        "metadata": {},
        "text": "(a) surface plot (b) contour plot 10 Semerere roe 2 Global Minimum 1.5 1 0.5 (d) SSO with hyper-ellipse tae 10 Identified Subset at SSO generation-1 sf s B cre] ?; 0 final 54 -10 -10 -5 0 5 10 gy -10 5 0 5 10",
        "type": "Image"
    },
    {
        "element_id": "e0021a82-4fad-4af6-a060-a5fea343b8d5",
        "metadata": {},
        "text": "Fig. 4. Results for the Griewank function.",
        "type": "FigureCaption"
    },
    {
        "element_id": "2891cb26-27b1-4be6-82ef-53e3dd61b2a9",
        "metadata": {},
        "text": "Fig. 4. Results for the Griewank function.",
        "type": "Title"
    },
    {
        "element_id": "fc43301b-092d-442d-a4b3-1f5c1800be5b",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "051d8b92-158c-4ad8-aab2-0dfd2ff9356a",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "cefdaac2-be1c-4f50-93d9-83ad0134c8ed",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "d6839cf6-a543-49a5-b860-b5c59877fcb2",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "bae65064-e430-4cc6-a06d-bb2798cd31b6",
        "metadata": {},
        "text": "(a) surface plot 0 “10-10 a (c) SSO with hyper-rectangle -10 -5 0 5 10 1) == 2 1000-5 0 5 10 tified final optimal solution",
        "type": "Image"
    },
    {
        "element_id": "8888b421-4b42-4bfa-ae31-7fe06fdf178e",
        "metadata": {},
        "text": "Fig. 5. Results for the Cross-in-Tray function.",
        "type": "FigureCaption"
    },
    {
        "element_id": "9ff5c50c-61a9-4689-be97-4b3a6742ec05",
        "metadata": {},
        "text": "4.1. Multimodal deterministic optimization problems",
        "type": "Title"
    },
    {
        "element_id": "142897eb-4770-4a07-95f5-bf7853ae572c",
        "metadata": {},
        "text": "In this section, three two-dimensional benchmark deterministic optimization problems are considered. Results are also compared with the SSO. The test functions are:",
        "type": "NarrativeText"
    },
    {
        "element_id": "9904659e-54bf-47e1-a7ba-975c9cd8c09a",
        "metadata": {},
        "text": "[eso Pte minh(g) = —|sin(y, rote va\" } ; s.t.g = [— 10, 10]",
        "type": "Formula"
    },
    {
        "element_id": "b0eaac49-1501-4a77-a163-b6d242c375bf",
        "metadata": {},
        "text": "√",
        "type": "UncategorizedText"
    },
    {
        "element_id": "1964b2d0-3d64-4e6f-b93a-373c1119fc54",
        "metadata": {},
        "text": "minh(g) =",
        "type": "Title"
    },
    {
        "element_id": "45fdfeea-2b4a-41aa-961f-b34d01ec44ff",
        "metadata": {},
        "text": "(21))",
        "type": "UncategorizedText"
    },
    {
        "element_id": "3b3ac7cc-3983-4265-837b-c4126e55bc01",
        "metadata": {},
        "text": "a) Griewank function:",
        "type": "Title"
    },
    {
        "element_id": "eb1eb94d-a4c8-48a3-81b2-07db6ac51965",
        "metadata": {},
        "text": "(",
        "type": "UncategorizedText"
    },
    {
        "element_id": "04c44aa2-bfae-43b5-b506-ea71eb3d8e86",
        "metadata": {},
        "text": ")",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5e562234-fbd9-42d9-b8b5-226fa8d6020d",
        "metadata": {},
        "text": "d vy d ”, minh(g) = a cos(%) +1, 2400 I vi as)",
        "type": "Formula"
    },
    {
        "element_id": "06e2cdcd-9331-4abe-a6ea-6b2f7b9f8274",
        "metadata": {},
        "text": "minh(φ) =",
        "type": "Title"
    },
    {
        "element_id": "4d961d85-c491-4c8a-9f7d-2be8d4fc90c6",
        "metadata": {},
        "text": "s.t.g = [— 10, 10]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9349d353-6904-43d0-b7f9-4d1799e9a14f",
        "metadata": {},
        "text": "b) Cross-in-Tray function:",
        "type": "Title"
    },
    {
        "element_id": "45550a27-52bf-42ae-bae4-9317598f3683",
        "metadata": {},
        "text": "ara 100 -V@it 1 a). minh(p) = -ocnor( ) sin(y, pines s.t.g = [— 10, 10]",
        "type": "Formula"
    },
    {
        "element_id": "2239b24e-54ff-42c0-b5fc-e724757d8a1a",
        "metadata": {},
        "text": "(19)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "079e1c3f-390c-40b6-a420-955533c4bd0d",
        "metadata": {},
        "text": ")0.1",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b8de18f7-cf0d-4f05-b5ed-c1696e2de7b3",
        "metadata": {},
        "text": ",",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e47022a5-8d28-4576-8a64-d910e08d93ed",
        "metadata": {},
        "text": "The results for the Griewank function are presented in Fig. 4. Fig. 4(a, b) shows that the function has multiple closely spaced local minima with a single global minimum. Fig. 4(c, d) shows the SSO optimization using hyper-rectangle and hyper-ellipse as shapes of admissible subsets. It is seen that these shapes fail to capture the region containing the optimal design due to the presence of multiple local minima. Next, the iSSO is implemented, where the Voronoi cells selected at the first and last iteration are shown in Fig. 4(e, f). It is observed that at the first iteration, the selected Voronoi cells effectively capture both the local and global minima and in the subsequent iterations, the selected cells are more concentrated near the global minimum. The region selected at the last iteration captures the optimal global solution.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1414d900-632c-4e98-9992-c0b76604ceaa",
        "metadata": {},
        "text": "c) Holder Table function:",
        "type": "NarrativeText"
    },
    {
        "element_id": "f30fa1d1-278a-4069-aed1-1071785f286d",
        "metadata": {},
        "text": "(20)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "26d12b3c-2d29-4c48-a13e-307c40744b2f",
        "metadata": {},
        "text": "The Cross-in-Tray function has a relatively complex design space compared to the Griewank function. Fig. 5(a, b) shows multiple local and global minima. Minimization by using SSO is demonstrated in Fig. 5 (c, d). It is found that both the hyper-rectangle and hyper-ellipse are trapped around any one of the global minima. At the same time, the iSSO is able to capture the regions that include all of the global minima, as",
        "type": "NarrativeText"
    },
    {
        "element_id": "50e8a3c6-29ba-4e44-96cd-125aba607545",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "45df26aa-6370-45b4-891e-1eef5b9a2eec",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "b5a2bfb2-faac-43e3-bc72-c97936504f8d",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "5b9eb7ea-040e-4dcf-ab11-3b8abe41c91d",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "58c35438-0237-4647-a781-c27ab1d904b4",
        "metadata": {},
        "text": "(a) surface plot 0 Pr -10 -10 Q, (c) SSO with hyper-rectangle 10 ; 0 Pr. 3 -5 -10 -10 -5 0 5 10 y e) iSSO at the first iteration eee -10 (b) contour. plot 10 mae; ~~ |@ Global Minima ~10 5 0 5 10 5 Global Minima sieedeacaets 3 = -10 -5 0 5 10",
        "type": "Image"
    },
    {
        "element_id": "16dc9bb0-ca05-4d75-b939-be5ed0030028",
        "metadata": {},
        "text": "Fig. 6. Results for the Holder Table function.",
        "type": "FigureCaption"
    },
    {
        "element_id": "f8e26e21-76f2-4d48-a40d-1ccc37ba10c7",
        "metadata": {},
        "text": "seen in Fig. 5(e, f).",
        "type": "NarrativeText"
    },
    {
        "element_id": "ed136321-f424-4dd1-83e1-7bc027db0f82",
        "metadata": {},
        "text": "The Holder Table function has multiple local and global minima; the global minima are placed at the boundary of the design space, as shown in Fig. 6(a, b). Once again, it is seen that both the hyper-rectangle and hyper-ellipse are trapped around any of one of the global minima, and on the other hand, the iSSO is able to capture the regions that include all of the global minima, as seen in Fig. 6(e, f).",
        "type": "NarrativeText"
    },
    {
        "element_id": "90ecd36f-d39d-4b15-94f3-cc8ff2835ba3",
        "metadata": {},
        "text": "The results from the three examples demonstrate that the proposed iSSO is able to capture the regions containing the optimal solution effectively.",
        "type": "NarrativeText"
    },
    {
        "element_id": "32108036-a831-4156-a879-4609f0646ee2",
        "metadata": {},
        "text": "Next, the statistics of the results of 50 independent runs, both for SSO and iSSO are presented in Table 1. It also includes the results obtained by using state-of-the-art approaches, such as the Genetic algorithm, particle swarm optimization, and the gradient based optimization approach (interior-point algorithm). The proposed iSSO outperforms all other approaches as more successes in determining the optimal solution are observed in all three optimization problems. It is also seen that both SSO and iSSO result in a similar value of volume reduction for the same stopping criterion; however, with SSO, the number of iterations required to achieve this volume reduction are relatively higher. The proposed approach outperformed the state-of-the-art approaches, as indicated by the number of successes. These examples demonstrate that the main advantage of implementing Voronoi tessellation is an effective explo- ration of the design space.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b211113d-cee4-4781-8727-ceaf05281232",
        "metadata": {},
        "text": "Next, the performance of the proposed \"double sort algorithm\" for selecting the optimal subset is studied by using the above-mentioned",
        "type": "NarrativeText"
    },
    {
        "element_id": "9c4ded0e-33d2-4c33-9db1-1da5639b9f57",
        "metadata": {},
        "text": "(1)) for the 50 indepen- three functions. Fig. 7 shows the value of H(I dent simulation runs, which is estimated by implementing the proposed double sort algorithm and by using the Genetic algorithm. It can be (1)) values obtained using the proposed noted that for each run, the H(I double sort algorithm and Genetic algorithm are well matched, thereby confirming the adequacy of the proposed double sort algorithm.",
        "type": "NarrativeText"
    },
    {
        "element_id": "885181aa-d603-4e1d-805d-78b6e8dea554",
        "metadata": {},
        "text": "At any iteration of iSSO, new samples are simulated using the seed samples. In the proposed approach, the volume of the Voronoi cells corresponding to the seed and new samples is greater than the volume of the Voronoi cells corresponding only to the seed samples. Fig. 8 shows this change in volume V due to the creation of Voronoi cells at any generation of iSSO using the procedure mentioned in Section 3.4. The increase is observed to be small which further reduces with an in- crease in the iteration number. It is also observed that the increase in volume decreases with an increase in sample size at each iteration and increases with an increase in the dimension of the problem.",
        "type": "NarrativeText"
    },
    {
        "element_id": "62c80625-4a85-4ed4-83ac-dc14f786a278",
        "metadata": {},
        "text": "4.2. Robust design optimization of the tuned mass damper",
        "type": "Title"
    },
    {
        "element_id": "4fa2e2c7-2eaf-439f-af9b-cc2bc7b52df7",
        "metadata": {},
        "text": "This example considers a stochastic design problem involving a Tuned Mass Damper (TMD) attached to a Single Degree of Freedom (SDOF) system. The problem is taken from [48] and is shown in Fig. 9. In this problem, the system is excited by a white noise signal with a mean zero and unit variance. The performance measure is the variance of the displacement of the system σ2 xs . The mass mS, stiffness kS, and",
        "type": "NarrativeText"
    },
    {
        "element_id": "328b9741-081b-4d0d-91df-13b1fee906d5",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "91426d5a-6c9e-45d3-bb5f-7503166010cc",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "d84d932b-9721-4bc4-b955-9c66b9e92a74",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "56695032-0624-40f3-838a-a06ba1a8158f",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "d62d47ad-2cdd-4e0a-b17f-72f3640f0d54",
        "metadata": {},
        "text": "Table 1 Statistics of optimization results for multimodal deterministic optimization problems.",
        "type": "Title"
    },
    {
        "element_id": "5c983536-dbb8-4c54-a944-e40089399e0e",
        "metadata": {},
        "text": "Example",
        "type": "Title"
    },
    {
        "element_id": "430efea4-f056-4aea-9480-9777a62afca0",
        "metadata": {},
        "text": "Example",
        "type": "Title"
    },
    {
        "element_id": "78964e66-6e20-47bc-b33a-5850fff70b22",
        "metadata": {},
        "text": "SSO",
        "type": "Title"
    },
    {
        "element_id": "787bc66c-a0de-4159-b100-4c021c439279",
        "metadata": {},
        "text": "iSSO",
        "type": "Title"
    },
    {
        "element_id": "cd27e79b-f044-4a51-a92f-54440376af67",
        "metadata": {},
        "text": "GA*",
        "type": "UncategorizedText"
    },
    {
        "element_id": "e805c3a6-5d85-4b3d-84ef-729cd8876730",
        "metadata": {},
        "text": "PSO*",
        "type": "UncategorizedText"
    },
    {
        "element_id": "dea3489b-a916-4e07-a66a-8bb860d67fe1",
        "metadata": {},
        "text": "GBA*",
        "type": "UncategorizedText"
    },
    {
        "element_id": "787b9265-3884-49cc-8e40-d8b831c45b0a",
        "metadata": {},
        "text": "Hyper-Rectangle Hyper-Ellipse Griewank NF 30 32 5 38 35 47 NS 20 18 45 12 15 3 BV 0 0 0 0 0 0 WV 0.1028 0.1161 0.0270 0.0296 0.0232 0.0296 AV 0.0190 0.0292 0.0110 0.0094 0.0057 0.0173 C.0.V 1.1663 1.0168 0.5137 0.9603 0.8763 0.05971 FE 22,702 15,223 12,426 3385, 1432 33 Gen 7 5 4 VR 84.79 93.56 Cross-In-Tray NF 50 1 50 50 50 NS 0 49 0 0 0 BV —2.0626 —2.0624 —2.0626 —2.0626 —2.0626 WV —2.0481 —2.0260 —2.0626 —2.0626 —1.3853 AV —2.0621 —2.0522 —2.0626 —2.0626 —1.7360 C.0.V 0.001 0.0042 0 0 0.0977 FE 21,595 9982 3178 933 32 Gen 7 3 VR 98.95 88.71 Holder-Table NF 50 3 50 50 50 NS 0 47 0 0 0 BV —19.2085 —17.5025 —19.2085 —19.2085 —19.2085 —19.2085 WV —18.8916 —1.1419 —17.3030 —9.5047 —15.1402 —1,1831 AV —19.0916 —8.432 —18.8798 —19.0144 —18.9745 —6.5493 C.0.V 0.0025 0.3898 0.0182 0.0722 0.0443 0.8358 FE 40,700 24,684 18,142 3413, 988 30 Gen 13 8 6",
        "type": "Table"
    },
    {
        "element_id": "2261d094-cbcc-4ec9-9f7b-4b2417c6c4bb",
        "metadata": {},
        "text": "NF NS BV WV AV c.o.v FE Gen VR NF NS BV WV AV c.o.v FE Gen VR NF NS BV WV AV c.o.v FE Gen VR",
        "type": "UncategorizedText"
    },
    {
        "element_id": "43f2effb-921d-472d-b7c5-040ee0821b9a",
        "metadata": {},
        "text": "30 20 0 0.1028 0.0190 1.1663 22,702 7 —19.2085 —18.8916 —19.0916 0.0025 40,700 13 99.59",
        "type": "UncategorizedText"
    },
    {
        "element_id": "af5c0352-c987-46dc-a2c4-02867a4cf285",
        "metadata": {},
        "text": "32 18 0 0.1161 0.0292 1.0168 15,223 5 84.79 50 0 —2.0626 —2.0481 —2.0621 0.001 21,595 7 98.95 50 0 —17.5025 —1.1419 —8.432 0.3898 24,684 8 99.42",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4e38e42a-7934-4e0e-89af-5aef32999b32",
        "metadata": {},
        "text": "5 45 0 0.0270 0.0110 0.5137 12,426 4 93.56 1 49 —2.0624 —2.0260 —2.0522 0.0042 9982 3 88.71 3 47 —19.2085 —17.3030 —18.8798 0.0182 18,142 6 94.37",
        "type": "UncategorizedText"
    },
    {
        "element_id": "5130b200-443d-4a8f-b0c3-bc0efcba8fee",
        "metadata": {},
        "text": "50 0 —19.2085 —1,1831 —6.5493 0.8358 30",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b3106cd4-4433-422b-ae16-855d1773c081",
        "metadata": {},
        "text": "GA = genetic algorithm, PSO = particle swarm optimization, GBA = gradient-based optimization approach, NF = no. of. failure, NS = no. of. success, BV = best value, WV = worst value, AV = average value, c.o.v = coefficient of variation, FE = no. of. function evaluations, Gen = generations, VR = volume reduction percentage, * = efficiently applicable only for deterministic problems.",
        "type": "FigureCaption"
    },
    {
        "element_id": "96ae69f0-5273-4287-87f1-b6b2fc480ae8",
        "metadata": {},
        "text": "(a) Griewank Function (c) Holder-Table Function 04 pL) 04S 0.45 Rah = — + Optimization by GA ATs VPA mrt le fh ke PFA Nps VR AY —E Double sort approach Eas “Ye ee al My ~ 04 04 0.4 yy yyP Bw f Fy = \\ Rol, Np ala | 935 035} WN Ay a! Vv 035 Nala | 03! hay 03 03 | 0 10 20 30 40 SO 20 30 40 50 0 10 20 30 40 50 Run number",
        "type": "Image"
    },
    {
        "element_id": "678813c2-7434-4650-981c-33984e9d610b",
        "metadata": {},
        "text": "Fig. 7. Comparison of double sort algorithm and Genetic algorithm results.",
        "type": "FigureCaption"
    },
    {
        "element_id": "c4c9bc65-7c99-441e-955d-3d144875819d",
        "metadata": {},
        "text": "10 (a) Griewank Function 10 (b) Cross-In-Tray Function (c) Holder-Table Function o - : - g a a8 —— Simulation run 5 rs) c= | 2 ob f= s a 3 x0 1 2 3 4 1 2 3 iSSO iterations",
        "type": "Image"
    },
    {
        "element_id": "79cada96-db94-4b9d-bfe2-7446f18be5eb",
        "metadata": {},
        "text": "Fig. 8. Percentage change in volume at each iSSO iteration.",
        "type": "FigureCaption"
    },
    {
        "element_id": "ba6d2ae2-7fc4-4566-8c8f-185c275f2c7c",
        "metadata": {},
        "text": "damping cS of the system are taken as uncertain parameters, following independent Gaussian distribution. The mean value of these variables is taken to be 105 kg, 107 N/m, and 4 × 104 Ns/m respectively. To account for uncertainty, the c.o.v value for each variable taken is 0.05. The frequency ratio β = ωT /ωS and damping ξT of the TMD are considered design parameters. The TMD has a mass ratio, mT/ms, of 0.10. The",
        "type": "NarrativeText"
    },
    {
        "element_id": "855f5857-3fef-4013-bd83-281b6d538c70",
        "metadata": {},
        "text": "parameters mT,ωT,andωS are, in order, the mass of the TMD, the natural ), and the natural frequency of the frequency of the TMD ( √ √ ̅̅̅̅̅̅̅̅̅̅̅̅̅̅ kT/mT ̅̅̅̅̅̅̅̅̅̅̅̅ ks/ms structure ( ). The optimization problem is written as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "44a482a8-9695-4cfe-a7ea-7ef8e54e673f",
        "metadata": {},
        "text": "[(",
        "type": "UncategorizedText"
    },
    {
        "element_id": "c93b25fb-bcb0-4193-8b75-6179b08155f7",
        "metadata": {},
        "text": ")]2",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4a42c571-902c-40c9-9872-e487e292aad4",
        "metadata": {},
        "text": "minimize : eo pe Eo[h(0,0,)] = Fol (0%, (0.9) -9)| « 22)",
        "type": "Formula"
    },
    {
        "element_id": "b254e9cc-d57a-4e69-9e2b-f0ef6873316f",
        "metadata": {},
        "text": "(22)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a822efe8-4b43-4ff2-9698-4664896833c5",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "4d274e3f-8879-4793-a6cd-d2a96af0622d",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "d7772121-e777-4941-9cc6-fe1fb5e7c56d",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "ac230c39-aba6-44b6-ab0a-5da27f61a06b",
        "metadata": {},
        "text": "iSSO are shown. SAA is applied with a sample size of 103, as mentioned in [43]. The results demonstrate that iSSO is effective in locating the optimal solution. SSO implemented with hyper-ellipse gives an optimal solution but has a higher computational cost.",
        "type": "NarrativeText"
    },
    {
        "element_id": "80b27e4c-01cd-4792-b1f7-c28fe9975acc",
        "metadata": {},
        "text": "4.3. 120-bars truss structure",
        "type": "Title"
    },
    {
        "element_id": "d4e9cef5-07c3-440d-b80c-e37a1551cf37",
        "metadata": {},
        "text": "The third example involves minimizing the mean of the compliance of a 120-bar linear elastic truss structure shown in Fig. 10 under the weight constraint W < 15, 000kg. Because of structural symmetry, design parameters corresponding to the cross-sectional areas of elements are divided into seven groups, each with a minimum area of 10~* m2. The Young’s modulus for the bar groups are assumed as uncorrelated normal random variables with mean values equal to 210 GPa and the c. 0.v equal to 0.10 respectively. The density of the material is 7971.89 kg/ m?°, The dome is subjected to concentrated vertical loads acting down- ward at the top node, normally distributed with a mean equal to 60 kN and c.o.v equal to 0.20. In addition, the mass of bars is concentrated at the nodes. The problem is taken from [48].",
        "type": "NarrativeText"
    },
    {
        "element_id": "0255ee60-69c5-40e6-9889-04601ff20bc2",
        "metadata": {},
        "text": "Fig. 9. TMD attached to a SDOF system [48].",
        "type": "FigureCaption"
    },
    {
        "element_id": "ae906125-c20f-4c4c-9b17-911de38e19e2",
        "metadata": {},
        "text": "where,",
        "type": "Title"
    },
    {
        "element_id": "5fd34632-1a7c-4a60-9caf-9069bc6dea8d",
        "metadata": {},
        "text": "0.01 ≤ β ≤ 1.5, 0.01 ≤ ξT ≤ 1.0, 0 ≤ φ ≤ 1000. (23)",
        "type": "Formula"
    },
    {
        "element_id": "9875b078-c147-44a3-ae67-5be2647c2ce6",
        "metadata": {},
        "text": "Table 3 presents the best of 10 independent run results obtained with SSO and iSSO. Once again, the SSO and iSSO solutions agree well, thereby demonstrating the effectiveness of the proposed approach. At the same time, the number of function evaluations is substantially less in the case of iSSO, indicating the efficiency of the proposed approach.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f57dd2a6-1252-4741-98ed-b9ad0d866690",
        "metadata": {},
        "text": "Table 2 presents the optimal design parameter values as well as the objective function value that solve the optimization problem in (22). Results obtained using SSO, Sample Average Approximation (SAA), and",
        "type": "NarrativeText"
    },
    {
        "element_id": "9be31a89-b49e-434a-9e10-7d78fa314160",
        "metadata": {},
        "text": "4.4. Reliability-based design of a base isolated structure",
        "type": "Title"
    },
    {
        "element_id": "5870ca92-0a0c-4ede-9281-75295f9046f6",
        "metadata": {},
        "text": "This example, adapted from [49], involves the reliability-based",
        "type": "NarrativeText"
    },
    {
        "element_id": "f3c8d2d1-9be9-4f25-b3a7-d5932a9b4fbf",
        "metadata": {},
        "text": "Table 2",
        "type": "Title"
    },
    {
        "element_id": "d39a6242-6827-457c-9562-7f628b284423",
        "metadata": {},
        "text": "Table 2 Variance minimization of TMD-structure.",
        "type": "Title"
    },
    {
        "element_id": "5f809f90-e792-42a0-95c6-7509db55b45e",
        "metadata": {},
        "text": "Method Admissible Subset shape Design parameters E,[h(0.9,9)] FE NS NE B er (< 10°16 mm‘) SSO [48] Hyper-Rectangle 0.551 0.623 41.324 7433 0 50 Hyper-Ellipse 0.749 0.221 1.7586 8245 34 16 SAA 0.749 0.221 1.7587 3 x 10° 4 46 isso Voronoi tessellation 0.749 0.221 1.7586 6198 50 0",
        "type": "Table"
    },
    {
        "element_id": "8c84c00d-69ac-420f-bbb3-b335b4f94be6",
        "metadata": {},
        "text": "—Group | —Group 2 — Group 3 —Group 4 : 500 Group 5 Io 300 cm | <—500em Group © ——700 cm. —Group 7",
        "type": "Image"
    },
    {
        "element_id": "128b37da-c00a-4a71-9ea7-c1d79b94d840",
        "metadata": {},
        "text": "Fig. 10. 120-bar dome truss structure [48].",
        "type": "FigureCaption"
    },
    {
        "element_id": "e12162d9-a5d0-47de-8a25-9046361124ac",
        "metadata": {},
        "text": "Fig. 10. 120-bar dome truss structure [48].",
        "type": "NarrativeText"
    },
    {
        "element_id": "9cb74e2f-68ff-4bfa-90e8-f12d01198637",
        "metadata": {},
        "text": "Table 3",
        "type": "Title"
    },
    {
        "element_id": "5994c825-f77d-4c31-8737-47858bd0176a",
        "metadata": {},
        "text": "Table 3 Results for the 120 bars truss structure.",
        "type": "Title"
    },
    {
        "element_id": "f15ef29b-8a3e-4fd4-8f17-ac7379ff4364",
        "metadata": {},
        "text": "Method Design parameters A1 A2 (cm2) (cm2) A3 (cm2) A4 (cm2) A5 (cm2) A6 (cm2) A7 (cm2) μg(̃φ∗) (Nm) (̃φ∗) σ2 g (Nm)2 FE SSO [48] SAA iSSO 47.2 47.3 48.1 67.5 68.3 66.4 42.7 40.7 42.6 9.4 10.5 8.5 30.1 30.3 31.4 55.6 49.5 56.5 13.1 14.8 12.5 242.3 243.5 242.8 5294.2 5407.4 5317.2 54,700 3 × 106 14,937",
        "type": "Table"
    },
    {
        "element_id": "1161c0dc-0188-4d57-82fd-8383aab98381",
        "metadata": {},
        "text": "10",
        "type": "Footer"
    },
    {
        "element_id": "6b30e83f-6006-4552-9cb7-e93842dce151",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "30fa5c95-fc0c-4c4e-a9a1-ac765107ad07",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "4a690bb6-fa25-44eb-bafd-634e000119d6",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "01862314-762f-4687-82ec-464f6554de24",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "34a9e494-355f-4c6c-9b99-994b1ab030cf",
        "metadata": {},
        "text": "Viscous Damper ar Isolator",
        "type": "Image"
    },
    {
        "element_id": "de5ca0b7-df0d-4eda-946f-617e44046b9e",
        "metadata": {},
        "text": "Fig. 11. (left) 10-story base isolated shear model, and (right) force-deformation of bilinear isolator [49].",
        "type": "NarrativeText"
    },
    {
        "element_id": "26f0cad9-cd20-469d-a8fa-1ee78253ad75",
        "metadata": {},
        "text": "Table 4 Base isolation structure system optimization results (best of 10 independent runs).",
        "type": "UncategorizedText"
    },
    {
        "element_id": "24555d14-627e-49dc-9a66-a9a9763cb081",
        "metadata": {},
        "text": "/",
        "type": "UncategorizedText"
    },
    {
        "element_id": "9175a758-ee81-47c4-9862-59a0cdce5946",
        "metadata": {},
        "text": "S0 = σ2 ω πωg ( 2ζg 4ζ2 g + 1 )m2 s3,",
        "type": "Formula"
    },
    {
        "element_id": "08187539-68e1-4800-a1d1-52689d929e7d",
        "metadata": {},
        "text": "(27)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4a704a1f-fe73-49f2-9add-d935776a566f",
        "metadata": {},
        "text": "Method SSO [39] SAA iSSO Design parameters (φ*) Kpr (MN/ m) Fy (MN) 425.33 1.20 414.68 418.34 1.16 1.11 Kp (MN/ m) 15.52 16.15 15.88 cd (MNs/ m) 6.54 6.26 7.08 Failure probability PF(φ*) 0.0340 0.0324 0.0366",
        "type": "Table"
    },
    {
        "element_id": "3b59f21e-fcfd-4d1c-adc6-80d9248bb370",
        "metadata": {},
        "text": "where, ωg, ζgand σω are the resonant frequency, damping, and RMS of the acceleration input of the filter, respectively. These are also considered uncertain variables with mean values of [2πrad/s, 0.5, 0.2g] and a c.o.v equal to 0.20. The non-stationarity of the excitation is modeled by multiplying the filter output with the envelope function as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "6a818294-9a45-4331-b260-f1a776a8a07f",
        "metadata": {},
        "text": "e(t) = Ast“'exp( — dat), (28)",
        "type": "Formula"
    },
    {
        "element_id": "4309b956-c2d6-4a43-9707-bb5b68798d1a",
        "metadata": {},
        "text": "(28)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "98989bc9-9a6b-4d02-9a34-376216849a01",
        "metadata": {},
        "text": "optimization of a base-isolation system attached to a 10-story building as shown in Fig. 11. This optimization problem includes maximizing the reliability of the base-isolated structure which is performed by the minimization of its failure probability and mathematically expressed as: ∫",
        "type": "NarrativeText"
    },
    {
        "element_id": "6f1284fd-655b-4466-816c-a3d31bc09fdf",
        "metadata": {},
        "text": "P(F|φ) = Eθ[IF(φ, θ)] = IF(φ, θ)p(φ, θ)dθ, Θ",
        "type": "Formula"
    },
    {
        "element_id": "1eacf36c-2ef6-4e5e-bb4b-8b6eddc06a6d",
        "metadata": {},
        "text": "minimize : φ∈Φ",
        "type": "Title"
    },
    {
        "element_id": "265c77cb-fe05-4499-ae7c-40a321f5f05e",
        "metadata": {},
        "text": "Θ",
        "type": "Title"
    },
    {
        "element_id": "a6ae8df5-ca13-4a28-8402-7c7fc1d6e3ce",
        "metadata": {},
        "text": "where, IF(φ,θ) is the function that indicates failure, and it equals 1 when the system fails, i.e., when unacceptable performance occurs. Notably, in this problem h(φ, θ) = IF(φ,θ).",
        "type": "NarrativeText"
    },
    {
        "element_id": "a215d7ff-19b6-47e5-9593-df0e4ff859e1",
        "metadata": {},
        "text": "The 10-story building is considered as a shear structure with un- certain inter-story stiffness and damping. Each story has a total mass of 207 ton. The inter-story stiffness ki of all stories are parameterized by ki = ̂ kiθi, i = 1, …, 10 where the most probable values of the inter-story stiffness are [̂ ki] = [687.1, 613.1, 540.1, 481.1, 421.7, 353.7, 286.6, 225.6, 184.5, 104.5] MN/m. The entity θi is a set of non-dimensional uncertain variables that are considered to be correlated Gaussian vari- ̂θi = 1, ∀i and a covariance matrix defined",
        "type": "NarrativeText"
    },
    {
        "element_id": "d6731565-0ffe-4620-99d4-c79cde425449",
        "metadata": {},
        "text": "ables with a unit mean value as: [",
        "type": "Title"
    },
    {
        "element_id": "74f79819-c542-49e1-a2a9-95e0d827fc55",
        "metadata": {},
        "text": ")]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a2483159-5339-4688-81df-c828281b086e",
        "metadata": {},
        "text": "[ = (0.2)2exp",
        "type": "UncategorizedText"
    },
    {
        "element_id": "27c523a4-26bb-488f-adcf-096d578b1208",
        "metadata": {},
        "text": "i)2 /",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a8d6e170-9ae8-4d31-a98f-3e09fdfd535a",
        "metadata": {},
        "text": "] .",
        "type": "UncategorizedText"
    },
    {
        "element_id": "a0fd4256-3ee2-4cba-83e3-7467d6e00ef8",
        "metadata": {},
        "text": "E[(0;—9;)(0; —9;)] = (0.2)°exp[ — Gi)” /2]. (25)",
        "type": "Formula"
    },
    {
        "element_id": "09ce090a-d50b-46e2-b820-be43001d3a26",
        "metadata": {},
        "text": "E",
        "type": "Title"
    },
    {
        "element_id": "1d2b1203-6a9f-459d-a879-390a113c3ab2",
        "metadata": {},
        "text": "(24)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "935ad3ec-762a-4aea-a48b-d9a3235ef089",
        "metadata": {},
        "text": "(25)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "8a39e5e0-33a0-4518-bdd9-f1e373a7ff25",
        "metadata": {},
        "text": "with parameters λ1 = 1.25, λ2 = 0.2 and λ3 = 0.353 chosen to simulate strong earthquake excitation for a duration of 40 s with a sampling time of 0.02 s. The base-isolation system considered is a lead–rubber bilinear isolator with an additional viscous damper. The base has a 247-ton mass. The design parameters φ for the base isolation structure system are the stiffness before yielding Kprand after yielding Kp, the yield force is Fy, and the damping coefficient cd. The reader may refer to [39,50] for additional details regarding the base isolation structure system adopted in this study.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c909f47a-0723-41c5-a85d-7149ad18a4ae",
        "metadata": {},
        "text": "Failure is indicated when any of the normalized base displacements or inter-story drifts exceeds unity. The normalization constants are 0.5 m and 0.033 m respectively. The design interval for each variable is specified as Kpr = [50, 600] MN/m, Fy = [1, 8] MN, Kp = [5, 60] MN/m, and cd = [0.1, 10]MNs/m. In this example, iSSO and SSO are imple- mented with six number of iterations.",
        "type": "NarrativeText"
    },
    {
        "element_id": "01135529-b18b-43f5-bf02-505e1a4e7119",
        "metadata": {},
        "text": "Table 4 shows the optimization results for the best 10 independent simulation runs. The comparison of the results obtained using SSO, SAA (with a sample size of 103), and iSSO shows that the optimal design obtained using the proposed approach iSSO is in good agreement. The failure probability of the structure is reduced from 0.95 (without the base isolation system) to 0.0326 after installing the optimally designed base isolation system.",
        "type": "NarrativeText"
    },
    {
        "element_id": "4b77d9eb-c0c8-4d73-9d4a-272e5927e1bd",
        "metadata": {},
        "text": "The damping ratios are considered independent Gaussian variables with mean values of 0.025 and c.o.v of 0.10 for all modes. The Kanai- Tajimi model is used to simulate the ground excitation modelled as a filtered white noise process, with the power spectral density function given as:",
        "type": "NarrativeText"
    },
    {
        "element_id": "2f56c1b5-d192-4256-b9ce-fe6914e4c0ee",
        "metadata": {},
        "text": "of +402. 020\" Sw) = S22 ee (26) (w _ o) + 4Cw20? = So",
        "type": "Formula"
    },
    {
        "element_id": "5b14fab1-d510-45b4-95df-7e52f463e4d3",
        "metadata": {},
        "text": "(26)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fc1ce8e2-0505-4bb6-b79f-18ced6d5878c",
        "metadata": {},
        "text": "5. Conclusion",
        "type": "Title"
    },
    {
        "element_id": "87b2bee6-4248-4f3d-9e0e-921d7bff09a0",
        "metadata": {},
        "text": "5. Conclusion",
        "type": "ListItem"
    },
    {
        "element_id": "8c194655-13ac-4bcc-9d8b-45d601c165cc",
        "metadata": {},
        "text": "This study attempts to provide an optimization approach called \"iSSO\", which is an improved version of SSO, primarily for stochastic optimization problems while it retains utility for deterministic optimi- zation problems as well. Two novel ideas are introduced in this study: first, a better characterization of the design space is offered by parti- tioning the design space into non-overlapping subregions using Voronoi",
        "type": "NarrativeText"
    },
    {
        "element_id": "18c658fc-961c-4b9f-a9bd-34a18e7520ff",
        "metadata": {},
        "text": "11",
        "type": "Footer"
    },
    {
        "element_id": "a50f7680-254b-4e4d-abcd-08637e3d522d",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "a1fd4064-ec5c-4cad-bb9c-0df68e15d313",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Header"
    },
    {
        "element_id": "ee05525c-a7e9-481b-8550-56a22316ba2b",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "Header"
    },
    {
        "element_id": "46f117a8-fc3f-40e4-8a5f-4c859489414e",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "6dad8c44-a7d2-47a0-b880-6e5af9dd9620",
        "metadata": {},
        "text": "tessellation which improves the effectiveness and efficiency of the pro- posed iSSO considerably in comparison to SSO. Second, a novel \"double sort\" approach is proposed, eliminating the need for optimization to identify the subregions for the optimal design at each iSSO iteration. Several mathematical and engineering design examples, including TMD, 120 bars truss structure, and base-isolated structure, are included in this study to demonstrate the efficacy of the proposed iSSO. The results show that the proposed iSSO effectively identifies the reduced design space for complex design problems with multiple global and local minima. This is attributable to the Voronoi tessellation, which eliminates the require- ment of the presumed admissible design space form to resemble the contour of the original design. Voronoi tessellation enabled better design space exploration, allowing multiple global minima scattered throughout the design pace to be effectively identified. Due to the dis- cretization of the design space via Voronoi tessellation, computation demand is significantly reduced as the number of function evaluations for all examples is lower vis-a-vis the original SSO. Moreover, the novel idea of the double sort approach achieves the requisite precision in identifying the subregions for optimal solutions and makes iSSO implementation simple and effective.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9b15d7af-4b27-497a-a281-b313bf98d91c",
        "metadata": {},
        "text": "Voronoi cells. At present the methods available in the literation for creating the Voronoi tessellation are computationally demanding when considering problems of very high dimension. Future work will focus on developing a method for creating the Voronoi tessellation in higher di- mensions, particularly those greater than ten.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cab02df8-6de5-43a6-b666-b8db36c62509",
        "metadata": {},
        "text": "CRediT authorship contribution statement",
        "type": "Title"
    },
    {
        "element_id": "f40bb967-096b-47d0-afe2-4ce88c53d6ab",
        "metadata": {},
        "text": "Mohd Aman Khalid: Investigation, Methodology, Formal analysis, Software, Visualization, Writing – original draft. Sahil Bansal: Conceptualization, Methodology, Supervision.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ddb7185e-5687-4a87-aa51-89efecbf6731",
        "metadata": {},
        "text": "Declaration of Competing Interest",
        "type": "Title"
    },
    {
        "element_id": "77a787fd-d576-4366-a391-d809fae611fc",
        "metadata": {},
        "text": "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a4f02627-57e8-48f3-80c4-49ed468d6f23",
        "metadata": {},
        "text": "Data availability",
        "type": "Title"
    },
    {
        "element_id": "43235dd6-52fe-4e0f-8283-6eecdb455a2c",
        "metadata": {},
        "text": "The applicability of the approach is dependent on the creation of the",
        "type": "NarrativeText"
    },
    {
        "element_id": "4e44892f-304d-4e15-8d7e-d9d7debea266",
        "metadata": {},
        "text": "No data was used for the research described in the article.",
        "type": "NarrativeText"
    },
    {
        "element_id": "9d062274-95db-406d-bca5-1582a65ddd93",
        "metadata": {},
        "text": "Appendix-A: Voronoi Tessellation",
        "type": "Title"
    },
    {
        "element_id": "fb299a6a-ab17-43b8-86ab-9de6b0fc8dea",
        "metadata": {},
        "text": "Voronoi tessellation is a mathematical concept named after the Russian mathematician Georgy Voronoi. It is also known as the Voronoi diagram or Dirichlet tessellation. A Voronoi tessellation of a set of points P in a plane is a partition of the plane into a set of non-overlapping convex polygons, with each polygon including precisely one point of P and each point in a polygon being closer to its associated point in P than to any other point in P. Each polygon is referred to as a Voronoi cell or a Dirichlet region. The boundary of each cell is constituted of points that are equidistant to two or more points in P. Fig. 12 shows the Voronoi diagram in a two-dimensional design space.",
        "type": "NarrativeText"
    },
    {
        "element_id": "165c7728-3309-428b-95c6-2c17f499be84",
        "metadata": {},
        "text": "Voronoi cell generator sample Voronoi cell edge Voronoi cell vertex",
        "type": "Image"
    },
    {
        "element_id": "7ac62aec-9c63-4c4e-9118-9d5efb6d34cc",
        "metadata": {},
        "text": "Fig. 12. Voronoi diagram in 2-dimensional space.",
        "type": "Title"
    },
    {
        "element_id": "72a7a068-ebc9-4bd0-8292-39a860e6568f",
        "metadata": {},
        "text": "There are several efficient algorithms for creating Voronoi diagrams. One such basic algorithm is to start with a set of points and then compute the Voronoi cells by dividing the space into regions based on the distance to the nearest point. The Bowyer-Watson algorithm [51], which generates a Delaunay triangulation in any number of dimensions, can be applied while creating a Voronoi diagram. The Delaunay triangulation is a triangulation of the point in which no point falls within the circumcircle of any triangle. The polygon generated by the intersection of the half-planes defined by the edges of the Delaunay triangles enclosing the point is therefore obtained as the Voronoi cell of a point.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3ae2e6a6-c865-4425-bd32-dd7fcf02a375",
        "metadata": {},
        "text": "It can be summarized that Voronoi tessellation is a powerful mathematical concept that aids in dividing space into regions based on the distance to a set of points. Voronoi tessellation finds widespread applications in areas such as image processing [52], spatial topology analysis [53], and microstructure study [52]. The MATLAB command \"Voronoin\" from the \"Parallel Computing Toolbox\" [54] has been used in this study to create the Voronoi cells.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e551c31e-6758-417a-94c6-7f3b3f38e54f",
        "metadata": {},
        "text": "References",
        "type": "Title"
    },
    {
        "element_id": "0443b1c8-dbb0-4398-9794-7dae1aeb087d",
        "metadata": {},
        "text": "[1] Marti K. Stochastic optimization methods. Berlin: Springer; 2008.",
        "type": "ListItem"
    },
    {
        "element_id": "a6673599-b698-4d4b-91a2-da3ff8af08de",
        "metadata": {},
        "text": "[1] Marti K. Stochastic optimization methods. Berlin: Springer; 2008. [2] Tsompanakis Y, Lagaros ND, Papadrakakis M. Structural design optimization",
        "type": "NarrativeText"
    },
    {
        "element_id": "07442a0b-a451-4e02-b13d-49cce8313bee",
        "metadata": {},
        "text": "[2] Tsompanakis Y, Lagaros ND, Papadrakakis M. Structural design optimization vba > considering uncertainties. CRC Press; 2008.",
        "type": "ListItem"
    },
    {
        "element_id": "576951a5-2492-44df-a54a-b668f6bc2599",
        "metadata": {},
        "text": "considering uncertainties. CRC Press; 2008.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a14b19de-b2aa-48b6-b0a3-b53ed9d885b4",
        "metadata": {},
        "text": "[3] Khalid MA, Bansal S, Ramamohan V. An augmented formulation for robust design optimization of structures using stochastic simulation method. Res Eng Des 2023; 34:179–200. https://doi.org/10.1007/s00163-022-00405-z.",
        "type": "NarrativeText"
    },
    {
        "element_id": "11eaf28b-ba21-4d0d-a0e6-6cbee87f3f2b",
        "metadata": {},
        "text": "[4] Meng Z, Li G, Wang X, Sait SM, Rıza A. A comparative study of metaheuristic algorithms for reliability ‑ based design optimization problems. Arch Comput Methods Eng 2021;28:1853–69. https://doi.org/10.1007/s11831-020-09443-z.",
        "type": "ListItem"
    },
    {
        "element_id": "c6f35c1e-31b4-4421-9767-fe0826043f87",
        "metadata": {},
        "text": "[5] Abualigah L, Elaziz MA, Khasawneh AM, Alshinwan M. Meta-heuristic optimization algorithms for solving real-world mechanical engineering design problems : a comprehensive survey, applications, comparative analysis, and results. Neural Comput Appl 2022;34:4081–110. https://doi.org/10.1007/s00521- 021-06747-4.",
        "type": "ListItem"
    },
    {
        "element_id": "80907ae0-bdcc-4d85-8490-517666c8c8e0",
        "metadata": {},
        "text": "[6] Katebi J, Shoaei M, Nguyen S, Trung T, Khorami M. Developed comparative",
        "type": "ListItem"
    },
    {
        "element_id": "f2be1cea-b2ed-4e4c-886c-fcc63b98d3ed",
        "metadata": {},
        "text": "analysis of metaheuristic optimization algorithms for optimal active control of",
        "type": "Title"
    },
    {
        "element_id": "7699e209-1870-4088-bf41-895076660c11",
        "metadata": {},
        "text": "12",
        "type": "Footer"
    },
    {
        "element_id": "eba435e1-eaad-452f-ae6e-c48199fd4af0",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "9cd9a661-623a-4370-9b86-0b6357128b1d",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "ab7c9373-a102-4af1-b826-b704960c016b",
        "metadata": {},
        "text": "Advances in Engineering Software 188 (2024) 103568",
        "type": "NarrativeText"
    },
    {
        "element_id": "88fab141-3e04-4a22-8532-b4bbc619ec68",
        "metadata": {},
        "text": "M.A. Khalid and S. Bansal",
        "type": "Title"
    },
    {
        "element_id": "c54c1394-daed-45b6-8c8a-324aca868227",
        "metadata": {},
        "text": "structures. Eng Comput 2020;36:1539–58. https://doi.org/10.1007/s00366-019- 00780-7.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f91ef32d-2a90-4fb7-8328-b40f5abcbcaf",
        "metadata": {},
        "text": "[7] Alorf A. Engineering applications of artificial intelligence a survey of recently developed metaheuristics and their comparative analysis. Eng Appl Artif Intell 2023;117:105622. https://doi.org/10.1016/j.engappai.2022.105622.",
        "type": "ListItem"
    },
    {
        "element_id": "abddfaab-4fb9-4184-94ab-487c73549116",
        "metadata": {},
        "text": "[8] Kirsch U. Structural optimization: fundamentals and applications. Springer-Verlag; 2012.",
        "type": "ListItem"
    },
    {
        "element_id": "667124fc-d21e-4c6a-b42e-de3f2fa3a693",
        "metadata": {},
        "text": "[9] Floudas CA, Pardalos PA. Encyclopedia of optimization. Springer; 2008.",
        "type": "ListItem"
    },
    {
        "element_id": "283e9d72-db56-452e-be80-dd152756e8d8",
        "metadata": {},
        "text": "[10] Kiureghian AD, Ditlevsen O. Aleatory or epistemic? Does it matter? Struct Saf 2009;31:105–12. https://doi.org/10.1016/j.strusafe.2008.06.020.",
        "type": "ListItem"
    },
    {
        "element_id": "e1b8ee64-034c-46b4-a323-99d93d04f718",
        "metadata": {},
        "text": "[11] Schu¨eller GI, Jensen HA. Computational methods in optimization considering uncertainties - an overview. Comput Methods Appl Mech Eng 2008;198:2–13. https://doi.org/10.1016/j.cma.2008.05.004.",
        "type": "NarrativeText"
    },
    {
        "element_id": "7a5f5445-ff39-4776-a741-d74ff5c3adec",
        "metadata": {},
        "text": "[12] Schneider J, Kirkpatrick S. Stochastic optimization. Springer; 2007.",
        "type": "ListItem"
    },
    {
        "element_id": "1b78adae-2f27-4645-b887-7c4e2f720d86",
        "metadata": {},
        "text": "[12] Schneider J, Kirkpatrick S. Stochastic optimization. Springer; 2007. [13] Do B, Ohsaki M. A random search for discrete robust design optimization of linear-",
        "type": "NarrativeText"
    },
    {
        "element_id": "66a0a7fa-760c-44d7-b87c-920c6c4f0886",
        "metadata": {},
        "text": "elastic steel frames under interval parametric uncertainty. Comput Struct 2021; 249:106506. https://doi.org/10.1016/j.compstruc.2021.106506.",
        "type": "ListItem"
    },
    {
        "element_id": "0b3a6535-ef59-49cd-8c53-9b6916d40e05",
        "metadata": {},
        "text": "[14] Asadpoure A, Tootkaboni M, Guest JK. Robust topology optimization of structures with uncertainties in stiffness - application to truss structures. Comput Struct 2011. https://doi.org/10.1016/j.compstruc.2010.11.004.",
        "type": "ListItem"
    },
    {
        "element_id": "cabc185a-4ae2-4645-9709-29a6384772e5",
        "metadata": {},
        "text": "[15] Doltsinis I, Kang Z. Robust design of structures using optimization methods. Comput Methods Appl Mech Eng 2004;193:2221–37. https://doi.org/10.1016/j. cma.2003.12.055.",
        "type": "ListItem"
    },
    {
        "element_id": "9ce9f2ae-9039-4f41-9f81-35b4e3f9a1a4",
        "metadata": {},
        "text": "[16] Carneiro G, das N, Ant´onio CC. Dimensional reduction applied to the reliability- based robust design optimization of composite structures. Compos Struct 2021; 255. https://doi.org/10.1016/j.compstruct.2020.112937.",
        "type": "ListItem"
    },
    {
        "element_id": "f1d91c76-3ee8-4fdf-acd8-13fe28b81b62",
        "metadata": {},
        "text": "[17] An H, Youn BD, Kim HS. Reliability-based design optimization of laminated",
        "type": "ListItem"
    },
    {
        "element_id": "9fc74679-f4b6-43c0-8f39-b20b1e0afa62",
        "metadata": {},
        "text": "composite structures under delamination and material property uncertainties. Int J Mech Sci 2021. https://doi.org/10.1016/j.ijmecsci.2021.106561.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0db66585-ccb2-4ceb-a060-22934c83b822",
        "metadata": {},
        "text": "[18] Li Z, Duan LB, Cheng AG, Yao ZP, Chen T, Yao W. Lightweight and crashworthiness design of an electric vehicle using a six-sigma robust design optimization method. Eng Optim 2019. https://doi.org/10.1080/0305215X.2018.1521396.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e05cb0c8-ed4f-46d7-9177-1cf7779b7fe9",
        "metadata": {},
        "text": "[19] Gholinezhad H, Torabi SH. Reliability-based multidisciplinary design optimization of an underwater vehicle including cost analysis. J Mar Sci Technol 2021. https:// doi.org/10.1007/s00773-021-00804-2.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ea596632-4121-4467-ba3c-41daee78a3bf",
        "metadata": {},
        "text": "[20] Lee KH, Park GJ. Robust optimization considering tolerances of design variables. Comput Struct 2001;79:77–86. https://doi.org/10.1016/S0045-7949(00)00117-6. [21] Anderson TV, Mattson CA. Propagating skewness and kurtosis through engineering models for low-cost, meaningful, nondeterministic design. J Mech Des Trans ASME. 2012. https://doi.org/10.1115/1.4007389.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0ce2504e-ba23-47c8-8ca1-8e8f0781959e",
        "metadata": {},
        "text": "[22] Zhou Q, Wang Y, Choi SK, Jiang P, Shao X, Hu J, Shu L. A robust optimization approach based on multi-fidelity metamodel. Struct Multidiscip Optim 2018. https://doi.org/10.1007/s00158-017-1783-4.",
        "type": "ListItem"
    },
    {
        "element_id": "e3f252f7-a964-45bd-8090-63153bf8ec99",
        "metadata": {},
        "text": "[23] Wang GG, Shan S. Review of metamodeling techniques in support of engineering design optimization. J Mech Des Trans ASME. 2007;129:370–80. https://doi.org/ 10.1115/1.2429697.",
        "type": "NarrativeText"
    },
    {
        "element_id": "245f531b-0149-46af-8c3e-c78f653d11da",
        "metadata": {},
        "text": "[24] Chatterjee T, Chakraborty S, Chowdhury R. A critical review of surrogate assisted robust design optimization. Arch Comput Methods Eng 2019;26:245–74. https:// doi.org/10.1007/s11831-017-9240-5.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b03c0ddb-6ab5-4dac-8649-199ecb975acb",
        "metadata": {},
        "text": "[25] Chatterjee T, Friswell MI, Adhikari S, Chowdhury R. A global two-layer meta-",
        "type": "ListItem"
    },
    {
        "element_id": "8ffba1ef-4b11-4ae2-aa6f-f155cb5c20f1",
        "metadata": {},
        "text": "model for response statistics in robust design optimization. Eng Optim 2021. https://doi.org/10.1080/0305215X.2020.1861262.",
        "type": "NarrativeText"
    },
    {
        "element_id": "6e85a49e-d1bd-4dce-b361-d56492932259",
        "metadata": {},
        "text": "[26] Guo X, Zhao X, Zhang W, Yan J, Sun G. Multi-scale robust design and optimization considering load uncertainties. Comput Methods Appl Mech Eng 2015;283: 994–1009. https://doi.org/10.1016/j.cma.2014.10.014.",
        "type": "NarrativeText"
    },
    {
        "element_id": "5cb50078-ac85-4c47-baa7-8eff5681adcd",
        "metadata": {},
        "text": "[27] Jerez DJ, Jensen HA, Beer M. Reliability-based design optimization of structural systems under stochastic excitation: an overview. Mech Syst Signal Process 2022. https://doi.org/10.1016/j.ymssp.2021.108397.",
        "type": "ListItem"
    },
    {
        "element_id": "37cce6ec-2486-4654-a70e-c2ecd5564fea",
        "metadata": {},
        "text": "[28] Li W, Gao L, Xiao M. Multidisciplinary robust design optimization under parameter and model uncertainties. Eng Optim 2020;52:426–45. https://doi.org/10.1080/ 0305215X.2019.1590564.",
        "type": "ListItem"
    },
    {
        "element_id": "2575ec7a-cecc-4e6f-b083-bd81b1e5638c",
        "metadata": {},
        "text": "[29] Beyer HG, Sendhoff B. Robust optimization - a comprehensive survey. Comput Methods Appl Mech Eng 2007;196:3190–218. https://doi.org/10.1016/j. cma.2007.03.003.",
        "type": "NarrativeText"
    },
    {
        "element_id": "a61be677-7c20-49b5-97e8-c6fed188b5c9",
        "metadata": {},
        "text": "[30] Motta R, de S, Afonso SMB. An efficient procedure for structural reliability-based robust design optimization. Struct Multidiscip Optim 2016;54:511–30. https://doi. org/10.1007/s00158-016-1418-1.",
        "type": "NarrativeText"
    },
    {
        "element_id": "8ada9ca8-b588-4385-be0a-42cfdcc033a1",
        "metadata": {},
        "text": "[31] Yildiz AR. Comparison of evolutionary-based optimization algorithms for",
        "type": "ListItem"
    },
    {
        "element_id": "a92b19a6-72c0-49bb-b1cc-a90c68ed2914",
        "metadata": {},
        "text": "structural design optimization. Eng Appl Artif Intell 2013;26:327–33. https://doi. org/10.1016/j.engappai.2012.05.014.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ee820cdd-a88a-42f1-82c3-372a3d2ae7d1",
        "metadata": {},
        "text": "[32] Beck AT, Gomes WJDS. A comparison of deterministic, reliability-based and risk- based structural optimization under uncertainty. Probab Eng Mech 2012;28:18–29. https://doi.org/10.1016/j.probengmech.2011.08.007.",
        "type": "ListItem"
    },
    {
        "element_id": "7aded6b2-a272-4c32-8430-3b9c1f5aede2",
        "metadata": {},
        "text": "[33] Acar, E., Bayrak, G., Jung, Y., Lee, I., Ramu, P., Ravichandran, S.S.: Modeling, analysis, and optimization under uncertainties: a review, (2021). 10.1007/s001 58-021-03026-7.",
        "type": "ListItem"
    },
    {
        "element_id": "c780f4cb-a354-4734-bea6-3fd350715afc",
        "metadata": {},
        "text": "[34] Georghiou A, Kuhn D, Wiesemann W. The decision rule approach to optimization under uncertainty: methodology and applications. Comput Manag Sci 2019. https://doi.org/10.1007/s10287-018-0338-5.",
        "type": "ListItem"
    },
    {
        "element_id": "bc0506f5-1861-4a3f-8c2c-97ec8fc79201",
        "metadata": {},
        "text": "[35] Braydi O, Lafon P, Younes R. Study of uncertainties and objective function modeling effects on probabilistic optimization results. ASCE ASME J Risk Uncertain Eng Syst Part B Mech Eng 2019. https://doi.org/10.1115/1.4044152.",
        "type": "ListItem"
    },
    {
        "element_id": "e41cf450-93fb-48eb-b778-526a39623ce3",
        "metadata": {},
        "text": "[36] Liu WS, Cheung SH. Reliability based design optimization with approximate failure probability function in partitioned design space. Reliab Eng Syst Saf 2017;167: 602–11. https://doi.org/10.1016/j.ress.2017.07.007.",
        "type": "ListItem"
    },
    {
        "element_id": "e808cf27-076a-4a2c-8b76-80c9cef96457",
        "metadata": {},
        "text": "[37] Chiralaksanakul A, Mahadevan S. First-order approximation methods in reliability- based design optimization. J Mech Des Trans ASME 2005. https://doi.org/ 10.1115/1.1899691.",
        "type": "NarrativeText"
    },
    {
        "element_id": "79700833-b75d-4167-a633-1fa9cf8939cc",
        "metadata": {},
        "text": "[38] Doltsinis I, Kang Z, Cheng G. Robust design of non-linear structures using",
        "type": "ListItem"
    },
    {
        "element_id": "5b458048-a0a0-451c-a350-9d9444112250",
        "metadata": {},
        "text": "optimization methods. Comput Methods Appl Mech Eng 2005;194:1779–95. https://doi.org/10.1016/j.cma.2004.02.027.",
        "type": "Title"
    },
    {
        "element_id": "6d6dec8a-081d-4462-bb0e-862416284ece",
        "metadata": {},
        "text": "[39] Taflanidis AA, Beck JL. Stochastic Subset Optimization for optimal reliability problems. Probab Eng Mech 2008. https://doi.org/10.1016/j. probengmech.2007.12.011.",
        "type": "ListItem"
    },
    {
        "element_id": "a1f44827-c659-47d7-b325-a889da8f07c7",
        "metadata": {},
        "text": "[40] Au SK, Beck JL. Estimation of small failure probabilities in high dimensions by subset simulation. Probab Eng Mech 2001;16:263–77. https://doi.org/10.1016/ S0266-8920(01)00019-4.",
        "type": "ListItem"
    },
    {
        "element_id": "77856a3b-627e-49ac-82cc-366788406e8b",
        "metadata": {},
        "text": "[41] Jia GF, Taflanidis AA. Non-parametric stochastic subset optimization for optimal- reliability design problems. Comput Struct 2013;126:86–99. https://doi.org/ 10.1016/j.compstruc.2012.12.009.",
        "type": "ListItem"
    },
    {
        "element_id": "9fb4b615-44bc-4da4-a0f5-0f98b2251f7f",
        "metadata": {},
        "text": "[42] Taflanidis AA. Stochastic subset optimization incorporating moving least squares response surface methodologies for stochastic sampling. Adv Eng Softw 2012;44: 3–14. https://doi.org/10.1016/j.advengsoft.2011.07.009.",
        "type": "ListItem"
    },
    {
        "element_id": "c3d5b88c-13d2-47fb-beb2-7356f0c0c807",
        "metadata": {},
        "text": "[43] Khalid MA, Bansal S. Framework for robust design optimization of tuned mass dampers by stochastic subset optimization. Int J Struct Stab Dyn 2023;23. https:// doi.org/10.1142/S0219455423501559.",
        "type": "ListItem"
    },
    {
        "element_id": "858d4f34-15ad-4f3c-8ec1-204bc272fd36",
        "metadata": {},
        "text": "[44] Au SK. Reliability-based design sensitivity by efficient simulation. Comput Struct",
        "type": "ListItem"
    },
    {
        "element_id": "e7c7ef5a-1715-429f-a0e1-47f830adc700",
        "metadata": {},
        "text": "2005;83:1048–61.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "cbf5796b-4939-4f4c-b1b8-cbca78f7f8b3",
        "metadata": {},
        "text": "[45] Taflanidis AA, Beck JL. An efficient framework for optimal robust stochastic system design using stochastic simulation. Comput Methods Appl Mech Eng 2008. https:// doi.org/10.1016/j.cma.2008.03.029.",
        "type": "ListItem"
    },
    {
        "element_id": "463a4ad1-727b-42fd-abde-f984c93b4c14",
        "metadata": {},
        "text": "[46] Robert CP, Casella G. Monte carlo statistical methods. New York, NY: Springer; 2004.",
        "type": "ListItem"
    },
    {
        "element_id": "a51f8da0-5b2d-422b-a825-b080eb40e963",
        "metadata": {},
        "text": "2004.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f199068a-8aa5-43fe-8483-d6b9cc989f37",
        "metadata": {},
        "text": "[47] Li HS. Subset simulation for unconstrained global optimization. Appl Math Model",
        "type": "ListItem"
    },
    {
        "element_id": "aa994101-fd9a-4546-91ad-e00b875ec503",
        "metadata": {},
        "text": "2011;35:5108–20. https://doi.org/10.1016/j.apm.2011.04.023.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4f74ff1a-17fa-489d-bcc5-b5971990f47a",
        "metadata": {},
        "text": "[48] Khalid MA, Bansal S, Ramamohan V. An augmented formulation for robust design optimization of structures using stochastic simulation method. Res Eng Des 2022. https://doi.org/10.1007/s00163-022-00405-z.",
        "type": "ListItem"
    },
    {
        "element_id": "a2697411-491f-43e7-8c8b-10276224516a",
        "metadata": {},
        "text": "[49] Taflanidis AA, Beck JL. An efficient framework for optimal robust stochastic system design using stochastic simulation. Comput Methods Appl Mech Eng 2008;198: 88–101. https://doi.org/10.1016/j.cma.2008.03.029.",
        "type": "ListItem"
    },
    {
        "element_id": "7367564e-4dc3-4dcf-98a8-19be59f23355",
        "metadata": {},
        "text": "[50] Kandemir EC, Mortazavi A. Optimization of seismic base isolation system using a fuzzy reinforced swarm intelligence. Adv Eng Softw 2022;174:103323. https://doi. org/10.1016/j.advengsoft.2022.103323.",
        "type": "NarrativeText"
    },
    {
        "element_id": "98582a68-90b6-4239-9f6a-c2ba742987d1",
        "metadata": {},
        "text": "[51] Rebay S. Efficient unstructured mesh generation by means of delaunay",
        "type": "ListItem"
    },
    {
        "element_id": "6221c1c2-baf2-4ad3-baf2-55ad3fff58ec",
        "metadata": {},
        "text": "triangulation and Bowyer-Watson algorithm. J Comput Phys 1993;106:125–38. [52] Wade N, Graham-Brady L. Estimating microstructural feature distributions from image data using a Bayesian framework. J Microsc 2023:1–16. https://doi.org/ 10.1111/jmi.13184.",
        "type": "NarrativeText"
    },
    {
        "element_id": "698a0140-cfc7-49cd-a968-846ba46fe575",
        "metadata": {},
        "text": "[53] Duan X, Li L, Ge Y, Liu B. Exact Voronoi diagram for topographic spatial analysis. GIScience Remote Sens 2023;60. https://doi.org/10.1080/ 15481603.2023.2171703.",
        "type": "ListItem"
    },
    {
        "element_id": "da1f6eef-f82d-4bd8-9de5-68fe1c27aad1",
        "metadata": {},
        "text": "[54] MATLAB and parallel computing toolbox release. Natick, Massachusetts, United",
        "type": "ListItem"
    },
    {
        "element_id": "19476bd6-2942-408d-87f0-aa7a307ff24f",
        "metadata": {},
        "text": "States: The Mathworks, Inc.; 2021.",
        "type": "Title"
    },
    {
        "element_id": "d1679d6f-1443-48bd-aeaf-d81846ad706f",
        "metadata": {},
        "text": "13",
        "type": "Footer"
    }
]