{
    "publication_date": "Unknown",
    "title": "Fuzzy logic based MPPT control for a PV system using SEPIC converter",
    "authors": [
        "Moulay Abdellah Alhachemi",
        "Mohammed Habbab",
        "Abdeldjebar Hazzab",
        "Mansour Becahr",
        "Hicham Gouabi"
    ],
    "institutes": [
        "Laboratory of CAOSEE",
        "École de Technologie Supérieure",
        "Université Tahri Mohamed",
        "Université Tahri Mohamed (ETS)",
        "1100 Notre-dame Bechar, Algeria",
        "Bechar, Algeria",
        "Montréal, Canada"
    ],
    "keywords": [
        "Fuzzy logic controller (FLC)",
        "Maximum power point tracker (MPPT)",
        "Photovoltaic (PV)"
    ],
    "abstract": "In this study, a novel single-ended primary inductor (SEPIC) converter-based fuzzy logic controller for maximum power point tracking is presented. By adding rules to the perturb and observing search strategy, the new controller enhances it while fuzzifying and removing its flaws. When compared to traditional maximum power point tracking techniques, fuzzy logic trackers enable an accurate and quick convergence to maximum power point under both steady-state and variable weather situations. The performance of the proposed maximum power point tracker is demonstrated in simulation.",
    "content": "I. INTRODUCTION\nThe non-renewable energy sources are rapidly running out, while the electricity demand is increasing daily. To solve this problem, efficient and efficient electric power generation from renewable energy sources is required [1]. Renewable energy is one of the forms of energy that society can rely on because It is unpolluted, pure, and has no limits. One type of power generation that uses renewable energy is the photovoltaic (PV) system [2]. To utilize less conventional energy, the PV system must subsequently be linked to the grid, either directly or via a backup battery bank. Since the power produced by PV systems depends on radiation and temperature change, the PV framework has destitute productivity, [2]. For the control of the PV systems, there are different sorts of DC-DC converters such as Buck converters, Boost converters, and Buck-Boost converters. Due to its output pick-up adaptability, a single-ended primary-inductor converter (SEPIC) acts as a buck-boost DC/DC converter, where it changes its output voltage agreeing to its duty cycle. Unlike the customary buck-boost converter, the SEPIC converter includes a non-inverted output and it uses an arrangement capacitor to separate input from output [3]. The buck and buck-boost converters lose half of their input control due to input current arrangement exchange; for that reason, the two types of converters should be excluded from maximum power applications. The boost converter has a nonstop input current, but the output voltage is always bigger than the input, which may not accomplish maximum power exchange operation in a few cases, such as when the maximum voltage is less than the input [3]. This paper presents a fuzzy-based P&O strategy for an MPPT standalone PV system. The proposed MPPT can abuse the preferences of the P&O strategy and eliminate its drawbacks. Output has been separated into five fuzzy subsets. As the proposed strategy continuously exchanges maximum power from PV arrays, it optimizes the number of PV modules.\n\nII. MODELIGN OF PV SYSTEM\nPhotovoltaic is the technique and study connected to devices that directly convert sunlight into electricity utilizing photovoltaic semiconductors. Direct conversion of solar energy into DC electrical energy can be achieved by photovoltaic cells [4]. The photovoltaic panel is made up of numerous cells that are connected in series Ns or shunt Nsh. Where it may be mimicked by a current source coupled in parallel with a diode as described by and depicted in Figure 1 [5].\n\nFig. 1. Circuit for a PV array."
}