{
    "publication_date": "11-07-2022",
    "title": "Numerical computing in engineering mathematics",
    "authors": [
        "Firuz Kamalov",
        "Ho-Hon Leung"
    ],
    "institutes": [
        "Department of Electrical Engineering, Canadian University Dubai, Dubai, UAE",
        "Department of Mathematical Sciences, United Arab Emirates University, Al Ain, UAE"
    ],
    "keywords": [
        "engineering mathematics",
        "numerical computing",
        "education",
        "Industry 4.0"
    ],
    "abstract": "The rapid advances in technology over the last decade have significantly altered the nature of engineering knowledge and skills required in the modern industries. In response to the changing professional requirements, engineering institutions have updated their curriculum and pedagogical practices. However, most of the changes in the curriculum have been focused on the core engineering courses without much consideration for the auxiliary courses in mathematics and sciences. In this paper, we aim to propose a new, augmented mathematics curriculum aimed at meeting the requirements of the modern, technology-based engineering workplace. The proposed updates require minimal resources and can be seamlessly integrated into the existing curriculum.",
    "content": "1. INTRODUCTION\n\nThe 4th Industrial Revolution has had a dramatic impact on the engineering profession. The modern technologies such as artificial intelligence, the internet of things, and advanced robotics have altered engineering systems and processes. Today's engineers are expected to be able to leverage these resources to produce their products. To meet the new professional requirements, engineering educational institutions have revised their curricula. The changes in the curricula include both updating the existing programs as well as introducing completely new programs. Given the rapid technological progress, universities and colleges around the world are continuously adapting to the ever-changing environment. While a significant progress in modernizing the engineering curriculum has been achieved, there still remains room for improvement. Catalyzed by the exponential increase in computational power and interconnectedness, the modern industrial revolution has reshaped the skills and competencies required of the engineers. The changes in engineering curricula in response to Industry 4.0 have been threefold: i) modernizing the existing programs, ii) introduction of new programs, and iii) revising the pedagogical approach. Modernizing the existing programs involves introduction of new courses in the study plan related to emerging technologies. In addition, existing courses can be updated with new content. Fresh new programs in emerging technologies are also introduced by universities and colleges. Many institutions now offer degrees in artificial intelligence and mechatronics which were not there 20 years ago. Finally, universities have revised their approaches to course delivery. Student-centered learning, project-based learning, and applied learning have become popular in the new engineering educational paradigm. While significant effort has been made to revise the core engineering courses, the auxiliary courses in mathematics and sciences received little consideration. The mathematics and sciences courses play a key role in the engineering curriculum. Given their importance, the curriculum updates must also be extended to the auxiliary courses. By implementing a comprehensive update of the engineering curriculum that includes both the core and auxiliary courses, a more effective outcome can be achieved. The goal of this paper is to propose a modernized engineering mathematics curriculum in line with the broader efforts to update engineering education to adapt to Industry 4.0. The key feature of the new curriculum is the introduction numerical computing in the existing mathematics courses. The latest industrial revolution has been driven largely by the dramatic increase in computational power. Therefore, today's engineers must be well-equipped to leverage the computing power in their work. Since mathematics courses are usually taken at the beginning of the study plan, it offers a natural avenue for introducing numerical computing to students. Furthermore, many problems in mathematics can be solved numerically making it natural to integrate numerical computing in mathematics courses. By studying numerical computing in mathematics courses, students will acquire the necessary theoretical and practical skills to apply in their downstream, specialized engineering courses. This paper is structured as follows. Section 2 provides an overview of the existing efforts to update the engineering curriculum in response to Industry 4.0. Section 3 discusses the current approaches to integrate scientific computing in mathematics courses. In Section 4, we present our proposal for modernizing the mathematics curriculum to integrate numerical computing. Section 5 concludes the paper with final remarks."
}