{
    "publication_date": "7-12-2023",
    "title": "SMT 2.0: A Surrogate Modeling Toolbox with a focus on hierarchical and mixed variables Gaussian processes",
    "authors": [
        "Paul Saves",
        "Rémi Lafage",
        "Nathalie Bartoli",
        "Youssef Diouane",
        "Jasper Bussemaker",
        "Thierry Lefebvre",
        "John T. Hwang",
        "Joseph Morlier",
        "Joaquim R.R.A. Martins"
    ],
    "institutes": [
        "ONERA/DTIS, Université de Toulouse, Toulouse, France",
        "ISAE-SUPAERO, Université de Toulouse, Toulouse, France",
        "Polytechnique Montréal, Montreal, QC, Canada",
        "German Aerospace Center (DLR), Institute of System Architectures in Aeronautics, Hamburg, Germany",
        "University of California San Diego, Department of Mechanical and Aerospace Engineering, La Jolla, CA, USA",
        "ICA, Université de Toulouse, ISAE–SUPAERO, INSA, CNRS, MINES ALBI, UPS, Toulouse, France",
        "University of Michigan, Department of Aerospace Engineering, Ann Arbor, MI, USA"
    ],
    "keywords": [
        "Surrogate modeling",
        "Gaussian process",
        "Kriging",
        "Hierarchical problems",
        "Hierarchical and mixed-categorical inputs",
        "Meta variables"
    ],
    "abstract": "The Surrogate Modeling Toolbox (SMT) is an open-source Python package that offers a collection of surrogate modeling methods, sampling techniques, and a set of sample problems. This paper presents SMT 2.0, a major new release of SMT that introduces significant upgrades and new features to the toolbox. This release adds the capability to handle mixed-variable surrogate models and hierarchical variables. These types of variables are becoming increasingly important in several surrogate modeling applications. SMT 2.0 also improves SMT by extending sampling methods, adding new surrogate models, and computing variance and kernel derivatives for Kriging. This release also includes new functions to handle noisy and use multi-fidelity data. To the best of our knowledge, SMT 2.0 is the first open-source surrogate library to propose surrogate models for hierarchical and mixed inputs. This open-source software is distributed under the New BSD license.",
    "content": "1. Motivation and significance\n\nWith the increasing complexity and accuracy of numerical models, it has become more challenging to run complex simulations and computer codes [1,2]. As a consequence, surrogate models have been recognized as a key tool for engineering tasks such as design space exploration, uncertainty quantification, and optimization [3]. In practice, surrogate models are used to reduce the computational effort of these tasks by replacing expensive numerical simulations with closed-form approximations [4, Ch. 10]. To build such a model, we start by evaluating the original expensive simulation at a set of points through a Design of Experiments (DoE). Then, the corresponding evaluations are used to build the surrogate model according to the chosen approximation, such as Kriging, quadratic interpolation, or least squares regression. The Surrogate Modeling Toolbox (SMT) is an open-source frame- work that provides functions to efficiently build surrogate models [5]. Corresponding author at: ONERA/DTIS, Université de Toulouse, Toulouse, France. E-mail addresses: paul.saves@onera.fr (P. Saves), remi.lafage@onera.fr (R. Lafage), nathalie.bartoli@onera.fr (N. Bartoli), youssef.diouane@polymtl.ca (Y. Diouane), jasper.bussemaker@dlr.de (J. Bussemaker), thierry.lefebvre@onera.fr (T. Lefebvre), jhwang@eng.ucsd.edu (J.T. Hwang), joseph.morlier@isae-supaero.fr (J. Morlier), jrram@umich.edu (J.R.R.A. Martins). 1 All authors contributed to this work, research and manuscript. 2 https://github.com/SMTorg/SMT\n\nKriging models (also known as Gaussian processes) that take advantage of derivative information are one of SMTs key features [6]. Numerical experiments have shown that SMT achieved lower prediction error and computational cost than Scikit-learn [7] and UQLab [8] for a fixed number of points [9]. SMT has been applied to rocket engine coaxial-injector optimization [10], aircraft engine consumption mod- eling [11], numerical integration [12], multi-fidelity sensitivity analy- sis [13], high-order robust finite elements methods [14,15], planning for photovoltaic solar energy [16], wind turbines design optimiza- tion [17], porous material optimization for a high pressure turbine vane [18], chemical process design [19] and many other applications. In systems engineering, architecture-level choices significantly in- fluence the final system performance, and therefore, it is desirable to consider such choices in the early design phases [20]. Architectural choices are parameterized with discrete design variables; examples in- clude the selection of technologies, materials, component connections, https://doi.org/10.1016/j.advengsoft.2023.103571 Received 22 August 2023; Received in revised form 23 October 2023; Accepted 26 November 2023"
}