{
    "title": "SMT 2.0: A Surrogate Modeling Toolbox with a focus on hierarchical and mixed variables Gaussian processes",
    "authors": [
        "Paul Saves",
        "Rémi Lafage",
        "Nathalie Bartoli",
        "Youssef Diouane",
        "Jasper Bussemaker",
        "Thierry Lefebvre",
        "John T. Hwang",
        "Joseph Morlier",
        "Joaquim R.R.A. Martins"
    ],
    "institutes": [
        "ONERA/DTIS, Université de Toulouse, Toulouse, France",
        "ISAESUPAERO, Université de Toulouse, Toulouse, France",
        "Polytechnique Montréal, Montreal, QC, Canada",
        "German Aerospace Center (DLR), Institute of System Architectures in Aeronautics, Hamburg, Germany",
        "University of California San Diego, Department of Mechanical and Aerospace Engineering, La Jolla, CA, USA",
        "ICA, Université de Toulouse, ISAESUPAERO, INSA, CNRS, MINES ALBI, UPS, Toulouse, France",
        "University of Michigan, Department of Aerospace Engineering, Ann Arbor, MI, USA"
    ],
    "keywords": [
        "Surrogate modeling",
        "Gaussian process",
        "Kriging",
        "Hierarchical problems",
        "Hierarchical and mixedcategorical inputs",
        "Meta variables"
    ],
    "abstract": "The Surrogate Modeling Toolbox (SMT) is an opensource Python package that offers a collection of surrogate modeling methods, sampling techniques, and a set of sample problems. This paper presents SMT 2.0, a major new release of SMT that introduces significant upgrades and new features to the toolbox. This release adds the capability to handle mixedvariable surrogate models and hierarchical variables. These types of variables are becoming increasingly important in several surrogate modeling applications. SMT 2.0 also improves SMT by extending sampling methods, adding new surrogate models, and computing variance and kernel derivatives for Kriging. This release also includes new functions to handle noisy and use multifidelity data. To the best of our knowledge, SMT 2.0 is the first opensource surrogate library to propose surrogate models for hierarchical and mixed inputs. This opensource software is distributed under the New BSD license.",
    "permissions": "2023 Elsevier Ltd. All rights reserved.",
    "content": "With the increasing complexity and accuracy of numerical models, it has become more challenging to run complex simulations and computer codes. As a consequence, surrogate models have been recognized as a key tool for engineering tasks such as design space exploration, uncertainty quantification, and optimization. In practice, surrogate models are used to reduce the computational effort of these tasks by replacing expensive numerical simulations with closedform approximations. The Surrogate Modeling Toolbox (SMT) is an opensource framework that provides functions to efficiently build surrogate models. Kriging models (also known as Gaussian processes) that take advantage of derivative information are one of SMTs key features. Numerical experiments have shown that SMT achieved lower prediction error and computational cost than Scikitlearn and UQLab for a fixed number of points. SMT has been applied to rocket engine coaxialinjector optimization, aircraft engine consumption modeling, numerical integration, multifidelity sensitivity analysis, highorder robust finite elements methods, planning for photovoltaic solar energy, wind turbines design optimization, porous material optimization for a high pressure turbine vane, chemical process design, and many other applications. In systems engineering, architecturelevel choices significantly influence the final system performance, and therefore, it is desirable to consider such choices in the early design phases. Architectural choices are parameterized with discrete design variables; examples include the selection of technologies, materials, component connections."
}