{
    "publication_date": "12-12-2023",
    "title": "Improved stochastic subset optimization method for structural design optimization",
    "authors": [
        "Mohd Aman Khalid",
        "Sahil Bansal"
    ],
    "institutes": [
        "Department of Civil Engineering, Indian Institute of Technology Delhi, New Delhi 110016, India"
    ],
    "keywords": [
        "Stochastic subset optimization",
        "Voronoi tessellation",
        "Stochastic simulation",
        "Stochastic optimization",
        "Optimization under uncertainty"
    ],
    "abstract": "The Stochastic Subset Optimization (SSO) algorithm was proposed for optimal reliability problems that mini- mizes the probability of system failure over the admissible space for the design parameters. It is based on the simulation of samples of the design parameters from an auxiliary Probability Density Function (PDF) and exploiting the information contained in these samples to identify subregions for the optimal design parameters within the original design space. This paper presents an improved version of SSO, named iSSO to overcome the shortcomings in the SSO. In the improved version, the Voronoi tessellation is implemented to partition the design space into non-overlapping subregions using the pool of samples distributed according to the auxiliary PDF. A double-sort approach is then used to identify the subregions for the optimal design. The iSSO is presented as a generalized design optimization approach primarily tailored for the stochastic structural systems but also adaptable to deterministic systems. Several optimization problems are considered to illustrate the effectiveness and efficiency of the proposed iSSO.",
    "content": "1. Introduction\nStructural optimization may be defined as the rational establishment of an economical structural design with the available resources while satisfying specific performance criteria. In general terms, the economy may be characterized by minimum weight, minimum cost, maximum utility, or even minimum probability of failure. Broadly, structural optimization can be categorized into deterministic and stochastic opti- mization [1,2]. The classical statement of unconstraint deterministic optimization is mathematically expressed as: minimize : φΦ g(φ) (1) where, φ = [φ1φnφ]T ΦRnφ is a set of deterministic adjustable pa- rameters that define the structural design, referred to herein as design parameters, g(φ) : RnφR is the objective function to be minimized, and Φ denotes the bounded admissible design space. The deterministic constraints can be considered by the appropriate definition of the ad- missible design space Φ for deterministic design parameters φ, as mentioned in [3]. In the deterministic structural optimization problem, the uncertainties in parameters are ignored, and fixed values are assumed for all the parameters. There are numerous optimizations approaches available in the literature, however, but its worth noting that no one-size-fits-all optimization approach is ideal for all sorts of problems [4–7]. The choice of optimization method is often determined by the specific characteristics of the problem, such as its complexity, dimensionality, constraints, and the nature of the objective function. As a result, there is always a scope for new approaches to be developed or the adaptation of existing methods to better suit specific problem clas- ses. A detailed discussion of deterministic optimization approaches can be found in the literature [8,9]. In any practical situation, several parameters, such as loadings, structural parameters, geometric parameters, operation conditions, etc., are either not known at the design stage or are subjected to random fluctuations that give rise to performance variability and affect the performance of a system [10]. These parameters are characterized as uncertain parameters. Deterministic structural optimization discards the impact of uncertainty and can result in improper design. Therefore, it is desirable to account for the uncertainty in the parameters during opti- mization by using the rational methods of probabilistic structural analysis [11]. Such structural optimization that accounts for un- certainties is called stochastic optimization [12]. Although stochastic optimization refers to any method that employs randomness within some communities, in this paper, we will only consider settings where"
}