{
    "title": "Large Language Model Augmented Narrative Driven Recommendations",
    "authors": [
        "Sheshera Mysore",
        "Andrew McCallum",
        "Hamed Zamani"
    ],
    "institutes": [
        "University of Massachusetts Amherst USA",
        "University of Massachusetts Amherst USA",
        "University of Massachusetts Amherst USA"
    ],
    "keywords": [],
    "abstract": "Narrativedriven recommendation (NDR) presents an information access problem where users solicit recommendations with verbose descriptions of their preferences and context, for example, travelers soliciting recommendations for points of interest while describ ing their likes/dislikes and travel circumstances. These requests are increasingly important with the rise of natural languagebased conversational interfaces for search and recommendation systems. However, NDR lacks abundant training data for models, and current platforms commonly do not support these requests. Fortunately, classical useritem interaction datasets contain rich textual data, e.g., reviews, which often describe user preferences and context this may be used to bootstrap training for NDR models. In this work, we explore using large language models (LLMs) for data augmentation to train NDR models. We use LLMs for authoring synthetic narrative queries from useritem interactions with few shot prompting and train retrieval models for NDR on synthetic queries and useritem interaction data. Our experiments demon strate that this is an effective strategy for training smallparameter retrieval models that outperform other retrieval and LLM baselines for narrativedriven recommendation.",
    "permissions": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org.",
    "content": "Recommender systems personalized to users are an important com ponent of several industryscale platforms [16, 17, 46]. These sys tems function by inferring users interests from their prior inter actions on the platform and making recommendations based on these inferred interests. While recommendations based on historical Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. RecSys 23, September 1822, 2023, Singapore, Singapore 2023 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 9798400702419/23/09...$15.00 https://doi.org/10.1145/3604915.3608829 interactions are effective, users soliciting recommendations often start with a vague idea about their desired target items or may desire recommendations depending on the context of use, often missing in historical interaction data (Figure 1). In these scenarios, it is common for users to solicit recommendations through long form narrative queries describing their broad interests and context. Information access tasks like these have been studied as narrative driven recommendations (NDR) for items ranging from books [5] and movies [18], to points of interest [1]. Bogers and Koolen [5] note these narrative requests to be common on discussion forums and several subreddits1, but, there is a lack of support for these complex natural language queries in current recommenders. However, with the emergence of conversational interfaces for information access tasks, support for complex NDR tasks is likely to become necessary. In this context, recent work has noted an increase in complex and subjective natural language requests com pared to more conventional search interfaces [13, 34]. Furthermore, the emergence of large language models (LLM) with strong lan guage understanding capabilities presents the potential for fulfilling such complex requests [9, 33]. This work explores the potential for repurposing historical useritem recommendation datasets, tra ditionally used for training collaborative filtering recommenders, with LLMs to support NDR. Specifically, given a users interactions, 𝐷𝑢, with items and their accompanying text documents (e.g., reviews, descriptions) 𝐷𝑢 = {𝑑𝑖}𝑁𝑢 𝑖=1, selected from a useritem interaction dataset I, we prompt InstructGPT, a 175B parameter LLM, to author a synthetic narrative query 𝑞𝑢 based on 𝐷𝑢 (Figure 2). Since we expect the query 𝑞𝑢 to be noisy and not fully representative of all the user reviews, 𝐷𝑢 is filtered to retain only a fraction of the reviews based on a languagemodel assigned likelihood of 𝑞𝑢 given a user doc ument, 𝑑𝑖. Then, a pretrained LM based retrieval model (110M parameters) is finetuned for retrieval on the synthetic queries and filtered reviews. Our approach, which we refer to as Mint2, follows from the observation that while narrative queries and suggestions are often made in online discussion forums, and could serve as training data, the number of these posts and the diversity of domains for which they are available is significantly smaller than the size and diversity of passively gathered useritem interaction datasets. E.g. while Bogers and Koolen [5] note nearly 25,000 narrative requests for books on the LibraryThing discussion forum, a publicly available useritem interaction dataset for Goodreads contains interactions with nearly 2.2M books by 460k users [43] . We empirically evaluate Mint in a publicly available test collec tion for point of interest recommendation: pointrec [1]. To train 1r/MovieSuggestions, r/booksuggestions, r/Animesuggest 2Mint: Data augMentation with INteraction narraTives. 777"
}