[
    " Fuzzy logic based MPPT control for a PV system \nusing SEPIC converter\n \n \nMoulay Abdellah Alhachemi \nMohammed Habbab \nAbdeldjebar Hazzab \nLaboratory of CAOSEE \nLaboratoire de CAOSEE \nÉcole de Technologie Supérieure \nUniversité Tahri Mohamed \nUniversité Tahri Mohamed \n(ETS) 1100 Notre-dame \nBechar, Algeria \nBechar, Algeria \nMontréal, Canada \nalhachemi.abdellah@univ-bechar.dz \nhabbab.mohamed@univ-bechar.dz \nHazzab.abdeldjebar@etsmtl.ca \n \n \n \nMansour Becahr \nHicham Gouabi \n \nLaboratory of CAOSEE \nÉcole de Technologie Supérieure \n \nUniversité Tahri Mohamed \n(ETS) 1100 Notre-dame \n \nBechar, Algeria \nMontréal, Canada \n \nbechar.mensour@univ-bechar.dz \nhicham.gouabi.1@ens.etsmtl.ca \n \n    Abstract—In this study, a novel single-ended primary inductor \n(SEPIC) converter-based fuzzy logic controller for maximum \npower point tracking is presented. By adding rules to the perturb \nand observing search strategy, the new controller enhances it while \nfuzzifying and removing its flaws. When compared to traditional \nmaximum power point tracking techniques, fuzzy logic trackers \nenable an accurate and quick convergence to maximum power \npoint under both steady-state and variable weather situations. The \nperformance of the proposed maximum power point tracker is \ndemonstrated in simulation. \n \nKeywords: Fuzzy logic controller (FLC), Maximum power point \ntracker (MPPT), Photovoltaic (PV) \nI. INTRODUCTION \n    The non-renewable energy sources are rapidly running out, \nwhile the electricity demand is increasing daily. To solve this \nproblem, efficient and efficient electric power generation from \nrenewable energy sources is required [1]. Renewable energy is \none of the forms of energy that society can rely on because It \nis unpolluted, pure, and has no limits. One type of power \ngeneration that uses renewable energy is the photovoltaic (PV) \nsystem [2]. To utilize less conventional energy, the PV system \nmust subsequently be linked to the grid, either directly or via a \nbackup battery bank. Since the power produced by PV \nsystems depends on radiation and temperature change, the PV \nframework has destitute productivity, [2]. \n   For the control of the PV systems, there are different sorts of \nDC-DC converters such as Buck converters, Boost converters, \nand Buck-Boost converters. Due to its output pick-up \nadaptability, a single-ended primary-inductor converter \n(SEPIC) acts as a buck-boost DC/DC converter, where it \nchanges its output voltage agreeing to its duty cycle. Unlike the \ncustomary buck-boost converter, the SEPIC converter includes \na non-inverted output and it uses an arrangement capacitor to \nseparate input from output [3]. The buck and buck-boost \nconverters lose half of their input control due to input current \narrangement exchange; for that reason, the two types of \nconverters should be excluded from maximum power \napplications. The boost converter has a nonstop input current, \nbut the output voltage is always bigger than the input, which \nmay not accomplish maximum power exchange operation in a \nfew cases, such as when the maximum voltage is less than the \ninput [3]. \n    This paper presents a fuzzy-based P&O strategy for an MPPT \nstandalone PV system. The proposed MPPT can abuse the \npreferences of the P&O strategy and eliminate its drawbacks. \nOutput has been separated into five fuzzy subsets. As the \nproposed strategy continuously exchanges maximum power \nfrom PV arrays, it optimizes the number of PV modules. \nII. MODELIGN OF PV SYSTEM  \n    Photovoltaic is the technique and study connected to devices \nthat directly convert sunlight into electricity utilizing \nphotovoltaic semiconductors. Direct conversion of solar energy \ninto DC electrical energy can be achieved by photovoltaic cells \n[4]. The photovoltaic panel is made up of numerous cells that \nare connected in series Ns or shunt Nsh. Where it may be \nmimicked by a current source coupled in parallel with a diode \nas \ndescribed \nby \nand \ndepicted \nin \nFigure \n1 \n[5]. \n \nFig. 1. Circuit for a PV array. \n \n",
    " \nThe following equations provide the output current: \nI = Iph − ID                                                                          (1) \n \nI = Iph − I0 [exp (\nq(V+RsI)\nAKBT ) − 1] − \nV+RsI\nRsh                            (2) \n \nIph ∶ Photo − current                            A ∶ Ideality factor   \nKB ∶ Constant of Boltzmann                  T ∶ Cell temperature   \nID ∶  Current via a diode                        Rs ∶ Series resistance   \nI0 ∶  Current of Saturation                     q ∶ Electronic charge   \nRsh ∶ Shunt resistance                          V ∶ Cell voltage \nI ∶ Current of cell   \n \n  The shunt resistance (Rsh) is typically orders of magnitude \nlarger than the series resistance (Rs) [6]. Therefore, it is \ncommon for the shunt and series resistances of a solar cell can \nbe neglected to simplify the model. The resulting ideal voltage-\ncurrent characteristic of the solar cell is given by equation (3). \nI = Iph − I0 [e(qV\nKT) − 1]                                                        (3)  \nIII. SEPIC CONVERTER \nPower electronics researchers are working hard to create DC-\nDC converters with simpler designs and greater efficiency [7]. \nTo maintain a constant output voltage, the suggested DC-to-DC \nconverter employs a single-ended primary-inductor converter \n(SEPIC) architecture. The SEPIC converter is made up of a duty \ncycle switch S, a diode, two inductors (L1 and L2), two \ncapacitors (C1 and C2), and a load resistor. Figure 2 depicts the \ncircuit diagram of a SEPIC converter.  A SEPIC is a DC-DC \nconverter [8]. SEPIC are DC-DC converters that can output \nvoltages that are B, larger than, or equal to the input voltage. \nThe duty cycle of the control transistor affects the SEPIC \nconverter's output voltage. The SEPIC converter is two \nconverters in one: a boost converter followed by a buck-boost \nconverter. It has the advantages of having a non-inverted output \n(the output voltage has the same polarity as the input voltage) , \nusing a series capacitor to couple energy from the input to the \noutput (which makes it more responsive to short-circuits), and \nbeing able to shut down completely: when the switch \"S\" is \nturned off, the output voltage drops to 0 V, accompanied by a \nsignificant transient discharge of charge. \n \n \nFig. 2. Simple circuit diagram of the SEPIC converter \n \nFigure 3 depicts the circuit when the power switch is switched \non and off (in Figures a and b, respectively).  Figure 3a When \nthe switch is on, the first inductor, L1 is charged from the input \nvoltage source. The second inductor L2 absorbs energy from \nthe first capacitor C1, leaving the output capacitor C2 to supply \nthe load current. \n \nFig. 3.a. The switch turned on. \n \n \nFig. 3.b. The switch turned off. \nFig. 3. Equivalent circuit diagram of the SEPIC converter \nwhen the switch is on and off. \n \n  When the switch is turned on, the input inductor is charged \nfrom the source, and the second inductor is charged from the \nfirst capacitor. No energy is supplied to the load capacitor \nduring this time. The inductor current and capacitor voltage \npolarities are marked in this Figure. When the power switch is \nturned off, the energy stored in the inductor is transferred. The \nenergy stored is transferred through the diode and supplies the \nenergy to the load [10], as shown in Figure 3. b. The second \ninductor is also connected to the load during this time. The \noutput capacitor sees a pulse of current during the off time, \nmaking it inherently noisier than a buck converter. The amount \nthat the SEPIC converters increase or decrease the voltage \ndepends primarily on the duty cycle and the parasitic elements \nin the circuit. The output of an ideal SEPIC converter is: \nVout = \nD\n1−D Vin                                                                       (4) \n \n   A SEPIC converter is to process the electricity from the PV \nsystem. This converter either increases or decreases the PV \nsystem voltage at the load. The proposed SEPIC converter \noperates in buck mode. \nIV. FUZZY LOGIC CONTROL \n     In the fuzzy logic maximum power point tracking (MPPT) \nalgorithm, the voltage and current at each instant k are \nmeasured to calculate the active power. The active power is \nthen compared with the power at the previous instant (k-1) to \nobtain the change in power (ΔP(k)). Similarly, the voltage at \ninstant k is compared with the voltage at instant k-1 to obtain \n",
    " \nthe voltage error (ΔV(k)) [11]. The power error is then divided \nby the current error to obtain the error (E). The error is then \ncompared with the previous error to calculate the change in \nerror (ΔE(k)). The error (E(k)) and the change in error (ΔE(k)) \nare then used as the crisp inputs to the fuzzy logic controller. \nThe flow chart for the fuzzy logic MPPT algorithm is shown in \nFigure 4. In this work, the Mamdani inference technique, A-\ntype membership functions, and a 25-element rule base were \nused for the fuzzy logic control. The Mamdani inference \ntechnique is efficient and straightforward in defining the fuzzy \noutput sets, and it is more popular among researchers than other \ninference techniques \n[12]. The A-type or triangular \nmembership function is used because it is simpler to split into \nlow and high membership functions (MFs) than other \nmembership functions. Additionally, it has been observed that \nthe triangular membership function has a faster response and \nless overshoot than other functions [13]. A 25-element rule base \nwas used because it has been shown to perform well [14][15].  \n \n \n \n \nFig. 4. Fuzzy logic maximum power point tracking (MPPT) \nflow chart. \n \n    The following are the fuzzy rules in Table 1, which are used \nfor the desired MPP of push-pull converter PWM. The \nmembership for input variables (DPpv, DVpv) are shown in \nFigure 5, and the membership for output variable (DVpv*) is \nshown in Figure 6. All the functions are defined on a normalized \ninterval [-1 1]. \n \n \nTable. 1. Fuzzy logic rules for the push-pull converter. NB, \nnegative big; NS, negative small; ZE, zero; PS, positive small; \nPB, positive big. \n∆Vpv*[o/p] \n∆Vpv*[i/p] \n \n \nNB \nNS \nZE \nPS \nPB \n \nNB \nPS \nNB \nNB \nNB \nNS \n∆Ppv*[i/p] \nNS \nPS \nPS \nNS \nNS \nNS \n \nZE \nZE \nZE \nZE \nZE \nZE \n \nPS \nNS \nNS \nPS \nPS \nPS \n \nPB \nNS \nNB \nPB \nPB \nPS \n \n \nFig. 5.  Membership for input variables. \n",
    " \n \nFig. 6.  Membership for output variable. \nV. SIMULATION RESULTS \n  The characteristics of the photovoltaic array that we use in \nthis paper are given in Table 2. \n \n \nTable. 2. Electrical data of photovoltaic array. \n \nVariable \nValue \nMaximum Power \nPmax = 200 W \nOpen circuit voltage \nVoc = 36.1 V \nShort circuit current \nIsc = 200 A \nVoltage at maximum power \nVmax = 29.3 V \nCurrent at maximum power \nImax = 6.9 A \n \n   Table 3 shows the SEPIC converter settings utilized in this \nstudy. The SEPIC converter is linked to the PV panel in the full \nmodel, and the duty cycle is regulated by the Fuzzy Logic \nController. \n \nTable. 3. The SEPIC converter parameters. \nVariable \nValue \nSwitching frequency \n20 KHZ \nLoad resistance \nRLoad= 4.29 Ω \nInductance L1 \nL1 = 3.6 MH \nInductance L2 \nL2 = 0.9 MH \nCapacitor C1 \nC1 = 180 µF \nCapacitor C2 \nC2 = 6000 µF \n \n   The results are provided under standard test conditions; \nG=1000 W/m2; T=25°C and it is shown in figure 7. \n \nFig. 7.a. Current. \n \nFig. 7.b. Voltage. \n \nFig. 7.c. Power. \nFig. 7. Voltage, current, and power output results; at G=1000 \nW/m2 and T=25°C. \n",
    " \n  Overall, using MPPT and fuzzy logic to a SEPIC converter for \na PV system result in considerable performance gains. \nIncreased power output, higher efficiency, decreased ripple, \nenhanced transient response, and resilience are examples of \nthese enhancements. \nⅥ. CONCLUSIONS  \n     This paper presents the design of an off-grid photovoltaic \nsystem with a fuzzy logic MPPT-controlled push-pull boost \nconverter. \nThe \nproposed \nsystem \nwas \nsimulated \nin \nMATLAB/Simulink and tested under various weather \nconditions. The results showed that the fuzzy logic algorithm \noutperformed the conventional algorithms in terms of MPPT \naccuracy and minimization of fluctuations, regardless of rapid \nchanges in irradiance. \nREFERENCES \n[1] G. Mahendran, and KV. Kandaswamy. “Ant Colony Optimized Tuned \nDC-DC converter.” International Journal of Computer Applications \n(0975–8887) 108.11 (2013): 45-50. \n[2] J. Dunia, and BMM Mwinyiwiwa. “Performance Comparison between \nĆUK and SEPIC Converters for Maximum Power Point Tracking Using \nIncremental Conductance Technique in Solar Power Applications.” \nInternational Journal of Electrical, Computer, Energetic, Electronic and \nCommunication Engineering 7.12 (2013): 2510-2517. \n[3] M. Cirrincione, M. Pucci, and G. Vitale, “Growing Neural Gas (GNG)-\nBased Maximum Power Point Tracking for High-Performance Wind \nGenerator With an Induction Machine.” IEEE Transactions on Industry \nApplications 47.2 (2011): 861-872. \n[4] M. Abdulkadir, AS. Samosir, S., and AHN. Yatim. “Modeling and \nSimulation of a Solar Photovoltaic System, Its Dynamics and Transient \nCharacteristics in LABVIEW.\" International Journal of Power Electronics \nand Drive System (IJPEDS) 3.2 (2013): 185-192. \n[5] H. Bouzeria, C. Fetha, T. Bahi, I. Abadlia, Z. Layate, and S. Lekhchine. \n“Fuzzy Logic Space Vector Direct Torque Control of PMSM for \nPhotovoltaic Water Pumping System.” Energy Procedia 74 (2015): 760-\n771. \n[6] YM. Chen, YC. Liu, SC. Hung, and CS. Cheng. “Multi-Input Inverter for \nGrid-Connected Hybrid PV/Wind Power System.” IEEE Transactions on \nPower Electronics 22.3 (2007): 742-750. \n[7] S. Ganesh, J. Janani, and GB. Angel. “A Maximum Power Point Tracker \nfor PV Panels Using SEPIC Converter.”International Journal of \nElectrical, Computer, Energetic, Electronic and Communication \nEngineering 8.2 (2014): 637-642. \n[8] R. Vijayabalan, and S. Ravivarman. “Z Source Inverter for Photovoltaic \nSystem with Fuzzy Logic Controller.” International Journal of Power \nElectronics and Drive System (IJPEDS) 2.4 (2012): 371-379. \n[9] A. Ramkumar, and SVS. Florence. \"Analysis of Single Phase AC-DC \nSEPIC Converter using Closed Loop Techniques.” International Journal \nof Advanced Research in Electrical, Electronics and Instrumentation \nEngineering 4.2 (2015): 193-201. \n[10] G. Tadi, and P. Ramamurthyraju. “Analysis of SEPIC for PV-\nApplications using PI Controller and Current Mode Control.\" \nInternational Journal for Scientific Research & Development 1.9 (2013): \n175-180. \n[11] J. Li, and H. Wang. “A novel stand-alone PV generation system based on \nvariable step size INC MPPT and SVPWM control.\" In Proceedings of \nthe 2009 IEEE 6th International Power Electronics and Motion Control \nConference, Wuhan, China, 17-20 May 2009. pp. 2155-2160. \n[12] C. Wang. “A Study of Membership Functions on Mamdani-Type Fuzzy \nInference System for Industrial Decision-Making.” Master's thesis, \nLehigh University, Bethlehem, PA, USA, 2015. \n[13] MA. Usta, Ö. Akyazi, and İH. Altaş. “Design and performance of solar \ntracking system with fuzzy logic controller used different membership \nfunctions.” In Proceedings of the 2011 7th International Conference on \nElectrical and Electronics Engineering (ELECO), Bursa, Turkey, 1-4 \nDecember 2011. pp. II-381-II-385.Mudi, R.K.; Pal, N.R. A robust self-\ntuning scheme for PI-and PD-type fuzzy controllers. IEEE Trans. Fuzzy \nSyst. 1999, 7, 2–16. \n[14] RK. Mudi, and NR. Pal. “A robust self-tuning scheme for PI- and PD-\ntype fuzzy controllers.” IEEE Transactions on Fuzzy Systems 7.1 (1999): \n2-16. \n[15] A. Shehata, H.  Metered, and WAH. Oraby. “Vibration control of active \nvehicle suspension system using fuzzy logic controller.” In Vibration \nEngineering and Technology of Machinery, edited by W. A. Oraby, 389-\n399. Springer, Berlin, Heidelberg, 2015.  \n \n  \n"
]