[
    "[1] Minimax. Wikipedia. [Online] [Cited: April 23, 2008.] http://en.wikipedia.org/wiki/Minimax. ",
    "[2] Von Neumann, J: Zur theorie der gesellschaftsspiele Math. Annalen. 100 (1928) 295320 ",
    "[3] Automated Planning. Wikipedia. [Online] [Cited: April 23, 2008.] http://en.wikipedia.org/wiki/Automated_planning. ",
    "[4] SanchezRuiz, Antonio, et al. Game AI for a Turnbased Strategy Game with Plan Adaptation and Ontologybased retrieval. ",
    "[5] K. Erol, J. Hendler, and D. Nau (1994). Semantics for hierarchical tasknetwork planning. Technical Report TR94 31, UMIACS. ",
    "[6] Smith, S. J. J. and Dana S. Nau, T. A. Throp. A Planning approach decrarer play in contract bridge. Computational Intelligence. 1996, Vol. 12, 1. ",
    "[7] One Jump Ahead: Challenging Human Supremacy in Checkers. J.Schaeffer. s.l. : SpringerVerlag, 1997. ",
    "[8] IBM. How Deep Blue works. [Online] 1997. [Cited: April 23, 2008.] http://www.research.ibm.com/deepblue/meet/html/d.3.2.html ",
    "[9] Ghallab, Malik, Nau, Dana and Traverso, Paolo. Automated Planning theory and practice. s.l. : Morgan Kaufmann Publishers, May 2004. ISBN 1558608567. ",
    "[10] Case Based Reasoning. Experiences, Lessons and Future. Leake, David. s.l. : AAAI Press. MIT Press., 1997. ",
    "[11] Applying casebased reasoning: techniques for enterprise systems. Watson, I. San Francisco, CA, USA : Morgan Kaufmann Publishers Inc., 1998. ",
    "[12] Plaza, A. Aamodt and E. Casebased reasoning: Foundational issues, methodological. AI Communications. 1994, 7(i). ",
    "[13] Tictactoe. Wikipedia. [Online] [Cited: April 23, 2008.] http://en.wikipedia.org/wiki/Tictactoe. ",
    "[14] DíazAgudo, B. and GonzálezCalero, P. A. An architecture for knowledge intensive CBR systems. Advances in CaseBased Reasoning (EWCBR00). New York : SpringerVerlag, Berlin Heidelberg, 2000. ",
    "[15] Ilghami, Okhtay and Nau, Dana S. A General Approach to Synthesize ProblemSpecific Planners. 2003. 302 DIMEA 2008 3rd International Conference on Digital Interactive Media in Entertainment and Arts"
]