[
    "[1] G. Mahendran, and KV. Kandaswamy. Ant Colony Optimized Tuned DCDC converter. International Journal of Computer Applications (09758887) 108.11 (2013): 4550. ",
    "[2] J. Dunia, and BMM Mwinyiwiwa. Performance Comparison between ĆUK and SEPIC Converters for Maximum Power Point Tracking Using Incremental Conductance Technique in Solar Power Applications. International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 7.12 (2013): 25102517. ",
    "[3] M. Cirrincione, M. Pucci, and G. Vitale, Growing Neural Gas (GNG) Based Maximum Power Point Tracking for HighPerformance Wind Generator With an Induction Machine. IEEE Transactions on Industry Applications 47.2 (2011): 861872. ",
    "[4] M. Abdulkadir, AS. Samosir, S., and AHN. Yatim. Modeling and Simulation of a Solar Photovoltaic System, Its Dynamics and Transient Characteristics in LABVIEW.\" International Journal of Power Electronics and Drive System (IJPEDS) 3.2 (2013): 185192. ",
    "[5] H. Bouzeria, C. Fetha, T. Bahi, I. Abadlia, Z. Layate, and S. Lekhchine. Fuzzy Logic Space Vector Direct Torque Control of PMSM for Photovoltaic Water Pumping System. Energy Procedia 74 (2015): 760 771. ",
    "[6] YM. Chen, YC. Liu, SC. Hung, and CS. Cheng. MultiInput Inverter for GridConnected Hybrid PV/Wind Power System. IEEE Transactions on Power Electronics 22.3 (2007): 742750. ",
    "[7] S. Ganesh, J. Janani, and GB. Angel. A Maximum Power Point Tracker for PV Panels Using SEPIC Converter.International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 8.2 (2014): 637642. ",
    "[8] R. Vijayabalan, and S. Ravivarman. Z Source Inverter for Photovoltaic System with Fuzzy Logic Controller. International Journal of Power Electronics and Drive System (IJPEDS) 2.4 (2012): 371379. ",
    "[9] A. Ramkumar, and SVS. Florence. \"Analysis of Single Phase ACDC SEPIC Converter using Closed Loop Techniques. International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering 4.2 (2015): 193201. ",
    "[10] G. Tadi, and P. Ramamurthyraju. Analysis of SEPIC for PV Applications using PI Controller and Current Mode Control.\" International Journal for Scientific Research & Development 1.9 (2013): 175180. ",
    "[11] J. Li, and H. Wang. A novel standalone PV generation system based on variable step size INC MPPT and SVPWM control.\" In Proceedings of the 2009 IEEE 6th International Power Electronics and Motion Control Conference, Wuhan, China, 1720 May 2009. pp. 21552160. ",
    "[12] C. Wang. A Study of Membership Functions on MamdaniType Fuzzy Inference System for Industrial DecisionMaking. Master's thesis, Lehigh University, Bethlehem, PA, USA, 2015. ",
    "[13] MA. Usta, Ö. Akyazi, and İH. Altaş. Design and performance of solar tracking system with fuzzy logic controller used different membership functions. In Proceedings of the 2011 7th International Conference on Electrical and Electronics Engineering (ELECO), Bursa, Turkey, 14 December 2011. pp. II381II385.Mudi, R.K.; Pal, N.R. A robust self tuning scheme for PIand PDtype fuzzy controllers. IEEE Trans. Fuzzy Syst. 1999, 7, 216. ",
    "[14] RK. Mudi, and NR. Pal. A robust selftuning scheme for PI and PD type fuzzy controllers. IEEE Transactions on Fuzzy Systems 7.1 (1999): 216. ",
    "[15] A. Shehata, H. Metered, and WAH. Oraby. Vibration control of active vehicle suspension system using fuzzy logic controller. In Vibration Engineering and Technology of Machinery, edited by W. A. Oraby, 389 399. Springer, Berlin, Heidelberg, 2015."
]