[
    "[1] Abdul Majid, M., Huneiti, Z., Balachandran, W., & AlNaafa, M. A. (2012) A study of the effects of using MATLAB as a pedagogical tool for engineering mathematics students. 15th International Conference on Interactive Collaborative Learning (ICL), 10.1109/ICL.2012.6402183, Villach, Austria. ",
    "[2] Abdul Majid, M., Huneiti, Z. A., Balachandran, W., & Balarabe, Y. (2013) MATLAB as a teaching and learning tool for Mathematics: A literature review. International Journal of Arts and Sciences, 6(3), 2344. ",
    "[3] Brake, M. L. (2007) MATLAB as a Tool to Increase the Math Self Conﬁdence and the Math Ability of FirstYear Engineering Technology Students. The Scholarship of Teaching and Learning at EMU: Vol. 1, Article 5. ",
    "[4] Chen, J., Kolmos, A., & Du, X. (2021). Forms of implementation and challenges of PBL in engineering education: a review of literature. European Journal of Engineering Education, 46(1), 90115. ",
    "[5] Cretchley, P., Harman, C., Ellerton, N., & Fogarty, G. (2000) MATLAB in Early Undergraduate Mathematics: An investigation into the Effects of Scientiﬁc Software on Learning. Mathematics Education Research Journal, 12(3), 219233. ",
    "[6] Hadgraft, R. G., & Kolmos, A. (2020). Emerging learning environments in engineering education. Australasian Journal of Engineering Educa tion, 25(1), 316. ",
    "[7] HernandezdeMenendez, M., & MoralesMenendez, R. (2019). Tech nological innovations and practices in engineering education: a review. International Journal on Interactive Design and Manufacturing (IJIDeM), 13(2), 713728. ",
    "[8] HernandezdeMenendez, M., Guevara, A. V., Martınez, J. C. T., Alcantara, D. H., & MoralesMenendez, R. (2019). Active learning in engineering education. A review of fundamentals, best practices and ex periences. International Journal on Interactive Design and Manufacturing (IJIDeM), 13(3), 909922. ",
    "[9] Kamalov, F., Moussa, S., Zgheib, R., & Mashaal, O. (2020, December). Feature selection for intrusion detection systems. In 2020 13th Interna tional Symposium on Computational Intelligence and Design (ISCID) (pp. 265269). IEEE. ",
    "[10] Kamalov, F., Sulieman, H., & Santandreu Calonge, D. (2021). Machine learning based approach to exam cheating detection. Plos one, 16(8), e0254340. ",
    "[11] Kilicman, A., Hassan, M. A., & Said Husain, S. K. (2010) Teaching and Learning using Mathematics Software The New Challenge. Procedia Social and Behavioral Sciences, 8, 613619. ",
    "[12] Lorenz, M., Rußmann, M., Strack, R., Lueth, K. L., & Bolle, M. (2015). Man and machine in industry 4.0: How will technology transform the industrial workforce through 2025. The Boston Consulting Group, 2. ",
    "[13] Maurıcio, R. D. A., Veado, L., Moreira, R. T., Figueiredo, E., & Costa, H. (2018). A systematic mapping study on gamerelated methods for software engineering education. Information and software technology, 95, 201218. ",
    "[14] Mezhennaya, N. M. & Pugachev, O. V. (2019) On perception of computer algebra systems and microsoft excel by engineering students. Problems on Education in the 21st Century, 77(3), 379395. ",
    "[15] Miranda, J., Navarrete, C., Noguez, J., MolinaEspinosa, J. M., Ramırez Montoya, M. S., NavarroTuch, S. A., ... & Molina, A. (2021). The core components of education 4.0 in higher education: Three case studies in engineering education. Computers & Electrical Engineering, 93, 107278. ",
    "[16] Moore, K., & Frazier, R. S. (2017). Engineering education for generation Z. American Journal of Engineering Education (AJEE), 8(2), 111126. ",
    "[17] OrtizRojas, M., Chiluiza, K., & Valcke, M. (2019). Gamiﬁcation through leaderboards: An empirical study in engineering education. Computer Applications in Engineering Education, 27(4), 777788. ",
    "[18] Puhak, R. I. (2011). Teaching applied Calculus utilizing MATLAB, Proceedings of the TwentyThird Annual International Conference on Technology in Collegiate Mathematics, ISBN 0321689844, Copyright (C) 2012 by Pearson Education, Inc. ",
    "[19] RamirezMendoza, R. A., MoralesMenendez, R., Iqbal, H., & Parra Saldivar, R. (2018, April). Engineering Education 4.0:proposal for a new Curricula. In 2018 IEEE Global Engineering Education Conference (EDUCON) (pp. 12731282). IEEE. ",
    "[20] Salah, B., Abidi, M. H., Mian, S. H., Krid, M., Alkhalefah, H., & Abdo, A. (2019). Virtual realitybased engineering education to enhance manufacturing sustainability in industry 4.0. Sustainability, 11(5), 1477. ",
    "[21] Strayhorn, T. L. (2006). College in the information age: Gains associated with students use of technology. Journal of Interactive Online Learning, 5(2), 143155. ",
    "[22] Thabtah, F., Kamalov, F., & Rajab, K. (2018). A new computational intelligence approach to detect autistic features for autism screening. International journal of medical informatics, 117, 112124. ",
    "[23] Van den Beemt, A., MacLeod, M., Van der Veen, J., Van de Ven, A., van Baalen, S., Klaassen, R., & Boon, M. (2020). Interdisciplinary engineering education: A review of vision, teaching, and support. Journal of engineering education, 109(3), 508555."
]