[
    "[1] Mader CA, Martins JRRA, Alonso JJ, van der Weide E. ADjoint: An approach for the rapid development of discrete adjoint solvers. AIAA J 2008;46:86373. ",
    "[2] Kennedy M, OHagan A. Bayesian calibration of computer models. J R Stat Soc Ser B Stat Methodol 2001;63:42564. ",
    "[3] Hwang JT, Martins JRRA. A fastprediction surrogate model for large datasets. Aerosp Sci Technol 2018;75:7487. ",
    "[4] Martins JRRA, Ning A. Engineering design optimization. Cambridge University Press; 2021. ",
    "[5] Bouhlel MA, Hwang JT, Bartoli N, Lafage R, Morlier J, Martins JRA. A Python surrogate modeling framework with derivatives. Adv Eng Softw 2019;135:102662. ",
    "[6] Bouhlel MA, Martins J. Gradientenhanced kriging for highdimensional problems. Eng Comput 2019;35:15773. ",
    "[7] Pedregosa F, Varoquaux G, Gramfort A, Thirion VMB, Grisel O, et al. Scikitlearn: Machine learning in Python. J Mach Learn Res 2011;12:282530.",
    "[8] Lataniotis C, Marelli S, Sudret B. Uqlab 2.0 and uqcloud: opensource vs. cloudbased uncertainty quantification. In: SIAM conference on uncertainty quantification. 2022. ",
    "[9] Faraci A, Beaurepaire P, Gayton N. Review on Python toolboxes for Kriging surrogate modelling. In: ESREL. 2022. ",
    "[10] Krügener M, Zapata Usandivaras J, Bauerheim M, Urbano A. Coaxialinjector surrogate modeling based on Reynoldsaveraged NavierStokes simulations using deep learning. J Propuls Power 2022;38:78398. ",
    "[11] Ming D, Williamson D, Guillas S. Deep Gaussian process emulation using stochastic imputation. Technometrics 2022;112. ",
    "[12] Eliáš J, Vořechovsky M, Sadílekv V. Periodic version of the minimax distance criterion for Monte Carlo integration. Adv Eng Softw 2020;149:102900. ",
    "[13] Drouet V, Balesdent M, Brevault L, Dubreuil S, Morio J. Multifidelity algo rithm for the sensitivity analysis of multidisciplinary problems. J Mech Des 2023;145:122. ",
    "[14] Karban P, Pánek D, Orosz T, Petrášová I, Doležel I. FEM based robust design optimization with Agros and Artap. Comput Math Appl 2021;81:61833. ",
    "[15] Kudela J, Matousek R. Recent advances and applications of surrogate models for finite element method computations: a review. Soft Comput 2022;26:1370933. ",
    "[16] Chen Y, Dababneh F, Zhang B, Kassaee S, Smith BT, Liu K, et al. Surrogate mod eling for capacity planning of charging station equipped with photovoltaic panel and hydropneumatic energy storage. J Energy Res Technol 2020;142:050907. ",
    "[17] Jasa J, Bortolotti P, Zalkind D, Barter G. Effectively using multifidelity optimization for wind turbine design. Wind Energy Sci 2022;7:9911006. ",
    "[18] Wang W, Tao G, Ke D, Luo J, Cui J. Transpiration cooling of high pres sure turbine vane with optimized porosity distribution. Appl Therm Eng 2023;223:119831. ",
    "[19] Savage T, AlmeidaTrasvina HF, del RíoChanona EA, Smith R, Zhang D. An adaptive datadriven modelling and optimization framework for complex chemical process design. Comput Aided Chem Eng 2020;48:738. ",
    "[20] Chan A, Pires AF, Polacsek T. Trying to elicit and assign goals to the right actors. In: Conceptual modeling: 41st international conference. 2022. ",
    "[21] Hutter F, Osborne MA. A kernel for hierarchical parameter spaces. 2013, arXiv. ",
    "[22] Bussemaker JH, Ciampa PD, Nagel B. System architecture design space explo ration: An approach to modeling and optimization. In: AIAA aviation 2020 forum. 2020. ",
    "[23] Fouda MEA, Adler EJ, Bussemaker J, Martins JRRA, Kurtulus DF, Boggero L, et al. Automated hybrid propulsion model construction for conceptual aircraft design and optimization. In: 33rd congress of the international council of the aeronautical sciences. 2022. ",
    "[24] Bussemaker JH, Bartoli N, Lefebvre T, Ciampa PD, Nagel B. Effectiveness of surrogatebased optimization algorithms for system architecture optimization. In: AIAA aviation 2021 forum. 2021. ",
    "[25] Balandat M, Karrer B, Jiang D, Daulton S, Letham B, Wilson A, et al. BoTorch: A framework for efficient MonteCarlo Bayesian optimization. Adv Neural Inf Process Syst 2020;33:2152438. ",
    "[26] Adams B, Bohnhoff W, Dalbey K, Ebeida M, Eddy J, Eldred M, et al. Dakota, a multilevel parallel objectoriented framework for design optimization, pa rameter estimation, uncertainty quantification, and sensitivity analysis: Version 6.13 users manual. Technical report, Albuquerque, NM (United States: Sandia National Lab.(SNLNM); 2020. ",
    "[27] Roustant O, Ginsbourger D, Deville Y. DiceKriging, DiceOptim: Two R packages for the analysis of computer experiments by Krigingbased metamodeling and optimization. J Stat Softw 2012;51:155. ",
    "[28] Zhang Y, Tao S, Chen W, Apley D. A latent variable approach to Gaus sian process modeling with qualitative and quantitative factors. Technometrics 2020;62:291302. ",
    "[29] Chang TH, Wild SM. ParMOO: A Python library for parallel multiobjective simulation optimization. J Open Source Softw 2023;8:4468. ",
    "[30] GarridoMerchán EC, HernándezLobato D. Dealing with categorical and integervalued variables in Bayesian optimization with Gaussian processes. Neurocomputing 2020;380:2035. ",
    "[31] Halstrup M. Blackbox optimization of mixed discretecontinuous optimization problems (Ph.D. thesis), TU Dortmund; 2016. ",
    "[32] Roustant O, Padonou E, Deville Y, Clément A, Perrin G, Giorla J, et al. Group kernels for gaussian process metamodels with categorical inputs. SIAM J Uncertain Quant 2020;8:775806. ",
    "[33] Zhou Q, Qian PZG, Zhou S. A simple approach to emulation for computer models with qualitative and quantitative factors. Technometrics 2011;53:26673. ",
    "[34] Saves P, Diouane Y, Bartoli N, Lefebvre T, Morlier J. A mixedcategorical correlation kernel for Gaussian process. Neurocomputing 2023;550:126472. ",
    "[35] Pelamatti J, Brevault L, Balesdent M, Talbi EG, Guerin Y. Efficient global optimization of constrained mixed variable problems. J Global Optim 2019;73:583613. ",
    "[36] Horn D, Stork J, ler NJS, Zaefferer M. Surrogates for hierarchical search spaces: The WedgeKernel and an automated analysis. In: Proceedings of the genetic and evolutionary computation conference. 2019. ",
    "[37] Hung Y, Joseph VR, Melkote SN. Design and analysis of computer experiments with branching and nested factors. Technometrics 2009;51:35465. ",
    "[38] Audet C, HalléHannan E, Le Digabel S. A general mathematical framework for constrained mixedvariable blackbox optimization problems with meta and categorical variables. Oper Res Forum 2023;4:137. ",
    "[39] Saves P, Nguyen Van E, Bartoli N, Diouane Y, Lefebvre T, David C, Defoort S, Morlier J. Bayesian optimization for mixed variables using an adaptive dimension reduction process: applications to aircraft design. In: AIAA scitech 2022. 2022. ",
    "[40] Conde Arenzana R, LópezLopera A, Mouton S, Bartoli N, Lefebvre T. Multi fidelity Gaussian process model for CFD and wind tunnel data fusion. In: ECCOMAS aerobest. 2021. ",
    "[41] Rufato RC, Diouane Y, Henry J, Ahlfeld R, Morlier J. A mixedcategorical datadriven approach for prediction and optimization of hybrid discontinuous composites performance. In: AIAA aviation 2022 forum. 2022. ",
    "[42] Gorissen D, Crombecq K, Couckuyt I, Dhaene T, Demeester P. A surrogate modeling and adaptive sampling toolbox for computer based design. J Mach Learn Res 2010;11:20515. ",
    "[43] Williams CK, Rasmussen CE. Gaussian processes for machine learning. MA: MIT press Cambridge; 2006. ",
    "[44] Bouhlel MA, Bartoli N, Regis R, Otsmane A, Morlier J. Efficient Global Opti mization for highdimensional constrained problems by using the Kriging models combined with the Partial Least Squares method. Eng Optim 2018;50:203853. ",
    "[45] Bouhlel MA, He S, Martins J. Scalable gradientenhanced artificial neural networks for airfoil shape design in the subsonic and transonic regimes. Struct Multidiscip Optim 2020;61:136376. ",
    "[46] Kwan LS, Pitrou A, Seibert S. Numba: A LLVMbased python JIT compiler. In: Proceedings of the second workshop on the LLVM compiler infrastructure in HPC. 2015. ",
    "[47] Zaefferer M, Horn D. A first analysis of kernels for Krigingbased optimization in hierarchical search spaces. 2018, arXiv. ",
    "[48] Jin R, Chen W, Sudjianto A. An efficient algorithm for constructing optimal design of computer experiments. J Statist Plann Inference 2005;2:54554. ",
    "[49] Garnett R, Osborne M, Hennig P. Active learning of linear embeddings for Gaussian processes. In: Uncertainty in artificial intelligence Proceedings of the 30th conference. 2013. ",
    "[50] Jones D. A taxonomy of global optimization methods based on response surfaces. J Global Optim 2001;21:34583. ",
    "[51] Lafage R. egobox, a Rust toolbox for efficient global optimization. J Open Source Softw 2022;7:4737. ",
    "[52] Jones DR, Schonlau M, Welch WJ. Efficient global optimization of expensive blackbox functions. J Global Optim 1998;13:45592. ",
    "[53] Deng X, Lin CD, Liu K, Rowe RK. Additive Gaussian process for computer models with qualitative and quantitative factors. Technometrics 2017;59:28392. ",
    "[54] CuestaRamirez J, Le Riche R, Roustant O, Perrin G, Durantin C, Gliere A. A comparison of mixedvariables Bayesian optimization approaches. Adv Model Simul Eng Sci 2021;9:129. ",
    "[55] Rebonato R, Jaeckel P. The most general methodology to create a valid correlation matrix for risk management and option pricing purposes. J Risk 2001;2:1727. ",
    "[56] Rapisarda F, Brigo D, Mercurio F. Parameterizing correlations: a geometric interpretation. IMA J Manag Math 2007;18:5573. ",
    "[57] Bouhlel MA, Bartoli N, Regis R, Otsmane A, Morlier J. An improved approach for estimating the hyperparameters of the Kriging model for high dimensional problems through the Partial Least Squares method. Math Probl Eng 2016;2016:6723410. ",
    "[58] Cheng GH, Younis A, Hajikolaei KH, Wang GG. Trust region based mode pursuing sampling method for global optimization of high dimensional design problems. J Mech Des 2015;137:021407. ",
    "[59] Karlsson R, Bliek L, Verwer S, de Weerdt M. Continuous surrogatebased optimization algorithms are wellsuited for expensive discrete problems. In: Artificial intelligence and machine learning. 2021. ",
    "[60] Pelamatti J, Brevault L, Balesdent M, Talbi EG, Guerin Y. Bayesian optimization of variablesize design space problems. Opt Eng 2021;22:387447. ",
    "[61] Hebbal A, Brevault L, Balesdent M, Talbi EG, Melab N. Bayesian optimization using deep Gaussian processes with applications to aerospace system design. Opt Eng 2021;22:32161. ",
    "[62] Wildberger N. A rational approach to trigonometry. Math Horiz 2007;15:1620. ",
    "[63] Cho H, Kim Y, Lee E, Choi D, Lee Y, Rhee W. Basic enhancement strategies when using bayesian optimization for hyperparameter tuning of deep neural networks. IEEE Access 2020;8:52588608. ",
    "[64] Zuniga MM, Sinoquet D. Global optimization for mixed categoricalcontinuous variables based on Gaussian process models with a randomized categorical space exploration step. INFOR Inf Syst Oper Res 2020;58:31041. ",
    "[65] Lindauer M, Eggensperger K, Feurer M, AB, Deng D, Benjamins C, et al. SMAC3: A versatile Bayesian optimization package for hyperparameter optimization. J Mach Learn Res 2022;23:19. ",
    "[66] Picheny V, Berkeley J, Moss H, Stojic H, Granta U, Ober S, et al. Trieste: Efficiently exploring the depths of blackbox functions with TensorFlow. 2023, arXiv. ",
    "[67] CowenRivers AI, Ly W, Wang Z, Tutunov R, Jianye H, Wang J, et al. HEBO: Heteroscedastic evolutionary Bayesian optimisation. 2020, arXiv. ",
    "[68] Jiang H, Shen Y, Li Y, Zhang W, Zhang C, Cui B. OpenBox: A Python toolkit for generalized blackbox optimization. 2023, arXiv.",
    "[69] Kandasamy K, Vysyaraju KR, Neiswanger W, Paria B, Collins C, Schneider J, et al. Tuning hyperparameters without grad students: Scalable and robust bayesian optimisation with dragonfly. J Mach Learn Res 2020;21:3098124. ",
    "[70] Roy S, Crossley WA, Stanford BK, Moore KT, Gray JS. A mixed integer efficient global optimization algorithm with multiple infill strategy Applied to a wing topology optimization problem. In: AIAA scitech 2019 forum. 2019. ",
    "[71] Müller J, Shoemaker CA, Piché R. SOMI: A surrogate model algorithm for computationally expensive nonlinear mixedinteger blackbox global optimization problems. Comput Oper Res 2013;40:1383400. ",
    "[72] Tran T, Sinoquet D, Da Veiga S, Mongeau M. Derivativefree mixed binary necklace optimization for cyclicsymmetry optimal design problems. Opt Eng 2021. ",
    "[73] Meliani M, Bartoli N, Lefebvre T, Bouhlel MA, Martins JRRA, Morlier J. Multi fidelity efficient global optimization: Methodology and application to airfoil shape design. In: AIAA aviation 2019 forum. 2019. ",
    "[74] Lee H. Gaussian processes. Springer Berlin Heidelberg; 2011, p. 5757. ",
    "[75] LópezLopera AF, Idier D, Rohmer J, Bachoc F. Multioutput Gaussian processes with functional data: A study on coastal flood hazard assessment. Reliab Eng Syst Saf 2022;218:108139. ",
    "[76] Berthelin G, Dubreuil S, Salaün M, Bartoli N, Gogu C. Disciplinary proper orthogonal decomposition and interpolation for the resolution of parameterized multidisciplinary analysis. Internat J Numer Methods Engrg 2022;123:3594626. ",
    "[77] Cardoso I, Dubreuil S, Bartoli N, Gogu C, Salaün M, Lafage R. Disciplinary surrogates for gradientbased optimization of multidisciplinary systems. In: ECCOMAS Aerobest. 2023. ",
    "[78] Platt J, Penny S, Smith T, Chen T, Abarbanel H. A systematic exploration of reservoir computing for forecasting complex spatiotemporal dynamics. Neural Netw 2022;153:53052. ",
    "[79] Charayron R, Lefebvre T, Bartoli N, Morlier J. Multifidelity Bayesian optimiza tion strategy applied to overall drone design. In: AIAA scitech 2023 forum. 2023. ",
    "[80] Charayron R, Lefebvre T, Bartoli N, Morlier J. Towards a multifidelity and multiobjective Bayesian optimization efficient algorithm. Aerosp Sci Technol 2023;142:108673. ",
    "[81] Wold H. Soft modelling by latent variables: The nonlinear iterative partial least squares (NIPALS) approach. J Appl Probab 1975;12:11742. ",
    "[82] Priem R, Diouane Y, Bartoli N, Dubreuil S, Saves P. Highdimensional efficient global optimization using both random and supervised embeddings. In: AIAA aviation 2023 forum. 2023. ",
    "[83] Betz W, Papaioannou I, Straub D. Numerical methods for the discretization of random fields by means of the KarhunenLoève expansion. Comput Methods Appl Mech Engrg 2014;271:10929. ",
    "[84] Menz M, Dubreuil S, Morio J, Gogu C, Bartoli N, Chiron M. Variance based sen sitivity analysis for Monte Carlo and importance sampling reliability assessment with Gaussian processes. Struct Saf 2021;93:102116. ",
    "[85] Ginsbourger D, Le Riche R, Carraro L. Kriging is wellsuited to parallelize optimization. Springer Berlin Heidelberg; 2010, p. 13162. ",
    "[86] Roux E, Tillier Y, Kraria S, Bouchard PO. An efficient parallel global opti mization strategy based on Kriging properties suitable for material parameters identification. Arch Mech Eng 2020;67."
]