[
    "[1] Marti K. Stochastic optimization methods. Berlin: Springer; 2008. ",
    "[2] Tsompanakis Y, Lagaros ND, Papadrakakis M. Structural design optimization considering uncertainties. CRC Press; 2008. ",
    "[3] Khalid MA, Bansal S, Ramamohan V. An augmented formulation for robust design optimization of structures using stochastic simulation method. Res Eng Des 2023; 34:179200. https://doi.org/10.1007/s0016302200405z. ",
    "[4] Meng Z, Li G, Wang X, Sait SM, Rıza A. A comparative study of metaheuristic algorithms for reliability based design optimization problems. Arch Comput Methods Eng 2021;28:185369. https://doi.org/10.1007/s1183102009443z. ",
    "[5] Abualigah L, Elaziz MA, Khasawneh AM, Alshinwan M. Metaheuristic optimization algorithms for solving realworld mechanical engineering design problems : a comprehensive survey, applications, comparative analysis, and results. Neural Comput Appl 2022;34:4081110. https://doi.org/10.1007/s00521 021067474. ",
    "[6] Katebi J, Shoaei M, Nguyen S, Trung T, Khorami M. Developed comparative analysis of metaheuristic optimization algorithms for optimal active control of M.A. Khalid and S. Bansal",
    "[7] Alorf A. Engineering applications of artificial intelligence a survey of recently developed metaheuristics and their comparative analysis. Eng Appl Artif Intell 2023;117:105622. https://doi.org/10.1016/j.engappai.2022.105622. ",
    "[8] Kirsch U. Structural optimization: fundamentals and applications. SpringerVerlag; 2012. ",
    "[9] Floudas CA, Pardalos PA. Encyclopedia of optimization. Springer; 2008. ",
    "[10] Kiureghian AD, Ditlevsen O. Aleatory or epistemic? Does it matter? Struct Saf 2009;31:10512. https://doi.org/10.1016/j.strusafe.2008.06.020. ",
    "[11] Schueller GI, Jensen HA. Computational methods in optimization considering uncertainties an overview. Comput Methods Appl Mech Eng 2008;198:213. https://doi.org/10.1016/j.cma.2008.05.004. ",
    "[12] Schneider J, Kirkpatrick S. Stochastic optimization. Springer; 2007. ",
    "[13] Do B, Ohsaki M. A random search for discrete robust design optimization of linear elastic steel frames under interval parametric uncertainty. Comput Struct 2021; 249:106506. https://doi.org/10.1016/j.compstruc.2021.106506. ",
    "[14] Asadpoure A, Tootkaboni M, Guest JK. Robust topology optimization of structures with uncertainties in stiffness application to truss structures. Comput Struct 2011. https://doi.org/10.1016/j.compstruc.2010.11.004. ",
    "[15] Doltsinis I, Kang Z. Robust design of structures using optimization methods. Comput Methods Appl Mech Eng 2004;193:222137. https://doi.org/10.1016/j. cma.2003.12.055. ",
    "[16] Carneiro G, das N, Antonio CC. Dimensional reduction applied to the reliability based robust design optimization of composite structures. Compos Struct 2021; 255. https://doi.org/10.1016/j.compstruct.2020.112937. ",
    "[17] An H, Youn BD, Kim HS. Reliabilitybased design optimization of laminated composite structures under delamination and material property uncertainties. Int J Mech Sci 2021. https://doi.org/10.1016/j.ijmecsci.2021.106561. ",
    "[18] Li Z, Duan LB, Cheng AG, Yao ZP, Chen T, Yao W. Lightweight and crashworthiness design of an electric vehicle using a sixsigma robust design optimization method. Eng Optim 2019. https://doi.org/10.1080/0305215X.2018.1521396. ",
    "[19] Gholinezhad H, Torabi SH. Reliabilitybased multidisciplinary design optimization of an underwater vehicle including cost analysis. J Mar Sci Technol 2021. https:// doi.org/10.1007/s00773021008042. ",
    "[20] Lee KH, Park GJ. Robust optimization considering tolerances of design variables. Comput Struct 2001;79:7786. https://doi.org/10.1016/S00457949(00)001176. ",
    "[21] Anderson TV, Mattson CA. Propagating skewness and kurtosis through engineering models for lowcost, meaningful, nondeterministic design. J Mech Des Trans ASME. 2012. https://doi.org/10.1115/1.4007389. ",
    "[22] Zhou Q, Wang Y, Choi SK, Jiang P, Shao X, Hu J, Shu L. A robust optimization approach based on multifidelity metamodel. Struct Multidiscip Optim 2018. https://doi.org/10.1007/s0015801717834. ",
    "[23] Wang GG, Shan S. Review of metamodeling techniques in support of engineering design optimization. J Mech Des Trans ASME. 2007;129:37080. https://doi.org/ 10.1115/1.2429697. ",
    "[24] Chatterjee T, Chakraborty S, Chowdhury R. A critical review of surrogate assisted robust design optimization. Arch Comput Methods Eng 2019;26:24574. https:// doi.org/10.1007/s1183101792405. ",
    "[25] Chatterjee T, Friswell MI, Adhikari S, Chowdhury R. A global twolayer meta model for response statistics in robust design optimization. Eng Optim 2021. https://doi.org/10.1080/0305215X.2020.1861262. ",
    "[26] Guo X, Zhao X, Zhang W, Yan J, Sun G. Multiscale robust design and optimization considering load uncertainties. Comput Methods Appl Mech Eng 2015;283: 9941009. https://doi.org/10.1016/j.cma.2014.10.014. ",
    "[27] Jerez DJ, Jensen HA, Beer M. Reliabilitybased design optimization of structural systems under stochastic excitation: an overview. Mech Syst Signal Process 2022. https://doi.org/10.1016/j.ymssp.2021.108397. ",
    "[28] Li W, Gao L, Xiao M. Multidisciplinary robust design optimization under parameter and model uncertainties. Eng Optim 2020;52:42645. https://doi.org/10.1080/ 0305215X.2019.1590564. ",
    "[29] Beyer HG, Sendhoff B. Robust optimization a comprehensive survey. Comput Methods Appl Mech Eng 2007;196:3190218. https://doi.org/10.1016/j. cma.2007.03.003. ",
    "[30] Motta R, de S, Afonso SMB. An efficient procedure for structural reliabilitybased robust design optimization. Struct Multidiscip Optim 2016;54:51130. https://doi. org/10.1007/s0015801614181. ",
    "[31] Yildiz AR. Comparison of evolutionarybased optimization algorithms for structural design optimization. Eng Appl Artif Intell 2013;26:32733. https://doi. org/10.1016/j.engappai.2012.05.014. ",
    "[32] Beck AT, Gomes WJDS. A comparison of deterministic, reliabilitybased and risk based structural optimization under uncertainty. Probab Eng Mech 2012;28:1829. https://doi.org/10.1016/j.probengmech.2011.08.007. ",
    "[33] Acar, E., Bayrak, G., Jung, Y., Lee, I., Ramu, P., Ravichandran, S.S.: Modeling, analysis, and optimization under uncertainties: a review, (2021). 10.1007/s001 58021030267. ",
    "[34] Georghiou A, Kuhn D, Wiesemann W. The decision rule approach to optimization under uncertainty: methodology and applications. Comput Manag Sci 2019. https://doi.org/10.1007/s1028701803385. ",
    "[35] Braydi O, Lafon P, Younes R. Study of uncertainties and objective function modeling effects on probabilistic optimization results. ASCE ASME J Risk Uncertain Eng Syst Part B Mech Eng 2019. https://doi.org/10.1115/1.4044152. ",
    "[36] Liu WS, Cheung SH. Reliability based design optimization with approximate failure probability function in partitioned design space. Reliab Eng Syst Saf 2017;167: 60211. https://doi.org/10.1016/j.ress.2017.07.007. ",
    "[37] Chiralaksanakul A, Mahadevan S. Firstorder approximation methods in reliability based design optimization. J Mech Des Trans ASME 2005. https://doi.org/ 10.1115/1.1899691. ",
    "[38] Doltsinis I, Kang Z, Cheng G. Robust design of nonlinear structures using optimization methods. Comput Methods Appl Mech Eng 2005;194:177995. https://doi.org/10.1016/j.cma.2004.02.027. ",
    "[39] Taflanidis AA, Beck JL. Stochastic Subset Optimization for optimal reliability problems. Probab Eng Mech 2008. https://doi.org/10.1016/j. probengmech.2007.12.011. ",
    "[40] Au SK, Beck JL. Estimation of small failure probabilities in high dimensions by subset simulation. Probab Eng Mech 2001;16:26377. https://doi.org/10.1016/ S02668920(01)000194. ",
    "[41] Jia GF, Taflanidis AA. Nonparametric stochastic subset optimization for optimal reliability design problems. Comput Struct 2013;126:8699. https://doi.org/ 10.1016/j.compstruc.2012.12.009. ",
    "[42] Taflanidis AA. Stochastic subset optimization incorporating moving least squares response surface methodologies for stochastic sampling. Adv Eng Softw 2012;44: 314. https://doi.org/10.1016/j.advengsoft.2011.07.009. ",
    "[43] Khalid MA, Bansal S. Framework for robust design optimization of tuned mass dampers by stochastic subset optimization. Int J Struct Stab Dyn 2023;23. https:// doi.org/10.1142/S0219455423501559. ",
    "[44] Au SK. Reliabilitybased design sensitivity by efficient simulation. Comput Struct 2005;83:104861. ",
    "[45] Taflanidis AA, Beck JL. An efficient framework for optimal robust stochastic system design using stochastic simulation. Comput Methods Appl Mech Eng 2008. https:// doi.org/10.1016/j.cma.2008.03.029. ",
    "[46] Robert CP, Casella G. Monte carlo statistical methods. New York, NY: Springer; 2004. ",
    "[47] Li HS. Subset simulation for unconstrained global optimization. Appl Math Model 2011;35:510820. https://doi.org/10.1016/j.apm.2011.04.023. ",
    "[48] Khalid MA, Bansal S, Ramamohan V. An augmented formulation for robust design optimization of structures using stochastic simulation method. Res Eng Des 2022. https://doi.org/10.1007/s0016302200405z. ",
    "[49] Taflanidis AA, Beck JL. An efficient framework for optimal robust stochastic system design using stochastic simulation. Comput Methods Appl Mech Eng 2008;198: 88101. https://doi.org/10.1016/j.cma.2008.03.029. ",
    "[50] Kandemir EC, Mortazavi A. Optimization of seismic base isolation system using a fuzzy reinforced swarm intelligence. Adv Eng Softw 2022;174:103323. https://doi. org/10.1016/j.advengsoft.2022.103323. ",
    "[51] Rebay S. Efficient unstructured mesh generation by means of delaunay triangulation and BowyerWatson algorithm. J Comput Phys 1993;106:12538. ",
    "[52] Wade N, GrahamBrady L. Estimating microstructural feature distributions from image data using a Bayesian framework. J Microsc 2023:116. https://doi.org/ 10.1111/jmi.13184. ",
    "[53] Duan X, Li L, Ge Y, Liu B. Exact Voronoi diagram for topographic spatial analysis. GIScience Remote Sens 2023;60. https://doi.org/10.1080/ 15481603.2023.2171703. ",
    "[54] MATLAB and parallel computing toolbox release. Natick, Massachusetts, United States: The Mathworks, Inc.; 2021. M.A. Khalid and S. Bansal"
]