[
    "[1] Rayan Salah Hag Ali and Neamat El Gayar. 2019. Sentiment analysis using unla beled email data. In 2019 International Conference on Computational Intelligence and Knowledge Economy (ICCIKE). IEEE, 328333. ",
    "[2] Ali Shafigh Aski and Navid Khalilzadeh Sourati. 2016. Proposed efficient algo rithm to filter spam using machine learning techniques. Pacific Science Review A: Natural Science and Engineering 18, 2 (2016), 145149. ",
    "[3] Huwaida T Elshoush and Esraa A Dinar. 2019. Using adaboost and stochastic gradient descent (sgd) algorithms with R and orange software for filtering email spam. In 2019 11th Computer Science and Electronic Engineering (CEEC). IEEE, 4146. ",
    "[4] Weimiao Feng, Jianguo Sun, Liguo Zhang, Cuiling Cao, and Qing Yang. 2016. A support vector machine based naive Bayes algorithm for spam filtering. In 2016 IEEE 35th International Performance Computing and Communications Conference (IPCCC). IEEE, 18. ",
    "[5] Pranjul Garg and Nancy Girdhar. 2021. A Systematic Review on Spam Filtering Techniques based on Natural Language Processing Framework. In 2021 11th Inter national Conference on Cloud Computing, Data Science & Engineering (Confluence). IEEE, 3035. ",
    "[6] Adam Kavon GhaziTehrani and Henry N Pontell. 2021. Phishing evolves: Ana lyzing the enduring cybercrime. Victims & Offenders 16, 3 (2021), 316342. ",
    "[7] Radicati Group et al. 2015. Email Statistics Report 20152019. Radicati Group. Accessed August 13 (2015), 2019. ",
    "[8] Maryam Hina, Mohsin Ali, and Javed. 2021. Sefaced: Semanticbased forensic analysis and classification of email data using deep learning. IEEE Access 9 (2021), 9839898411. ",
    "[9] Maryam Hina, Mohsin Ali, Abdul Rehman Javed, Fahad Ghabban, Liaqat Ali Khan, and Zunera Jalil. 2021. Sefaced: Semanticbased forensic analysis and classification of email data using deep learning. IEEE Access 9 (2021), 98398 98411. ",
    "[10] Weicong Kong, Zhao Yang Dong, Youwei Jia, David J Hill, Yan Xu, and Yuan Zhang. 2017. Shortterm residential load forecasting based on LSTM recurrent neural network. IEEE transactions on smart grid 10, 1 (2017), 841851. ",
    "[11] T Kumaresan and C Palanisamy. 2017. Email spam classification using Scuckoo search and support vector machine. International Journal of BioInspired Compu tation 9, 3 (2017), 142156. ",
    "[12] Nuha H Marza, Mehdi E Manaa, and Hussein A Lafta. 2021. Classification of spam emails using deep learning. In 2021 1st Babylon International Conference on Information Technology and Science (BICITS). IEEE, 6368. ",
    "[13] Tomas Mikolov and Geoffrey Zweig. 2012. Context dependent recurrent neural network language model. In 2012 IEEE Spoken Language Technology Workshop (SLT). IEEE, 234239. ",
    "[14] Sarwat Nizamani, Nasrullah Memon, Mathies Glasdam, and Dong Duong Nguyen. 2014. Detection of fraudulent emails by employing advanced feature abundance. Egyptian Informatics Journal 15, 3 (2014), 169174. ",
    "[15] V Priya, I Sumaiya Thaseen, Thippa Reddy Gadekallu, Mohamed K Aboudaif, and Emad Abouel Nasr. 2021. Robust attack detection approach for IIoT using ensemble classifier. arXiv preprint arXiv:2102.01515 (2021). ",
    "[16] Justinas Rastenis, Simona Ramanauskaite, Justinas Janulevičius, Antanas Čenys, Asta Slotkiene, and Kęstutis Pakrijauskas. 2020. Emailbased phishing attack taxonomy. Applied Sciences 10, 7 (2020), 2363. ",
    "[17] Karthika D Renuka and P Visalakshi. 2014. Latent semantic indexing based SVM model for email spam classification. (2014). ",
    "[18] Shuvendu Roy, Sk Imran Hossain, MAH Akhand, and N Siddique. 2018. Sequence modeling for intelligent typing assistant with Bangla and English keyboard. In 2018 International Conference on Innovation in Engineering and Technology (ICIET). IEEE, 16. ",
    "[19] Tara N Sainath, Oriol Vinyals, Andrew Senior, and Haşim Sak. 2015. Convolu tional, long shortterm memory, fully connected deep neural networks. In 2015 IEEE international conference on acoustics, speech and signal processing (ICASSP). Ieee, 45804584. ",
    "[20] Anuj Kumar Singh, Shashi Bhushan, and Sonakshi Vij. 2019. Filtering spam messages and mails using fuzzy C means algorithm. In 2019 4th International Conference on Internet of Things: Smart Innovation and Usages (IoTSIU). IEEE, 15. ",
    "[21] Kristina Toutanova and Colin Cherry. 2009. A global model for joint lemmati zation and partofspeech prediction. In Proceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International Joint Conference on Natural Language Processing of the AFNLP. 486494. ",
    "[22] Tian Xia. 2020. A constant time complexity spam detection algorithm for boosting throughput on rulebased filtering systems. IEEE Access 8 (2020), 8265382661. ",
    "[23] Yan Zhang, PengFei Liu, and JingTao Yao. 2019. Threeway email spam filtering with gametheoretic rough sets. In 2019 International conference on computing, networking and communications (ICNC). IEEE, 552556. Received 15 April 2023 187"
]