[
    "[1] C. Atkinson, J. Bayer, C. Bunse, E. Kamsties, O. Laitenberger, R. Laqua, D. Muthig, B. Paech, J. Wust, and J. Zettel. ComponentBased Product Line Engineering with UML. Addison Wesley, Reading, Massachusetts, USA, 1st edition, November 2001. ",
    "[2] C. Atkinson, D. Stoll, and P. Bostan. Orthographic Software Modeling: A Practical Approach to ViewBased Development. In Evaluation of Novel Approaches to Software Engineering, volume 69 of Communications in Computer and Information Science, pages 206219. Springer Berlin Heidelberg, 2010. ",
    "[3] C. Atkinson, D. Stoll, and C. Tunjic. Orthographic Service Modeling. In Proceedings of 15th IEEE EDOC Conference Workshops (EDOCW), Helsinki, Finland, 2011. ",
    "[4] Eclipse Foundation. UML2Tools. http://wiki.eclipse.org/MDTUML2Tools, 2013. ",
    "[5] ISO/IEC and ITUT. The Reference Model of Open Distributed Processing. RMODP, ITUT Rec. X.901X.904 / ISO/IEC 10746. http://standards.iso.org/ ittf/PubliclyAvailableStandards/index.html, 1998. ",
    "[6] J. I. J. Jose Raul Romero and A. Vallecillo. Realizing Correspondences in MultiViewpoint Speciﬁcations. In Proceedings of the Thirteenth IEEE International EDOC Conference, 1 4 September 2009, Auckland, New Zealand, September 2009. ",
    "[7] M. Lankhorst. Enterprise Architecture at Work. Springer Berlin Heidelberg, 2009. ",
    "[8] Object Management Group (OMG). OMG Uniﬁed Modeling Language (OMG UML), Superstructure, V2.1.2. http://www.omg.org/cgibin/doc?formal/071102, November 2007. ",
    "[9] Object Management Group (OMG). Meta Object Facility (MOF) 2.0 Query/View/Transformation, v1.0. http://www.omg.org/spec/QVT/1.0/PDF/, April 2008. ",
    "[10] C. Seybold, M. Glinz, S. Meier, and N. MerloSchett. An eﬀective layout adaptation technique for a graphical modeling tool. In Proceedings of the 2003 International Conference on Software Engineering, Portland, 2003. ",
    "[11] The Atlas Transformation Language (ATL). Oﬃcial Website. http://www.eclipse.org/atl/, 2013. ",
    "[12] The Open Group. TOGAF Version 9 The Open Group Architecture Framework. http://www.opengroup.org/architecture/ togaf9doc/arch/index.html, Feb 2009. ",
    "[13] University of Mannheim Software Engineering Group. nAOMi opeN, Adaptable, Orthographic Modeling EnvIronment. http://eclipselabs.org/p/naomi. ",
    "[14] J. A. Zachman. The Zachman Framework: A Primer for Enterprise Engineering and Manufacturing. http://www.zachmaninternational.com, 2009."
]