[
    "[1] Jafar Afzali, Aleksander Mark Drzewiecki, and Krisztian Balog. 2021. POINTREC: A Test Collection for NarrativeDriven Point of Interest Recommendation. In Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval (Virtual Event, Canada) (SIGIR 21). As sociation for Computing Machinery, New York, NY, USA, 24782484. https: //doi.org/10.1145/3404835.3463243 ",
    "[2] Jaime Arguello, Adam Ferguson, Emery Fine, Bhaskar Mitra, Hamed Zamani, and Fernando Diaz. 2021. Tip of the Tongue KnownItem Retrieval: A Case Study in Movie Identification. In Proceedings of the 6th international ACM SIGIR Conference on Human Information Interaction and Retrieval. ACM. https://dlnext.acm.org/ doi/10.1145/3406522.3446021 ",
    "[3] Toine Bogers, Maria Gäde, Marijn Koolen, Vivien Petras, and Mette Skov. 2018. What was this Movie About this Chick? A Comparative Study of Relevance Aspects in Book and Movie Discovery. In Transforming Digital Worlds: 13th Inter national Conference, iConference 2018, Sheffield, UK, March 2528, 2018, Proceedings 13. Springer, 323334. ",
    "[4] Toine Bogers, Maria Gäde, Marijn Koolen, Vivien Petras, and Mette Skov. 2019. Looking for an amazing game I can relax and sink hours into...: A Study of Relevance Aspects in Video Game Discovery. In Information in Contemporary Society: 14th International Conference, iConference 2019, Washington, DC, USA, March 31April 3, 2019, Proceedings 14. Springer, 503515. ",
    "[5] Toine Bogers and Marijn Koolen. 2017. Defining and Supporting NarrativeDriven Recommendation. In Proceedings of the Eleventh ACM Conference on Recommender Systems (Como, Italy) (RecSys 17). Association for Computing Machinery, New York, NY, USA, 238242. https://doi.org/10.1145/3109859.3109893 ",
    "[6] Toine Bogers and Marijn Koolen. 2018. Im looking for something like...: Combining Narratives and Example Items for Narrativedriven Book Recommen dation. In Knowledgeaware and Conversational Recommender Systems Workshop. CEUR Workshop Proceedings. ",
    "[7] Luiz Bonifacio, Hugo Abonizio, Marzieh Fadaee, and Rodrigo Nogueira. 2022. InPars: Unsupervised Dataset Generation for Information Retrieval. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (Madrid, Spain) (SIGIR 22). Association for Computing Machinery, New York, NY, USA, 23872392. https://doi.org/10.1145/3477495. 3531863 ",
    "[8] Leonid Boytsov, Preksha Patel, Vivek Sourabh, Riddhi Nisar, Sayani Kundu, Ramya Ramanathan, and Eric Nyberg. 2023. InParsLight: CostEffective Unsu pervised Training of Efficient Rankers. arXiv:2301.02998 ",
    "[9] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel HerbertVoss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are FewShot Learners. In Advances in Neural Information Processing Systems, H. Larochelle, M. Ran zato, R. Hadsell, M.F. Balcan, and H. Lin (Eds.), Vol. 33. Curran Associates, Inc., 18771901. https://proceedings.neurips.cc/paper_files/paper/2020/file/ 1457c0d6bfcb4967418bfb8ac142f64aPaper.pdf ",
    "[10] Chris Buckley and Ellen M. Voorhees. 2004. Retrieval Evaluation with Incomplete Information. In Proceedings of the 27th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (Sheffield, United Kingdom) (SIGIR 04). Association for Computing Machinery, New York, NY, USA, 2532. https://doi.org/10.1145/1008992.1009000 ",
    "[11] DongKyu Chae, Jihoo Kim, Duen Horng Chau, and SangWook Kim. 2020. AR CF: Augmenting Virtual Users and Items in Collaborative Filtering for Addressing ColdStart Problems. In Proceedings of the 43rd International ACM SIGIR Con ference on Research and Development in Information Retrieval (Virtual Event, China) (SIGIR 20). Association for Computing Machinery, New York, NY, USA, 12511260. https://doi.org/10.1145/3397271.3401038 ",
    "[12] Lei Chen, Le Wu, Kun Zhang, Richang Hong, Defu Lian, Zhiqiang Zhang, Jun Zhou, and Meng Wang. 2023. Improving Recommendation Fairness via Data Augmentation. In Proceedings of the ACM Web Conference 2023 (Austin, TX, USA) (WWW 23). Association for Computing Machinery, New York, NY, USA, 10121020. https://doi.org/10.1145/3543507.3583341 ",
    "[13] Li Chen, Zhirun Zhang, Xinzhi Zhang, and Lehong Zhao. 2022. A Pilot Study for Understanding Users Attitudes Towards a Conversational Agent for News Recommendation. In Proceedings of the 4th Conference on Conversational User Interfaces (Glasgow, United Kingdom) (CUI 22). Association for Computing Machinery, New York, NY, USA, Article 36, 6 pages. https://doi.org/10.1145/ 3543829.3544530 ",
    "[14] Hyung Won Chung, Le Hou, Shayne Longpre, Barret Zoph, Yi Tay, William Fedus, Eric Li, Xuezhi Wang, Mostafa Dehghani, Siddhartha Brahma, et al. 2022. Scaling instructionfinetuned language models. arXiv preprint arXiv:2210.11416 (2022). ",
    "[15] Zhuyun Dai, Vincent Y Zhao, Ji Ma, Yi Luan, Jianmo Ni, Jing Lu, Anton Bakalov, Kelvin Guu, Keith Hall, and MingWei Chang. 2023. Promptagator: Fewshot 782",
    "[16] Abhinandan S. Das, Mayur Datar, Ashutosh Garg, and Shyam Rajaram. 2007. Google News Personalization: Scalable Online Collaborative Filtering. In Pro ceedings of the 16th International Conference on World Wide Web (Banff, Alberta, Canada) (WWW 07). Association for Computing Machinery, New York, NY, USA, 271280. https://doi.org/10.1145/1242572.1242610 ",
    "[17] James Davidson, Benjamin Liebald, Junning Liu, Palash Nandy, Taylor Van Vleet, Ullas Gargi, Sujoy Gupta, Yu He, Mike Lambert, Blake Livingston, and Dasarathi Sampath. 2010. The YouTube Video Recommendation System. In Proceedings of the Fourth ACM Conference on Recommender Systems (Barcelona, Spain) (RecSys 10). Association for Computing Machinery, New York, NY, USA, 293296. https: //doi.org/10.1145/1864708.1864770 ",
    "[18] Lukas Eberhard, Simon Walk, Lisa Posch, and Denis Helic. 2019. Evaluating NarrativeDriven Movie Recommendations on Reddit. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI 19). Association for Computing Machinery, New York, NY, USA, 111. https: //doi.org/10.1145/3301275.3302287 ",
    "[19] Luyu Gao, Xueguang Ma, Jimmy Lin, and Jamie Callan. 2022. Precise ZeroShot Dense Retrieval without Relevance Labels. arXiv preprint arXiv:2212.10496 (2022). ",
    "[20] Negar Hariri, Bamshad Mobasher, and Robin Burke. 2013. QueryDriven Context Aware Recommendation. In Proceedings of the 7th ACM Conference on Recom mender Systems (Hong Kong, China) (RecSys 13). Association for Computing Machinery, New York, NY, USA, 916. https://doi.org/10.1145/2507157.2507187 ",
    "[21] Seyyed Hadi Hashemi, Jaap Kamps, Julia Kiseleva, Charles LA Clarke, and Ellen M Voorhees. 2016. Overview of the TREC 2016 Contextual Suggestion Track.. In TREC. ",
    "[22] Gautier Izacard, Mathilde Caron, Lucas Hosseini, Sebastian Riedel, Piotr Bo janowski, Armand Joulin, and Edouard Grave. 2022. Unsupervised Dense Infor mation Retrieval with Contrastive Learning. Transactions on Machine Learning Research (2022). https://openreview.net/forum?id=jKN1pXi7b0 ",
    "[23] Vitor Jeronymo, Luiz Bonifacio, Hugo Abonizio, Marzieh Fadaee, Roberto Lotufo, Jakub Zavrel, and Rodrigo Nogueira. 2023. InParsv2: Large Language Models as Efficient Dataset Generators for Information Retrieval. arXiv:2301.01820 ",
    "[24] Marijn Koolen, Toine Bogers, Maria Gäde, Mark Hall, Iris Hendrickx, Hugo Huurdeman, Jaap Kamps, Mette Skov, Suzan Verberne, and David Walsh. 2016. Overview of the CLEF 2016 Social Book Search Lab. In Experimental IR Meets Mul tilinguality, Multimodality, and Interaction, Norbert Fuhr, Paulo Quaresma, Teresa Gonçalves, Birger Larsen, Krisztian Balog, Craig Macdonald, Linda Cappellato, and Nicola Ferro (Eds.). Springer International Publishing, Cham, 351370. ",
    "[25] Megan Leszczynski, Ravi Ganti, Shu Zhang, Krisztian Balog, Filip Radlinski, Fernando Pereira, and Arun Tejasvi Chaganty. 2023. Generating Synthetic Data for Conversational Music Recommendation Using Random Walks and Language Models. arXiv:2301.11489 ",
    "[26] Xin Liu, Yong Liu, Karl Aberer, and Chunyan Miao. 2013. Personalized Pointof Interest Recommendation by Mining Users Preference Transition. In Proceedings of the 22nd ACM International Conference on Information & Knowledge Manage ment (San Francisco, California, USA) (CIKM 13). Association for Computing Ma chinery, New York, NY, USA, 733738. https://doi.org/10.1145/2505515.2505639 ",
    "[27] Yiding Liu, TuanAnh Nguyen Pham, Gao Cong, and Quan Yuan. 2017. An Experimental Evaluation of PointofInterest Recommendation in LocationBased Social Networks. Proc. VLDB Endow. 10, 10 (jun 2017), 10101021. https://doi. org/10.14778/3115404.3115407 ",
    "[28] Federico López, Martin Scholz, Jessica Yung, Marie Pellat, Michael Strube, and Lucas Dixon. 2021. Augmenting the useritem graph with textual similarity models. arXiv preprint arXiv:2109.09358 (2021). ",
    "[29] Xing Han Lu, Siva Reddy, and Harm de Vries. 2023. The StatCan Dialogue Dataset: Retrieving Data Tables through Conversations with Genuine Intents. In Proceedings of the 17th Conference of the European Chapter of the Association for Computational Linguistics. Association for Computational Linguistics, Dubrovnik, Croatia, 27992829. https://aclanthology.org/2023.eaclmain.206 ",
    "[30] Kai Luo, Scott Sanner, Ga Wu, Hanze Li, and Hojin Yang. 2020. Latent Linear Critiquing for Conversational Recommender Systems. In The Web Conference. ",
    "[31] Ji Ma, Ivan Korotkov, Yinfei Yang, Keith Hall, and Ryan McDonald. 2021. Zeroshot Neural Passage Retrieval via Domaintargeted Synthetic Question Generation. In Proceedings of the 16th Conference of the European Chapter of the Associa tion for Computational Linguistics: Main Volume. Association for Computational Linguistics, Online, 10751088. https://doi.org/10.18653/v1/2021.eaclmain.92 ",
    "[32] Sheshera Mysore, Tim OGorman, Andrew McCallum, and Hamed Zamani. 2021. CSFCube A Test Collection of Computer Science Research Articles for Faceted Query by Example. In Thirtyfifth Conference on Neural Information Processing Systems Datasets and Benchmarks Track (Round 2). https://doi.org/10.48550/arXiv. 2103.12906 ",
    "[33] Long Ouyang, Jeffrey Wu, Xu Jiang, Diogo Almeida, Carroll Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul F Christiano, Jan Leike, and Ryan Lowe. 2022. Training language models to follow instructions with human feedback. In Advances in Neural Information Processing Systems, S. Koyejo, S. Mohamed, A. Agarwal, D. Belgrave, K. Cho, and A. Oh (Eds.), Vol. 35. Curran Associates, Inc., 2773027744. https://proceedings.neurips.cc/paper_files/paper/2022/file/ b1efde53be364a73914f58805a001731PaperConference.pdf ",
    "[34] Andrea Papenmeier, Dagmar Kern, Daniel Hienert, Alfred Sliwa, Ahmet Aker, and Norbert Fuhr. 2021. Starting Conversations with Search Engines Interfaces That Elicit Natural Language Queries. In Proceedings of the 2021 Conference on Human Information Interaction and Retrieval (Canberra ACT, Australia) (CHIIR 21). Association for Computing Machinery, New York, NY, USA, 261265. https: //doi.org/10.1145/3406522.3446035 ",
    "[35] Gustavo Penha, Enrico Palumbo, Maryam Aziz, Alice Wang, and Hugues Bouchard. 2023. Improving Content Retrievability in Search with Controllable Query Generation. In Proceedings of the ACM Web Conference 2023 (Austin, TX, USA) (WWW 23). Association for Computing Machinery, New York, NY, USA, 31823192. https://doi.org/10.1145/3543507.3583261 ",
    "[36] Filip Radlinski, Krisztian Balog, Fernando Diaz, Lucas Dixon, and Ben Wedin. 2022. On Natural Language User Profiles for Transparent and Scrutable Rec ommendation. In Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (Madrid, Spain) (SIGIR 22). Association for Computing Machinery, New York, NY, USA, 28632874. https://doi.org/10.1145/3477495.3531873 ",
    "[37] Nils Reimers and Iryna Gurevych. 2019. SentenceBERT: Sentence Embeddings using Siamese BERTNetworks. In Proceedings of the 2019 Conference on Em pirical Methods in Natural Language Processing. Association for Computational Linguistics. https://arxiv.org/abs/1908.10084 ",
    "[38] Stephen Robertson and Hugo Zaragoza. 2009. The Probabilistic Relevance Framework: BM25 and Beyond. Found. Trends Inf. Retr. 3, 4 (apr 2009), 333389. https://doi.org/10.1561/1500000019 ",
    "[39] Jon SaadFalcon, Omar Khattab, Keshav Santhanam, Radu Florian, Martin Franz, Salim Roukos, Avirup Sil, Md Arafat Sultan, and Christopher Potts. 2023. UDAPDR: Unsupervised Domain Adaptation via LLM Prompting and Distillation of Rerankers. arXiv:2303.00807 [cs.IR] ",
    "[40] Devendra Sachan, Mike Lewis, Mandar Joshi, Armen Aghajanyan, Wentau Yih, Joelle Pineau, and Luke Zettlemoyer. 2022. Improving Passage Retrieval with ZeroShot Question Generation. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Abu Dhabi, United Arab Emirates, 37813797. https://aclanthology. org/2022.emnlpmain.249 ",
    "[41] Kaitao Song, Xu Tan, Tao Qin, Jianfeng Lu, and TieYan Liu. 2020. MPNet: Masked and Permuted Pretraining for Language Understanding. In Advances in Neural Information Processing Systems, Vol. 33. https://proceedings.neurips.cc/paper_ files/paper/2020/file/c3a690be93aa602ee2dc0ccab5b7b67ePaper.pdf ",
    "[42] Jaime Teevan, Susan T. Dumais, and Eric Horvitz. 2005. Personalizing Search via Automated Analysis of Interests and Activities. In Proceedings of the 28th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (Salvador, Brazil) (SIGIR 05). Association for Computing Machinery, New York, NY, USA, 449456. https://doi.org/10.1145/1076034.1076111 ",
    "[43] Mengting Wan and Julian McAuley. 2018. Item Recommendation on Monotonic Behavior Chains. In Proceedings of the 12th ACM Conference on Recommender Systems (Vancouver, British Columbia, Canada) (RecSys 18). Association for Computing Machinery, New York, NY, USA, 8694. https://doi.org/10.1145/ 3240323.3240369 ",
    "[44] Haonan Wang, Chang Zhou, Carl Yang, Hongxia Yang, and Jingrui He. 2021. Controllable Gradient Item Retrieval. In Web Conference. ",
    "[45] Qinyong Wang, Hongzhi Yin, Hao Wang, Quoc Viet Hung Nguyen, Zi Huang, and Lizhen Cui. 2019. Enhancing Collaborative Filtering with Generative Aug mentation. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (Anchorage, AK, USA) (KDD 19). As sociation for Computing Machinery, New York, NY, USA, 548556. https: //doi.org/10.1145/3292500.3330873 ",
    "[46] Jiajing Xu, Andrew Zhai, and Charles Rosenberg. 2022. Rethinking Personalized Ranking at Pinterest: An EndtoEnd Approach. In Proceedings of the 16th ACM Conference on Recommender Systems (Seattle, WA, USA) (RecSys 22). Association for Computing Machinery, New York, NY, USA, 502505. https://doi.org/10. 1145/3523227.3547394 ",
    "[47] Yuxin Ying, Fuzhen Zhuang, Yongchun Zhu, Deqing Wang, and Hongwei Zheng. 2023. CAMUS: AttributeAware Counterfactual Augmentation for Minority Users in Recommendation. In Proceedings of the ACM Web Conference 2023 (Austin, TX, USA) (WWW 23). Association for Computing Machinery, New York, NY, USA, 13961404. https://doi.org/10.1145/3543507.3583538 ",
    "[48] Hamed Zamani, Johanne R Trippas, Jeff Dalton, and Filip Radlinski. 2022. Con versational information seeking. arXiv preprint arXiv:2201.08808 (2022). ",
    "[49] Jie Zou, Yifan Chen, and Evangelos Kanoulas. 2020. Towards QuestionBased Recommender Systems. In Proceedings of the 43rd International ACM SIGIR Confer ence on Research and Development in Information Retrieval (Virtual Event, China) (SIGIR 20). Association for Computing Machinery, New York, NY, USA, 881890. https://doi.org/10.1145/3397271.3401180 783"
]