[
    "[1] Justito Adiprasetio and Annissa Winda Larasati. 2020. Pandemic crisis in online media: Quantitative framing analysis on Detik. coms coverage of Covid19. Jurnal Ilmu Sosial Dan Ilmu Politik 24, 2 (2020), 153170. ",
    "[2] Neel Alex, Eli Lifland, Lewis Tunstall, Abhishek Thakur, Pegah Maham, C Jess Riedel, Emmie Hine, Carolyn Ashurst, Paul Sedille, Alexis Carlier, et al. 2021. RAFT: A realworld fewshot text classification benchmark. arXiv preprint arXiv:2109.14076 (2021). ",
    "[3] David Alonso del Barrio and Daniel GaticaPerez. 2022. How Did Europes Press Cover Covid19 Vaccination News? A FiveCountry Analysis. (2022), 3543. https://doi.org/10.1145/3512732.3533588 ",
    "[4] Emily M Bender, Timnit Gebru, Angelina McMillanMajor, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big? (2021), 610623. ",
    "[5] Santosh Kumar Biswal and Nikhil Kumar Gouda. 2020. Artificial intelligence in journalism: A boon or bane? In Optimization in machine learning and applications. Springer, 155167. ",
    "[6] Erik Bleich, Hannah Stonebraker, Hasher Nisar, and Rana Abdelhamid. 2015. Media portrayals of minorities: Muslims in British newspaper headlines, 2001 2012. Journal of Ethnic and Migration Studies 41, 6 (2015), 942962. ",
    "[7] Michael Bommarito and Daniel Martin Katz. 2022. GPT Takes the Bar Exam. https://doi.org/10.48550/ARXIV.2212.14402 ",
    "[8] Meredith Broussard, Nicholas Diakopoulos, Andrea L Guzman, Rediet Abebe, Michel Dupagne, and ChingHua Chuan. 2019. Artificial intelligence and jour nalism. Journalism & Mass Communication Quarterly 96, 3 (2019), 673695. ",
    "[9] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, et al. 2020. Language models are fewshot learners. Advances in neural information processing systems 33 (2020), 18771901. ",
    "[10] Björn Burscher, Daan Odijk, Rens Vliegenthart, Maarten De Rijke, and Claes H De Vreese. 2014. Teaching the computer to code frames in news: Comparing two supervised machine learning approaches to frame analysis. Communication Methods and Measures 8, 3 (2014), 190206. ",
    "[11] Bjorn Burscher, Rens Vliegenthart, and Claes H de Vreese. 2016. Frames beyond words: Applying cluster and sentiment analysis to news coverage of the nuclear power issue. Social Science Computer Review 34, 5 (2016), 530545. ",
    "[12] Dallas Card, Amber Boydstun, Justin Gross, Philip Resnik, and Noah Smith. 2015. The Media Frames Corpus: Annotations of Frames Across Issues. 2 (01 2015), 438444. https://doi.org/10.3115/v1/P152072 ",
    "[13] Daniel CatalanMatamoros and Carlos Elías. 2020. Vaccine hesitancy in the age of coronavirus and fake news: analysis of journalistic sources in the Spanish quality press. International Journal of Environmental Research and Public Health 17, 21 (2020), 8136. ",
    "[14] Daniel CatalánMatamoros and Carmen PeñafielSaiz. 2019. Media and mistrust of vaccines: a content analysis of press headlines. Revista latina de comunicación social 74 (2019), 786802. ",
    "[15] Mark Coddington. 2015. Clarifying journalisms quantitative turn: A typology for evaluating data journalism, computational journalism, and computerassisted reporting. Digital journalism 3, 3 (2015), 331348. ",
    "[16] Stephen D Cooper. 2010. The oppositional framing of bloggers. In Doing News Framing Analysis. Routledge, 151172. ",
    "[17] Robert Dale. 2021. GPT3: Whats it good for? Natural Language Engineering 27, 1 (2021), 113118. ",
    "[18] Astrid Dirikx and Dave Gelders. 2010. To frame is to explain: A de ductive frameanalysis of Dutch and French climate change coverage dur ing the annual UN Conferences of the Parties. Public Understanding of Science 19, 6 (2010), 732742. https://doi.org/10.1177/0963662509352044 arXiv:https://doi.org/10.1177/0963662509352044 PMID: 21560546. ",
    "[19] Astrid Dirikx and Dave Gelders. 2010. To frame is to explain: A deductive frame analysis of Dutch and French climate change coverage during the annual UN Conferences of the Parties. Public understanding of science 19, 6 (2010), 732742. 634",
    "[20] ZiYi Dou, Pengfei Liu, Hiroaki Hayashi, Zhengbao Jiang, and Graham Neubig. 2020. Gsum: A general framework for guided neural abstractive summarization. arXiv preprint arXiv:2010.08014 (2020). ",
    "[21] Sumayya Ebrahim. 2022. The corona chronicles: Framing analysis of online news headlines of the COVID19 pandemic in Italy, USA and South Africa. Health SA Gesondheid (Online) 27 (2022), 18. ",
    "[22] Hend Abdelgaber Ahmed ElBehary. 2021. A Feverish Spring: A Comparative Analysis of COVID19 News Framing in Sweden, the UK, and Egypt. (2021). ",
    "[23] Robert M Entman. 1993. Framing: Towards clarification of a fractured paradigm. McQuails reader in mass communication theory 390 (1993), 397. ",
    "[24] Tianyu Gao, Adam Fisch, and Danqi Chen. 2020. Making pretrained language models better fewshot learners. arXiv preprint arXiv:2012.15723 (2020). ",
    "[25] Piyush Ghasiya and Koji Okamura. 2021. Investigating COVID19 news across four nations: a topic modeling and sentiment analysis approach. Ieee Access 9 (2021), 3664536656. ",
    "[26] Robert Gifford. 1994. A LensMapping Framework for Understanding the En coding and Decoding of Interpersonal Dispositions in Nonverbal Behavior. Journal of Personality and Social Psychology 66 (02 1994), 398412. https: //doi.org/10.1037//00223514.66.2.398 ",
    "[27] Quentin Grail, Julien Perez, and Eric Gaussier. 2021. Globalizing BERTbased transformer architectures for long document summarization. In Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics: Main Volume. 17921810. ",
    "[28] Anushka Gupta, Diksha Chugh, Rahul Katarya, et al. 2022. Automated news summarization using transformers. In Sustainable Advanced Computing. Springer, 249259. ",
    "[29] Alfred Hermida and Mary Lynn Young. 2017. Finding the data unicorn: A hierar chy of hybridity in data and computational journalism. Digital Journalism 5, 2 (2017), 159176. ",
    "[30] Karoliina Isoaho, Daria Gritsenko, and Eetu Mäkelä. 2021. Topic modeling and text analysis for qualitative policy research. Policy Studies Journal 49, 1 (2021), 300324. ",
    "[31] Carina Jacobi, Wouter Van Atteveldt, and Kasper Welbers. 2016. Quantitative analysis of large amounts of journalistic texts using topic modelling. Digital journalism 4, 1 (2016), 89106. ",
    "[32] Zhengbao Jiang, Frank F Xu, Jun Araki, and Graham Neubig. 2020. How can we know what language models know? Transactions of the Association for Computa tional Linguistics 8 (2020), 423438. ",
    "[33] Shima Khanehzar, Andrew Turpin, and Gosia Mikołajczak. 2019. Modeling Political Framing Across Policy Issues and Contexts. In ALTA. ",
    "[34] Jeesun Kim and Wayne Wanta. 2018. News framing of the US immigration debate during election years: Focus on generic frames. The Communication Review 21, 2 (2018), 89115. ",
    "[35] Percy Liang, Rishi Bommasani, Tony Lee, Dimitris Tsipras, Dilara Soylu, Michi hiro Yasunaga, Yian Zhang, Deepak Narayanan, Yuhuai Wu, Ananya Kumar, et al. 2022. Holistic evaluation of language models. arXiv preprint arXiv:2211.09110 (2022). ",
    "[36] Pengfei Liu, Weizhe Yuan, Jinlan Fu, Zhengbao Jiang, Hiroaki Hayashi, and Graham Neubig. 2021. Pretrain, prompt, and predict: A systematic survey of prompting methods in natural language processing. (2021). https://doi.org/10. 48550/ARXIV.2107.13586 ",
    "[37] Siyi Liu, Lei Guo, Kate Mays, Margrit Betke, and Derry Tanti Wijaya. 2019. Detecting frames in news headlines and its application to analyzing news framing trends surrounding US gun violence. In Proceedings of the 23rd conference on computational natural language learning (CoNLL). ",
    "[38] Jörg Matthes and Matthias Kohring. 2008. The Content Analysis of Media Frames: Toward Improving Reliability and Validity. Journal of Communication 58 (06 2008). https://doi.org/10.1111/j.14602466.2008.00384.x ",
    "[39] Selina Meyer, David Elsweiler, Bernd Ludwig, Marcos FernandezPichel, and David E Losada. 2022. Do We Still Need Human Assessors? PromptBased GPT3 User Simulation in Conversational AI. In Proceedings of the 4th Conference on Conversational User Interfaces. 16. ",
    "[40] Stuart E Middleton, Symeon Papadopoulos, and Yiannis Kompatsiaris. 2018. Social computing for verifying social media content in breaking news. IEEE Internet Computing 22, 2 (2018), 8389. ",
    "[41] Marko Milosavljević and Igor Vobič. 2021. Our task is to demystify fears: Analysing newsroom management of automation in journalism. Journalism 22, 9 (2021), 22032221. ",
    "[42] R. Monarch. 2021. HumanintheLoop Machine Learning: Active Learning and Annotation for Humancentered AI. Manning. https://books.google.ch/books? id=LCh0zQEACAAJ ",
    "[43] Tom Nicholls and Pepper D Culpepper. 2021. Computational identification of media frames: Strengths, weaknesses, and opportunities. Political Communication 38, 12 (2021), 159181. ",
    "[44] Zhongdang Pan and Gerald M Kosicki. 1993. Framing analysis: An approach to news discourse. Political communication 10, 1 (1993), 5575. ",
    "[45] Raul Puri and Bryan Catanzaro. 2019. Zeroshot text classification with generative language models. arXiv preprint arXiv:1912.10165 (2019). ",
    "[46] Guanghui Qin and Jason Eisner. 2021. Learning how to ask: Querying lms with mixtures of soft prompts. arXiv preprint arXiv:2104.06599 (2021). ",
    "[47] Rabindra Lamsal. 2021. Sentiment Analysis of English Tweets with BERTsent. https://huggingface.co/rabindralamsal/finetunedbertweetsentimentanalysis. ",
    "[48] Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, et al. 2019. Language models are unsupervised multitask learners. OpenAI blog 1, 8 (2019), 9. ",
    "[49] Nishant Rai, Deepika Kumar, Naman Kaushik, Chandan Raj, and Ahad Ali. 2022. Fake News Classification using transformer based enhanced LSTM and BERT. International Journal of Cognitive Computing in Engineering 3 (2022), 98105. https://doi.org/10.1016/j.ijcce.2022.03.003 ",
    "[50] Frida V Rodelo. 2021. Framing of the Covid19 pandemic and its organizational predictors. Cuadernos. info 50 (2021), 91112. ",
    "[51] Teven Le Scao, Angela Fan, Christopher Akiki, Ellie Pavlick, Suzana Ilić, Daniel Hesslow, Roman Castagné, Alexandra Sasha Luccioni, François Yvon, Matthias Gallé, et al. 2022. Bloom: A 176bparameter openaccess multilingual language model. arXiv preprint arXiv:2211.05100 (2022). ",
    "[52] Holli Semetko and Patti Valkenburg. 2000. Framing European Politics: A Content Analysis of Press and Television News. Journal of Communication 50 (06 2000), 93 109. https://doi.org/10.1111/j.14602466.2000.tb02843.x ",
    "[53] Richard Shin, Christopher H Lin, Sam Thomson, Charles Chen, Subhro Roy, Em manouil Antonios Platanios, Adam Pauls, Dan Klein, Jason Eisner, and Benjamin Van Durme. 2021. Constrained language models yield fewshot semantic parsers. arXiv preprint arXiv:2104.08768 (2021). ",
    "[54] Efstathios Sidiropoulos and Andreas Veglis. 2017. Computer Supported Collab orative Work trends on Media Organizations: Mixing Qualitative and Quan titative Approaches. Studies in Media and Communication 5 (04 2017), 63. https://doi.org/10.11114/smc.v5i1.2279 ",
    "[55] Emma Strubell, Ananya Ganesh, and Andrew McCallum. 2019. Energy and policy considerations for deep learning in NLP. arXiv preprint arXiv:1906.02243 (2019). ",
    "[56] Alex Tamkin, Miles Brundage, Jack Clark, and Deep Ganguli. 2021. Understanding the capabilities, limitations, and societal impact of large language models. arXiv preprint arXiv:2102.02503 (2021). ",
    "[57] Trieu H Trinh and Quoc V Le. 2018. A simple method for commonsense reasoning. arXiv preprint arXiv:1806.02847 (2018). ",
    "[58] Maria Tsimpoukelli, Jacob L Menick, Serkan Cabi, SM Eslami, Oriol Vinyals, and Felix Hill. 2021. Multimodal fewshot learning with frozen language models. Advances in Neural Information Processing Systems 34 (2021), 200212. ",
    "[59] Sandra A Vannoy and Prashant Palvia. 2010. The social influence model of technology adoption. Commun. ACM 53, 6 (2010), 149153. ",
    "[60] Tuukka YläAnttila, Veikko Eranti, and Anna Kukkonen. 2022. Topic modeling for frame analysis: A study of media debates on climate change in India and USA. Global Media and Communication 18, 1 (2022), 91112. 635"
]