[
    "arXiv:2207.04698v1  [math.HO]  11 Jul 2022Numerical computing in engineering mathematics\nFiruz Kamalov\nDepartment of Electrical Engineering\nCanadian University Dubai\nDubai, UAE\nﬁruz@cud.ac.aeHo-Hon Leung\nDepartment of Mathematical Sciences\nUnited Arab Emirates University\nAl Ain, UAE\nhohon.leung@uaeu.ac.ae\nAbstract —The rapid advances in technology over the last\ndecade have signiﬁcantly altered the nature of engineering knowl-\nedge and skills required in the modern industries. In respon se to\nthe changing professional requirements, engineering inst itutions\nhave updated their curriculum and pedagogical practices. H ow-\never, most of the changes in the curriculum have been focused on\nthe core engineering courses without much consideration fo r the\nauxiliary courses in mathematics and sciences. In this pape r, we\naim to propose a new, augmented mathematics curriculum aime d\nat meeting the requirements of the modern, technology-base d\nengineering workplace. The proposed updates require minim al\nresources and can be seamlessly integrated into the existin g\ncurriculum.\nIndex Terms —engineering mathematics; numerical computing;\neducation; Industry 4.0\nI. I NTRODUCTION\nThe 4th Industrial Revolution has had a dramatic impact\non the engineering profession. The modern technologies suc h\nas artiﬁcial intelligence, the internet of things, and adva nced\nrobotics have altered engineering systems and processes. T o-\nday’s engineers are expected to be able to leverage these\nresources to produce their products. To meet the new profes-\nsional requirements, engineering educational institutio ns have\nrevised their curricula. The changes in the curricula inclu de\nboth updating the existing programs as well as introduc-\ning completely new programs. Given the rapid technological\nprogress, universities and colleges around the world are co n-\ntinuously adapting to the ever-changing environment. Whil e a\nsigniﬁcant progress in modernizing the engineering curric ulum\nhas been achieved, there still remains room for improvement .\nCatalyzed by the exponential increase in computational\npower and interconnectedness, the modern industrial revol u-\ntion has reshaped the skills and competencies required of th e\nengineers. The changes in engineering curricula in respons e to\nIndustry 4.0 have been threefold: i) modernizing the existi ng\nprograms, ii) introduction of new programs, and iii) revisi ng\nthe pedagogical approach. Modernizing the existing progra ms\ninvolves introduction of new courses in the study plan relat ed\nto emerging technologies. In addition, existing courses ca n be\nupdated with new content. Fresh new programs in emerging\n© 2022 IEEE. Personal use of this material is permitted. Perm ission from\nIEEE must be obtained for all other uses, in any current or fut ure media,\nincluding reprinting/republishing this material for adve rtising or promotional\npurposes, creating new collective works, for resale or redi stribution to servers\nor lists, or reuse of any copyrighted component of this work i n other workstechnologies are also introduced by universities and colle ges.\nMany institutions now offer degrees in artiﬁcial intellige nce\nand mechatronics which were not there 20 years ago. Finally,\nuniversities have revised their approaches to course deliv ery.\nStudent-centered learning, project-based learning, and a pplied\nlearning have become popular in the new engineering educa-\ntional paradigm.\nWhile signiﬁcant effort has been made to revise the core\nengineering courses, the auxiliary courses in mathematics and\nsciences received little consideration. The mathematics a nd\nsciences courses play a key role in the engineering curricul um.\nGiven their importance, the curriculum updates must also be\nextended to the auxiliary courses. By implementing a com-\nprehensive update of the engineering curriculum that inclu des\nboth the core and auxiliary courses, a more effective outcom e\ncan be achieved.\nThe goal of this paper is to propose a modernized engineer-\ning mathematics curriculum in line with the broader efforts to\nupdate engineering education to adapt to Industry 4.0. The k ey\nfeature of the new curriculum is the introduction numerical\ncomputing in the existing mathematics courses. The latest\nindustrial revolution has been driven largely by the dramat ic\nincrease in computational power. Therefore, today’s engin eers\nmust be well-equipped to leverage the computing power in\ntheir work.\nSince mathematics courses are usually taken at the begin-\nning of the study plan, it offers a natural avenue for introdu cing\nnumerical computing to students. Furthermore, many proble ms\nin mathematics can be solved numerically making it natural\nto integrate numerical computing in mathematics courses.\nBy studying numerical computing in mathematics courses,\nstudents will acquire the necessary theoretical and practi cal\nskills to apply in their downstream, specialized engineeri ng\ncourses.\nThis paper is structured as follows. Section 2 provides an\noverview of the existing efforts to update the engineering\ncurriculum in response to Industry 4.0. Section 3 discusses\nthe current approaches to integrate scientiﬁc computing in\nmathematics courses. In Section 4, we present our proposal\nfor modernizing the mathematics curriculum to integrate nu -\nmerical computing. Section 5 concludes the paper with ﬁnal\nremarks.",
    "II. E NGINEERING EDUCATION AND INDUSTRY 4.0\nEngineering departments in colleges and universities have\nmade signiﬁcant changes in their curricula in response to\nthe new environment created by the recent, rapid advances\nin technology. In particular, the existing programs have be en\nupdated to include courses that target emerging technologi es.\nCompletely new programs related to AI and mechatronics\nhave also been adopted by universities. Innovations in the\nﬁeld of engineering education continue to take place with ne w\ndevelopments on the horizon.\nThere exist several studies investigating the modern en-\ngineering curricula and evaluating their effectiveness. I t is\nargued in [6] that engineering educators must prepare their\nstudents to face three key challenges: sustainability, the 4th\nIndustrial Revolution, and employability. The authors ﬁnd that\ncolleges and universities are responding to these challeng es by\nemphasizing student-centered learning, integration of th eory\nand practice, digital and online learning, and the deﬁnitio n of\nprofessional competencies. In particular, response to the needs\nof Industry 4.0 require interdisciplinary collaboration a cross\nseveral programs and disciplines. Interaction and integra tion\nof technologies plays a key role in this process [10], [12]. I n-\nterdisciplinary engineering education requires sound ped agogy\nand teaming experiences to encourage student in collaborat ive\nand interdisciplinary practice [23].\nDigital and online learning have become an important part\nof modern education including in the ﬁeld of engineering.\nInformation technologies play a vital role in delivering di gital\nlearning to students. Colleges and universities have made\nsigniﬁcant investments to improve their information and co m-\nmunication technology (ICT) capacities [7].\nIn response to the needs of Industry 4.0, some univer-\nsities have adopted the framework of Education 4.0 [15],\n[19]. The new education framework consists of four main\ncomponents: i) competencies, ii) learning methods, iii) IC T,\nand iv) infrastructure. Students competencies are based on\ntechnological knowledge and skills for successful workpla ce\nperformance, while the learning methods are based on proble m\nsolving and challenge-based learning. In particular, acti ve and\nproject-based learning plays an important role in Educatio n\n4.0 [4], [8]. Other innovative approaches to learning such a s\nvirtual-reality based engineering education can help impr ove\nthe learning process related to Industry 4.0 [20].\nIn addition to technological progress, socio-cultural shi fts\nmust be taken into account in revising engineering curricul um.\nThe new generation of students has its unique worldview\nwhich needs to be considered by the educators. In particular ,\nthe new generation is signiﬁcantly affected by mobile devic es\nand digital media. Educational content must be tailored to\nthe new student preferences to achieve effective learning\noutcomes [16]. Innovative approaches such gamiﬁcation may\nhelp improve the learning process [13], [17].\nMany universities have also introduced nontechnical updat es\nto their engineering curriculum. The most signiﬁcant nonte ch-\nnical update has been the introduction of entrepreneurshipcourses and experiences for students. A lot of attention has\nrecently been given to equipping students with entrepreneu rial\nskills. Students learn about entrepreneurship in their cou rses\nas well as through university incubators.\nIII. U NIVERSITY MATHEMATICS CURRICULUM\nThe mathematics curriculum changed very little in the\ncurrent century. It remains a largely analytic domain, wher e so-\nlutions are mainly obtained manually. The current mathemat ics\ncurriculum emphasizes theory over practical approaches. F or\ninstance, when ﬁnding the extreme values of a function,\nderivative-based approach is preferred over the gradient d e-\ncent. There are two key reasons for why analytical approache s\nare favored over numerical methods. First, analytical solu tions\nare reliable and elegant. An analytical solution is guarant eed\nto be exact. Second, mathematics courses are usually taught\nby pure mathematicians who have an inherent preference\nfor analytical solutions. Pure mathematics which is based o n\ntheorem proving is not amenable to numerical methods.\nDespite the popularity of analytical approaches to problem\nsolving in mathematics, there has been a growing push to inte -\ngrate computer algebra systems as part of the learning proce ss.\nComputer algebra systems such as Matlab and Mathematica\nare now routinely used in many mathematics courses. The\nstudy by Cretchley et al. [5] found that engineering student s\nwere positive about the use of technology as a learning tool\nin mathematics courses. The increased use of technology in\nclass helped improve student focus and interest in lectures .\nStudent evaluations also indicated that they had a greater l evel\nof enjoyment towards the lectures due to the use of technolog y.\nIt is noteworthy that students chose not to rely too heavily o n\ntechnology during the examinations despite the freedom to d o\nso. The students found it extremely important to be competen t\nwith analytical mathematical skills as opposed to purely co m-\nputational skills. Some revealed that they learn the subjec ts\nequally well without the help of scientiﬁc packages, althou gh\nthe perception towards the use of computer is in general high ly\npositive. Almost all students responded positively to Matl ab\nas an effective tool for computation and graphing. Many\nused Matlab for non-examination purposes. For example, the y\nutilized it to check their handwritten mathematical steps i n\nassignments and practice problems; and others used it for\nexploration beyond the standard syllabus and curriculum.\nThe inﬂuence of computer technology on students’ aca-\ndemic performance and learning experience has been inves-\ntigated by several authors. Abdul Majid et al. [1], [2] used\nMatlab as an aid to teach calculus to engineering students.\nThe software package was used for various course learning\noutcomes such as graphical display of mathematical functio ns,\nexploration, identifying and predicting structural patte rns in\nevaluating a series of complex indeﬁnite integrals, and num eri-\ncal approximations in applied mathematics. The study showe d\na positive impact on students’ academic performance in the\nﬁnal examinations. The study concluded that the integratio n\nof scientiﬁc packages into engineering mathematics course s\ncould be effective under certain conditions. Similarly, ot her",
    "studies [18], [21] also found a positive impact from the use\nof scientiﬁc software packages on students’ motivation in\nlearning mathematics.\nIn a separate study by Brake [3], the authors investigated th e\nuse of Matlab in engineering mathematics courses to increas e\nstudent conﬁdence level and mathematical abilities. Matla b\nwas used to solve concrete engineering problems which requi re\na deep understanding of underlying mathematical principle s.\nThe study found generally positive student response to the\nuse of software in their mathematics courses. However, the\nresults of the study must be considered carefully given the\nsmall sample size of the subjects.\nAlthough the majority of the studies were based on the\nuse of Matlab, several other studies considered alternativ e\nmathematics software packages. The study by Kilicman et al.\n[11] focused on the use of Maple to help students understand\nboth the theoretical and computational aspects of linear al gebra\nfor engineering students. In particular, it was shown that t he\nuse of Maple facilitates the understanding of computationa l as-\npects of eigenvalues and eigenvectors. It allows students m ore\ntime to focus on the theoretical aspects and the underlying\nmathematical principles.\nIn a recent study by Mezhennaya and Pugachev [14], the\nauthors compared engineering students’ perceptions regar ding\nseveral mathematical software: Matlab, Mathematica and Ex -\ncel. The study found that all the scientiﬁc packages conside red\ncan be used in education, under the condition that the polici es\nfor software usage are carefully implemented. The study\nfound that many students lack hands-on experience on how\nto use the software. The students particularly struggled wi th\nMatlab and Mathematica ﬁnding them non user friendly. The\nstudy concluded that additional classes are required to pre pare\nstudents to use software in their courses.\nIV. N UMERICAL COMPUTING IN MATHEMATICS\nCURRICULUM\nMathematics lies at the foundation of science and engineer-\ning. The importance of mathematics courses in engineering\neducation cannot be underestimated. These courses equip st u-\ndents with the fundamental skills and knowledge to study the\nmore specialized engineering courses. Thus, student succe ss in\nengineering studies depends directly on the mathematics an d\nsciences courses. Given the signiﬁcance of the mathematics\ncourses in the engineering curriculum, it is paramount to\nensure their currency with respect to the Industry 4.0.\nThe technological advances over the last decade have\ncreated demand for more computationally proﬁcient experts .\nTo meet this demand, numerical computing must become a\ncore part of engineering studies. Mathematics courses offe r\na natural and convenient avenue for introducing numerical\ncomputing to engineering students. There are two main fac-\ntors that make mathematics courses particularly amenable\nto numerical computing. First, in many cases mathematical\nproblems have numerical solutions. For instance, ﬁnding th e\nroot of a polynomial or the minimum value of a function\ncan be done numerically. Therefore, it is both logical andappropriate to apply numerical computing to mathematical\nproblems. Second, mathematics courses are usually taken\nat the beginning of the study plan. Thus, students become\nacquainted with numerical computing at an early stage. The\ncomputing and programming skills acquired in this manner\nwill have a positive effect in the more advanced, downstream\nengineering courses.\nThe key idea for the proposed curriculum update is the\naddition of computing tutorials (labs) to mathematics cour ses.\nIn particular, we propose adding weekly computing tutorial s\n(labs) related to the main lecture material. For instance, i n the\nweek in which students cover ﬁnding the extreme values of a\nfunction, there will be a computing tutorial where students\nlearn and implement the gradient descent algorithm. The\nsuggested length of each tutorial is 1 hour. It is enough\ntime to implement most of the numerical algorithms at the\nundergraduate level. At the same time, 1 extra hour per week\nwill not overburden the students.\nThe exact details of numerical computing content is left\nfor individual universities and instructors. Depending on the\nsyllabus and course learning outcomes, the numerical com-\nputing labs will be different for each university and instru ctor.\nNevertheless, the general ideas will be broadly similar acr oss\ndifferent curricula. To illustrate the proposed numerical com-\nputing content, we will focus on the three main concept in\ncalculus: limits, derivatives, and integrals.\nA. Limits\nLimit is a fundamental concept in calculus. Students are\nusually taught to calculate limits using analytical approa ches.\nAlthough analytical approaches work well, there is no singl e\nuniversal rule for calculating limits. On the other hand, in most\ncases, limits can be calculated numerically using essentia lly\nthe same approach. To illustrate, suppose we want to calcula te\nlimx→a+f(x). Then we can loop for k= 0 tonand calculate\nf(a+10−k). Askincreases, a+10−kapproaches a, sof(a+\n10−k)will, in most cases, approach the limit value. We can\ndeduce the limit by observing the values of f(a+ 10−k)or\ndetermine that the limit does not exist if there is no pattern of\nconvergence. The value of ncan be chosen manually or using\na stopping criterion. For instance, the algorithm may conti nue\nto iterate until the difference between consecutive values of\nf(a+ 10−k)is below a certain threshold. The value of the\nlimit can also be deduced automatically based on the values\noff(a+10−k)using various heuristics.\nAnother common limit problem is limx→∞f(x). In this\ncase, we can loop for k= 0 tonand calculate f(10k). Ask\nincreases, 10kapproaches ∞, sof(10k)will, in most cases,\napproach the limit value. Then the limit can be determined\nbased on the values of f(10k). Various extensions and cus-\ntomizations of this basic approach can be made. For instance ,\nto avoid issues with periodic functions f(10k+ǫk), whereǫk\nare randomly generated, can be used. Other values than 10k\ncan also be used as long as the sequence approaches inﬁnity.\nA degree of automization can be introduced using different\nheuristics.",
    "B. Derivative\nDerivative is arguably the most important concept in cal-\nculus. There exist several rules such as the power rule, the\nproduct rule, the chain rule, and others to ﬁnd the derivativ e\nof a function by hand. However, manual differentiation may\nbe cumbersome when dealing with complex function. On the\nother hand, calculating the derivative at a point numerical ly is\nrelatively straightforward. To illustrate, suppose that w e want\nto calculate f′(a). Recall that\nf′(a) = lim\nx→af(a+h)−f(a)\nh. (1)\nTherefore, to calculate f′(a)numerically we use the same\napproach as with the limits. In particular, we can loop for k=\n0tonand calculatef(a+10−k)−f(a)\n10−k . Then the limit, and by\nextension the derivative, can be deduced (approximated) ba sed\non the calculated values. The accuracy of the approximation\ndepends in large part on the value of n.\nOne of the most important applications of the derivative is\nﬁnding the extreme values of a function. Traditionally, thi s is\ndone by ﬁrst ﬁnding the critical points of the function and\nthen applying the second derivative test. However, ﬁnding t he\ncritical points is not always possible, so numerical approa ches\ncan be used in such cases. The most popular numerical\napproach for ﬁnding the extreme values is based on the\ngradient descent (ascent) algorithm. In gradient descent, the\noptimal value of xis iteratively updated based on the gradient.\nIn particular, for k= 0 ton, the updated optimal value of x\nis given by\nxk+1=xk−α∇f(xk), (2)\nwhere∇f(x)is the gradient and αis the step size. In the\ncase of a single-variable function, the gradient equals sim ply\nto the derivative ∇f(x) =f′(x). The step size αcan be\neither ﬁxed or dynamic. While a large value of αaccelerates\nthe convergence at the beginning, it may hurt the convergenc e\nin the region near the optimal value.\nThere exist several extensions of the basic gradient descen t\nalgorithm. One such extension is gradient descent with mo-\nmentum which uses the second derivative to anticipate the\nlocation of the next optimal point and thus accelerates the\nconvergence.\nC. Integrals\nIntegration is an important concept in engineering mathe-\nmatics. Although there exist a number of rules for ﬁnding the\nintegral, it is signiﬁcantly more challenging than differe ntia-\ntion. Moreover, in many cases, the indeﬁnite integral does n ot\neven exist. Therefore, numerical approaches are particula rly\nuseful for integration.\nTo illustrate the application of numerical integration, su p-\npose that we want to calculate∫b\naf(x)dx. There exist several\nnumerical methods for calculating the integral. One simple\nmethod is based on the Riemann sums. The interval [a,b]is\ndivided into nequal subintervals with endpoints x0,x1,...,xn.\nLetδ=xk+1−xkbe the length of each subinterval. Then theright Riemann sum is deﬁned as δ∑n\nk=1f(xk). The Riemann\nsum provides an approximation of the integral. Indeed,\n∫b\naf(x)dx= lim\nn→∞δn∑\nk=1f(xk). (3)\nThe Riemann sums can be quickly calculated on a computer\nproviding a simple, yet effective approach to calculating\nintegrals numerically. Other popular integral approximat ion\nmethods include the trapezoid rule and the Simpson’s rule.\nD. Additional considerations\nThe above discussion about numerical methods for cal-\nculating limits, derivatives, and integrals is easily exte nded\nto multivariate calculus. For instance, to ﬁnd the partial\nderivative fx(a,b), we can loop for k= 0 tonand calculate\nf(a+10−k,b)−f(a,b)\n10−k . Many problems related to sequences and\nseries can similarly be solved using numerical techniques. In\nparticular, the convergence of a series can be deduced from i ts\npartial sums. By calculating the partial sums on the compute r\nand observing the results, we can intuit the nature of the ser ies.\nVectorization is an important aspect of numerical com-\nputing. Since the modern computer chips are optimized for\nmatrix multiplication, it is more efﬁcient to employ vector\noperations. In particular, some algorithms based on for-lo ops\ncan be converted into vector operations resulting in higher\nefﬁciency and speed. For instance, the Riemann sum can be\ncalculated with a single vector operation:\nδn∑\nk=1f(xk) =δS(\nf(x))\n, (4)\nwherex= [x1,...,xn]is the vector of endpoints, f(x)is\na vectorized function operation, and Sis the vector func-\ntion which returns the sum of all the coordinates. Similarly ,\nlimit calculations can be vectorized and made more efﬁcient .\nVectorization is also useful in multi-variate calculus, wh ere\noperations can be performed on a vector of variables.\nThe choice of the programming language for numerical\ncomputing requires careful consideration. There are sever al\nsuitable candidates for this purpose including Python, Jav a,\nC++, Matlab, and others. Based on our experience with\ndifferent programming languages, we recommend the use of\nPython. Python is currently the most popular programming\nlanguage on the planet. It has a simple and intuitive syntax\nmaking it easy to learn and apply. Python has libraries to\nﬁt any purpose including an extensive collection of librari es\nrelated to numerical computing. The basic Python libraries\nrelated to computing are NumPy, SciPy, and SymPy. More\nadvanced packages such as OR-Tools are also available for\noptimization tasks. Since Python is a universal programmin g\nlanguage, it can be used for almost any task. Thus, students\nwho learn Python in their mathematics courses can employ\nit in their other courses. In addition, numerical computing\nimplemented in Python can be connected to other application s.",
    "V. C ONCLUSION\nAlthough the classical approach to teaching mathematics\nis still relevant for certain student cohorts, it is outdate d for\nengineering students. Modern engineering is increasingly re-\nliant on computing [9], [22]. Therefore, universities must equip\nthe student with appropriate computing skills. In particul ar,\nmathematics courses must be revised to include numerical\ncomputing content.\nGiven the efﬁciency of computer-based calculations, numer -\nical computing provides a convenient approach to problem\nsolving in engineering mathematics. It can be integrated in to\nthe existing curriculum with little hassle and cost. In this paper,\nwe proposed a framework for integrating numerical computin g\ninto the existing mathematics curriculum. We demonstrated\nhow numerical approaches can be used some of the most\ncommon problems encountered in calculus. The proposed\nframework can be customized by individual universities to ﬁ t\ntheir special needs.\nREFERENCES\n[1] Abdul Majid, M., Huneiti, Z., Balachandran, W., & Al-Naa fa, M. A.\n(2012) A study of the effects of using MATLAB as a pedagogical tool\nfor engineering mathematics students. 15th International Conference on\nInteractive Collaborative Learning (ICL), 10.1109/ICL.2 012.6402183,\nVillach, Austria.\n[2] Abdul Majid, M., Huneiti, Z. A., Balachandran, W., & Bala rabe, Y .\n(2013) MATLAB as a teaching and learning tool for Mathematic s: A\nliterature review. International Journal of Arts and Scien ces, 6(3), 23-44.\n[3] Brake, M. L. (2007) MATLAB as a Tool to Increase the Math Se lf-\nConﬁdence and the Math Ability of First-Year Engineering Te chnology\nStudents. The Scholarship of Teaching and Learning at EMU: V ol. 1,\nArticle 5.\n[4] Chen, J., Kolmos, A., & Du, X. (2021). Forms of implementa tion and\nchallenges of PBL in engineering education: a review of lite rature.\nEuropean Journal of Engineering Education, 46(1), 90-115.\n[5] Cretchley, P., Harman, C., Ellerton, N., & Fogarty, G. (2 000) MATLAB\nin Early Undergraduate Mathematics: An investigation into the Effects\nof Scientiﬁc Software on Learning. Mathematics Education R esearch\nJournal, 12(3), 219-233.\n[6] Hadgraft, R. G., & Kolmos, A. (2020). Emerging learning e nvironments\nin engineering education. Australasian Journal of Enginee ring Educa-\ntion, 25(1), 3-16.\n[7] Hernandez-de-Menendez, M., & Morales-Menendez, R. (20 19). Tech-\nnological innovations and practices in engineering educat ion: a review.\nInternational Journal on Interactive Design and Manufactu ring (IJIDeM),\n13(2), 713-728.\n[8] Hern´ andez-de-Men´ endez, M., Guevara, A. V ., Mart´ ıne z, J. C. T.,\nAlc´ antara, D. H., & Morales-Menendez, R. (2019). Active le arning in\nengineering education. A review of fundamentals, best prac tices and ex-\nperiences. International Journal on Interactive Design an d Manufacturing\n(IJIDeM), 13(3), 909-922.\n[9] Kamalov, F., Moussa, S., Zgheib, R., & Mashaal, O. (2020, December).\nFeature selection for intrusion detection systems. In 2020 13th Interna-\ntional Symposium on Computational Intelligence and Design (ISCID)\n(pp. 265-269). IEEE.\n[10] Kamalov, F., Sulieman, H., & Santandreu Calonge, D. (20 21). Machine\nlearning based approach to exam cheating detection. Plos on e, 16(8),\ne0254340.\n[11] Kilicman, A., Hassan, M. A., & Said Husain, S. K. (2010) T eaching and\nLearning using Mathematics Software ’The New Challenge’. P rocedia\nSocial and Behavioral Sciences, 8, 613-619.\n[12] Lorenz, M., R¨ ußmann, M., Strack, R., Lueth, K. L., & Bol le, M. (2015).\nMan and machine in industry 4.0: How will technology transfo rm the\nindustrial workforce through 2025. The Boston Consulting G roup, 2.\n[13] Maur´ ıcio, R. D. A., Veado, L., Moreira, R. T., Figueire do, E., & Costa,\nH. (2018). A systematic mapping study on game-related metho ds for\nsoftware engineering education. Information and software technology,\n95, 201-218.[14] Mezhennaya, N. M. & Pugachev, O. V . (2019) On perception of\ncomputer algebra systems and microsoft excel by engineerin g students.\nProblems on Education in the 21st Century, 77(3), 379-395.\n[15] Miranda, J., Navarrete, C., Noguez, J., Molina-Espino sa, J. M., Ram´ ırez-\nMontoya, M. S., Navarro-Tuch, S. A., ... & Molina, A. (2021). The core\ncomponents of education 4.0 in higher education: Three case studies in\nengineering education. Computers & Electrical Engineerin g, 93, 107278.\n[16] Moore, K., & Frazier, R. S. (2017). Engineering educati on for generation\nZ. American Journal of Engineering Education (AJEE), 8(2), 111-126.\n[17] Ortiz-Rojas, M., Chiluiza, K., & Valcke, M. (2019). Gam iﬁcation\nthrough leaderboards: An empirical study in engineering ed ucation.\nComputer Applications in Engineering Education, 27(4), 77 7-788.\n[18] Puhak, R. I. (2011). Teaching applied Calculus utilizi ng MATLAB,\nProceedings of the Twenty-Third Annual International Conf erence on\nTechnology in Collegiate Mathematics, ISBN 0-321-68984-4 , Copyright\n(C) 2012 by Pearson Education, Inc.\n[19] Ramirez-Mendoza, R. A., Morales-Menendez, R., Iqbal, H., & Parra-\nSaldivar, R. (2018, April). Engineering Education 4.0:—pr oposal for a\nnew Curricula. In 2018 IEEE Global Engineering Education Co nference\n(EDUCON) (pp. 1273-1282). IEEE.\n[20] Salah, B., Abidi, M. H., Mian, S. H., Krid, M., Alkhalefa h, H., &\nAbdo, A. (2019). Virtual reality-based engineering educat ion to enhance\nmanufacturing sustainability in industry 4.0. Sustainabi lity, 11(5), 1477.\n[21] Strayhorn, T. L. (2006). College in the information age : Gains associated\nwith students’ use of technology. Journal of Interactive On line Learning,\n5(2), 143-155.\n[22] Thabtah, F., Kamalov, F., & Rajab, K. (2018). A new compu tational\nintelligence approach to detect autistic features for auti sm screening.\nInternational journal of medical informatics, 117, 112-12 4.\n[23] Van den Beemt, A., MacLeod, M., Van der Veen, J., Van de Ve n,\nA., van Baalen, S., Klaassen, R., & Boon, M. (2020). Interdis ciplinary\nengineering education: A review of vision, teaching, and su pport. Journal\nof engineering education, 109(3), 508-555."
]