[
    {
        "element_id": "5dd8ab79-0d94-444e-987f-bb1aeef712bb",
        "metadata": {},
        "text": "Fuzzy logic based MPPT control for a PV system using SEPIC converter",
        "type": "NarrativeText"
    },
    {
        "element_id": "1a5c120a-d5d6-48e3-a40e-d125c1c570ce",
        "metadata": {},
        "text": "Moulay Abdellah Alhachemi Laboratory of CAOSEE Université Tahri Mohamed Bechar, Algeria alhachemi.abdellah@univ-bechar.dz",
        "type": "Title"
    },
    {
        "element_id": "00296b65-4cd0-405f-a767-8cc182de8b4d",
        "metadata": {},
        "text": "Mohammed Habbab Laboratoire de CAOSEE Université Tahri Mohamed Bechar, Algeria habbab.mohamed@univ-bechar.dz",
        "type": "Title"
    },
    {
        "element_id": "e7b3e2ae-0433-4508-ada3-ebd008b4a8d3",
        "metadata": {},
        "text": "Abdeldjebar Hazzab École de Technologie Supérieure (ETS) 1100 Notre-dame Montréal, Canada Hazzab.abdeldjebar@etsmtl.ca",
        "type": "Title"
    },
    {
        "element_id": "8ed9d9a6-1544-4d8f-8b37-8a3da55a4798",
        "metadata": {},
        "text": "Mansour Becahr Laboratory of CAOSEE Université Tahri Mohamed Bechar, Algeria bechar.mensour@univ-bechar.dz",
        "type": "Title"
    },
    {
        "element_id": "266d8969-68ac-43e3-8499-3e9f4dc92c51",
        "metadata": {},
        "text": "Hicham Gouabi École de Technologie Supérieure (ETS) 1100 Notre-dame Montréal, Canada hicham.gouabi.1@ens.etsmtl.ca",
        "type": "Title"
    },
    {
        "element_id": "b77812c5-72ff-4645-80c8-28c0153f4167",
        "metadata": {},
        "text": "Abstract—In this study, a novel single-ended primary inductor (SEPIC) converter-based fuzzy logic controller for maximum power point tracking is presented. By adding rules to the perturb and observing search strategy, the new controller enhances it while fuzzifying and removing its flaws. When compared to traditional maximum power point tracking techniques, fuzzy logic trackers enable an accurate and quick convergence to maximum power point under both steady-state and variable weather situations. The performance of the proposed maximum power point tracker is demonstrated in simulation.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c37e2001-4848-498e-8cc0-1c0a7b02e94e",
        "metadata": {},
        "text": "Keywords: Fuzzy logic controller (FLC), Maximum power point tracker (MPPT), Photovoltaic (PV)",
        "type": "Title"
    },
    {
        "element_id": "7fc27f0f-8585-4920-8245-ce8abe46ff9d",
        "metadata": {},
        "text": "I. INTRODUCTION",
        "type": "Title"
    },
    {
        "element_id": "5fe7f9c2-02d7-4d1a-89c2-d1ee6e77d771",
        "metadata": {},
        "text": "arrangement exchange; for that reason, the two types of converters should be excluded from maximum power applications. The boost converter has a nonstop input current, but the output voltage is always bigger than the input, which may not accomplish maximum power exchange operation in a few cases, such as when the maximum voltage is less than the input [3].",
        "type": "NarrativeText"
    },
    {
        "element_id": "0abd46b3-1385-4224-a84f-af35dd876ccd",
        "metadata": {},
        "text": "This paper presents a fuzzy-based P&O strategy for an MPPT standalone PV system. The proposed MPPT can abuse the preferences of the P&O strategy and eliminate its drawbacks. Output has been separated into five fuzzy subsets. As the proposed strategy continuously exchanges maximum power from PV arrays, it optimizes the number of PV modules.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c9b5cbcb-094f-4551-a884-3724c29dd2da",
        "metadata": {},
        "text": "The non-renewable energy sources are rapidly running out, while the electricity demand is increasing daily. To solve this problem, efficient and efficient electric power generation from renewable energy sources is required [1]. Renewable energy is one of the forms of energy that society can rely on because It is unpolluted, pure, and has no limits. One type of power generation that uses renewable energy is the photovoltaic (PV) system [2]. To utilize less conventional energy, the PV system must subsequently be linked to the grid, either directly or via a backup battery bank. Since the power produced by PV systems depends on radiation and temperature change, the PV framework has destitute productivity, [2].",
        "type": "NarrativeText"
    },
    {
        "element_id": "b918b956-3802-4b16-88fd-4bbd7e1d91f6",
        "metadata": {},
        "text": "II. MODELIGN OF PV SYSTEM",
        "type": "Title"
    },
    {
        "element_id": "7f8827db-0765-4f82-8566-64b8804a543b",
        "metadata": {},
        "text": "Photovoltaic is the technique and study connected to devices into electricity utilizing that directly convert sunlight photovoltaic semiconductors. Direct conversion of solar energy into DC electrical energy can be achieved by photovoltaic cells [4]. The photovoltaic panel is made up of numerous cells that are connected in series Ns or shunt Nsh. Where it may be mimicked by a current source coupled in parallel with a diode [5]. and depicted as described by",
        "type": "NarrativeText"
    },
    {
        "element_id": "2b0996dd-7723-46a6-8e9b-f4b4868e29b0",
        "metadata": {},
        "text": "in Figure 1",
        "type": "Title"
    },
    {
        "element_id": "430f2825-a557-4921-aa25-96aa9c462b84",
        "metadata": {},
        "text": "For the control of the PV systems, there are different sorts of DC-DC converters such as Buck converters, Boost converters, to its output pick-up and Buck-Boost converters. Due adaptability, a single-ended primary-inductor converter (SEPIC) acts as a buck-boost DC/DC converter, where it changes its output voltage agreeing to its duty cycle. Unlike the customary buck-boost converter, the SEPIC converter includes a non-inverted output and it uses an arrangement capacitor to separate input from output [3]. The buck and buck-boost converters lose half of their input control due to input current",
        "type": "NarrativeText"
    },
    {
        "element_id": "62be84e5-2c54-43e2-9ea2-3c7dcff9bfc4",
        "metadata": {},
        "text": "Fig. 1. Circuit for a PV array.",
        "type": "Title"
    },
    {
        "element_id": "58df8cca-7798-424f-917d-2b8c1beda7af",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "4c5b8f28-7a3c-4887-9aae-3da9d0698979",
        "metadata": {},
        "text": "The following equations provide the output current: I = Iph − ID (1)",
        "type": "NarrativeText"
    },
    {
        "element_id": "4dacbb6e-f097-4523-9bf6-e1301062e7b0",
        "metadata": {},
        "text": "I = Iph − I0 [exp (",
        "type": "Title"
    },
    {
        "element_id": "56969152-a8df-4e8a-ac65-e3421e67fa96",
        "metadata": {},
        "text": "q(V+RsI) AKBT",
        "type": "Title"
    },
    {
        "element_id": "62ce914c-2ba4-4953-ac3a-15c213271dcc",
        "metadata": {},
        "text": ") − 1] −",
        "type": "UncategorizedText"
    },
    {
        "element_id": "64237695-814d-4d34-bbf0-002c6818dc18",
        "metadata": {},
        "text": "V+RsI Rsh",
        "type": "Title"
    },
    {
        "element_id": "212d79c2-7e5e-4e0b-a11d-2f1c3d4a0ff9",
        "metadata": {},
        "text": "(2)",
        "type": "UncategorizedText"
    },
    {
        "element_id": "4bb2c023-b284-4173-b075-e960363c0c6a",
        "metadata": {},
        "text": "Iph ∶ Photo − current A ∶ Ideality factor KB ∶ Constant of Boltzmann T ∶ Cell temperature ID ∶ Current via a diode Rs ∶ Series resistance I0 ∶ Current of Saturation q ∶ Electronic charge Rsh ∶ Shunt resistance V ∶ Cell voltage I ∶ Current of cell",
        "type": "UncategorizedText"
    },
    {
        "element_id": "ee9e4ba5-0eba-4081-bb2b-b2a60355b52b",
        "metadata": {},
        "text": "The shunt resistance (Rsh) is typically orders of magnitude larger than the series resistance (Rs) [6]. Therefore, it is common for the shunt and series resistances of a solar cell can be neglected to simplify the model. The resulting ideal voltage- current characteristic of the solar cell is given by equation (3). ) − 1] (3) I = Iph − I0 [e(",
        "type": "NarrativeText"
    },
    {
        "element_id": "b40074c9-488d-47bf-a43c-e7f157a6d789",
        "metadata": {},
        "text": "qV KT",
        "type": "Title"
    },
    {
        "element_id": "c9e4c5ac-d48b-4d8a-add1-64f3f55a01af",
        "metadata": {},
        "text": "III. SEPIC CONVERTER",
        "type": "Title"
    },
    {
        "element_id": "5f92237f-b89a-4ee4-a352-27e26e91f652",
        "metadata": {},
        "text": "Power electronics researchers are working hard to create DC- DC converters with simpler designs and greater efficiency [7]. To maintain a constant output voltage, the suggested DC-to-DC converter employs a single-ended primary-inductor converter (SEPIC) architecture. The SEPIC converter is made up of a duty cycle switch S, a diode, two inductors (L1 and L2), two capacitors (C1 and C2), and a load resistor. Figure 2 depicts the circuit diagram of a SEPIC converter. A SEPIC is a DC-DC converter [8]. SEPIC are DC-DC converters that can output voltages that are B, larger than, or equal to the input voltage. The duty cycle of the control transistor affects the SEPIC converter's output voltage. The SEPIC converter is two converters in one: a boost converter followed by a buck-boost converter. It has the advantages of having a non-inverted output (the output voltage has the same polarity as the input voltage) , using a series capacitor to couple energy from the input to the output (which makes it more responsive to short-circuits), and being able to shut down completely: when the switch \"S\" is turned off, the output voltage drops to 0 V, accompanied by a significant transient discharge of charge.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1cacb0e1-e2ed-4a7c-a3fc-e5de00a3ba37",
        "metadata": {},
        "text": "Fig. 2. Simple circuit diagram of the SEPIC converter",
        "type": "Title"
    },
    {
        "element_id": "f4a7b221-8dcd-455f-9c46-f15ce34fdea8",
        "metadata": {},
        "text": "Figure 3 depicts the circuit when the power switch is switched on and off (in Figures a and b, respectively). Figure 3a When",
        "type": "NarrativeText"
    },
    {
        "element_id": "22c6ac3d-b87f-4f37-be9a-3df9248cc1cb",
        "metadata": {},
        "text": "the switch is on, the first inductor, L1 is charged from the input voltage source. The second inductor L2 absorbs energy from the first capacitor C1, leaving the output capacitor C2 to supply the load current.",
        "type": "NarrativeText"
    },
    {
        "element_id": "3bc25975-39e0-4f4d-9fc0-b77804123f3a",
        "metadata": {},
        "text": "Fig. 3.a. The switch turned on.",
        "type": "NarrativeText"
    },
    {
        "element_id": "c0adf019-2707-4a41-90cd-be6d334062e5",
        "metadata": {},
        "text": "Fig. 3.b. The switch turned off. Fig. 3. Equivalent circuit diagram of the SEPIC converter when the switch is on and off.",
        "type": "NarrativeText"
    },
    {
        "element_id": "261431e9-7c8e-433b-8179-d9329ae560f2",
        "metadata": {},
        "text": "When the switch is turned on, the input inductor is charged from the source, and the second inductor is charged from the first capacitor. No energy is supplied to the load capacitor during this time. The inductor current and capacitor voltage polarities are marked in this Figure. When the power switch is turned off, the energy stored in the inductor is transferred. The energy stored is transferred through the diode and supplies the energy to the load [10], as shown in Figure 3. b. The second inductor is also connected to the load during this time. The output capacitor sees a pulse of current during the off time, making it inherently noisier than a buck converter. The amount that the SEPIC converters increase or decrease the voltage depends primarily on the duty cycle and the parasitic elements in the circuit. The output of an ideal SEPIC converter is:",
        "type": "NarrativeText"
    },
    {
        "element_id": "7d42dce0-e344-4cac-b7f5-87a16f42200b",
        "metadata": {},
        "text": "Vout =",
        "type": "Title"
    },
    {
        "element_id": "835e0628-2ac7-411a-b591-8d9092c951f5",
        "metadata": {},
        "text": "D",
        "type": "Title"
    },
    {
        "element_id": "4d7210a1-22d5-4587-a2ff-8daf78f67f71",
        "metadata": {},
        "text": "1−D",
        "type": "UncategorizedText"
    },
    {
        "element_id": "884e59e2-041c-4970-8442-cc8dba3645bc",
        "metadata": {},
        "text": "Vin (4)",
        "type": "Title"
    },
    {
        "element_id": "009698e1-1346-46d2-a90b-626b482913db",
        "metadata": {},
        "text": "A SEPIC converter is to process the electricity from the PV system. This converter either increases or decreases the PV system voltage at the load. The proposed SEPIC converter operates in buck mode.",
        "type": "NarrativeText"
    },
    {
        "element_id": "cee9d109-8376-47b0-b324-ba8726a5d857",
        "metadata": {},
        "text": "IV. FUZZY LOGIC CONTROL",
        "type": "Title"
    },
    {
        "element_id": "92d7fc55-3162-4b88-8d8b-f9e97de897e4",
        "metadata": {},
        "text": "In the fuzzy logic maximum power point tracking (MPPT) algorithm, the voltage and current at each instant k are measured to calculate the active power. The active power is then compared with the power at the previous instant (k-1) to obtain the change in power (ΔP(k)). Similarly, the voltage at instant k is compared with the voltage at instant k-1 to obtain",
        "type": "NarrativeText"
    },
    {
        "element_id": "9e8b8707-2baf-4e36-9063-4cb674b6985f",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "01b68046-8753-4254-a039-7b949b4aeca1",
        "metadata": {},
        "text": "the voltage error (ΔV(k)) [11]. The power error is then divided by the current error to obtain the error (E). The error is then compared with the previous error to calculate the change in error (ΔE(k)). The error (E(k)) and the change in error (ΔE(k)) are then used as the crisp inputs to the fuzzy logic controller. The flow chart for the fuzzy logic MPPT algorithm is shown in Figure 4. In this work, the Mamdani inference technique, A- type membership functions, and a 25-element rule base were used for the fuzzy logic control. The Mamdani inference technique is efficient and straightforward in defining the fuzzy output sets, and it is more popular among researchers than other inference triangular membership function is used because it is simpler to split into low and high membership functions (MFs) than other membership functions. Additionally, it has been observed that the triangular membership function has a faster response and less overshoot than other functions [13]. A 25-element rule base was used because it has been shown to perform well [14][15].",
        "type": "NarrativeText"
    },
    {
        "element_id": "72352997-682a-4e73-9015-47b365a54f45",
        "metadata": {},
        "text": "techniques",
        "type": "Title"
    },
    {
        "element_id": "ddd079fa-0cf3-4787-9620-ec90a2cb917d",
        "metadata": {},
        "text": "[12]. The A-type or",
        "type": "Title"
    },
    {
        "element_id": "a57753b1-033f-4289-aa8f-25685b521e35",
        "metadata": {},
        "text": "Fig. 4. Fuzzy logic maximum power point tracking (MPPT) flow chart.",
        "type": "NarrativeText"
    },
    {
        "element_id": "44df4a38-a65d-4cf6-b43d-524acd203438",
        "metadata": {},
        "text": "The following are the fuzzy rules in Table 1, which are used for the desired MPP of push-pull converter PWM. The membership for input variables (DPpv, DVpv) are shown in Figure 5, and the membership for output variable (DVpv*) is shown in Figure 6. All the functions are defined on a normalized interval [-1 1].",
        "type": "NarrativeText"
    },
    {
        "element_id": "71796908-fa0c-4001-83cf-84657ab557d4",
        "metadata": {},
        "text": "Table. 1. Fuzzy logic rules for the push-pull converter. NB, negative big; NS, negative small; ZE, zero; PS, positive small; PB, positive big.",
        "type": "NarrativeText"
    },
    {
        "element_id": "554e6d3d-de7c-41ee-9bd5-742214cc8ee1",
        "metadata": {},
        "text": "∆Vpv*[o/p]",
        "type": "Title"
    },
    {
        "element_id": "9fe8d918-91c7-4ab1-8f2b-af98e43c9b9a",
        "metadata": {},
        "text": "∆Vpv*[i/p]",
        "type": "Title"
    },
    {
        "element_id": "c5edde52-e45a-4a6b-863a-4c99fe8868d6",
        "metadata": {},
        "text": "NB",
        "type": "Title"
    },
    {
        "element_id": "738b36f8-dde1-4de5-867a-4342994d414d",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "3c2a2498-f0f6-41b3-b396-bf910bcdf11f",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "01b12839-3d44-4521-bcfa-9a7287367275",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "de8666b1-f735-4c39-b4b1-18e1949c2379",
        "metadata": {},
        "text": "PB",
        "type": "Title"
    },
    {
        "element_id": "d1315cbf-9710-466b-a8c8-0c896d719fab",
        "metadata": {},
        "text": "NB",
        "type": "Title"
    },
    {
        "element_id": "87279a0d-7b7c-4b84-b774-50d748ac6a44",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "4c98810e-1933-40db-9644-4e4bef34c7f8",
        "metadata": {},
        "text": "NB",
        "type": "Title"
    },
    {
        "element_id": "ab36c23e-37e3-4351-8f11-a721de0b45c8",
        "metadata": {},
        "text": "NB NB NS",
        "type": "Title"
    },
    {
        "element_id": "f8b858c8-1485-40f5-980d-dea2df47abc7",
        "metadata": {},
        "text": "∆Ppv*[i/p]",
        "type": "Title"
    },
    {
        "element_id": "983835aa-787c-4919-b859-52acf59de9f0",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "bb6d159a-1a07-4a22-8c09-989a65190713",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "f184719d-176c-46fb-8ea4-caa7496b378c",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "f33d9323-e1f7-4439-a1f4-f8fc1d32613a",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "848c266b-4ca5-4165-94bd-5ce15fb602b6",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "76fddc68-2916-4d14-ab6f-af3c2579a3ba",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "50f27a82-725a-475f-8c79-43dba94135a5",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "64c0ebca-d9dc-48e8-9269-c9d038bc101a",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "96f15807-402a-4e92-9e57-a703f635e5a3",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "66112c14-7f8f-489f-9778-94abbc768ab7",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "79862ebe-8e46-4868-896c-b25e83893687",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "c0e9aeb2-6b45-444b-9ca2-5ff2fe5426db",
        "metadata": {},
        "text": "ZE",
        "type": "Title"
    },
    {
        "element_id": "96314909-31e6-44e8-9f4d-ef092937da70",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "8a2b93b3-8714-40bc-930a-5c7c987de51a",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "9f648fab-0896-4be4-8217-86a053905d4e",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "73766867-b214-4449-a0ee-acefa910d872",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "23e3f29c-5f79-4171-8f4d-95a0592ded90",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "5e25c792-9f4e-47c1-b713-822d80fe2106",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "bbb0e743-6272-49ad-8932-76d828f2099c",
        "metadata": {},
        "text": "PB",
        "type": "Title"
    },
    {
        "element_id": "a6e02b6e-db76-4ada-a4c0-d5eb3558d396",
        "metadata": {},
        "text": "NS",
        "type": "Title"
    },
    {
        "element_id": "07027506-3501-4da6-841d-dd36041812bd",
        "metadata": {},
        "text": "NB",
        "type": "Title"
    },
    {
        "element_id": "e1ea26e0-d7fc-47e7-ab79-cce3a17ef9ab",
        "metadata": {},
        "text": "PB",
        "type": "Title"
    },
    {
        "element_id": "b9222458-a284-445c-b44d-add45e509c75",
        "metadata": {},
        "text": "PB",
        "type": "Title"
    },
    {
        "element_id": "00b90418-3f88-4d09-a945-b5393e815f3a",
        "metadata": {},
        "text": "PS",
        "type": "Title"
    },
    {
        "element_id": "375f0adb-6d6e-4b23-b118-c4b1cb8b1d27",
        "metadata": {},
        "text": "Fig. 5. Membership for input variables.",
        "type": "Title"
    },
    {
        "element_id": "0895e495-4b4e-45a7-bf68-e48a9629479a",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "00591b5b-386b-42a8-9067-006870a236dd",
        "metadata": {},
        "text": "Fig. 6. Membership for output variable.",
        "type": "Title"
    },
    {
        "element_id": "f60b8e03-9996-4838-bffd-f30b6cfd8b4a",
        "metadata": {},
        "text": "V. SIMULATION RESULTS",
        "type": "Title"
    },
    {
        "element_id": "78575106-c1da-43c9-bb57-23816edfb29e",
        "metadata": {},
        "text": "The characteristics of the photovoltaic array that we use in this paper are given in Table 2.",
        "type": "NarrativeText"
    },
    {
        "element_id": "48cb33af-c5b3-4ba1-9850-1324d360b08f",
        "metadata": {},
        "text": "Table. 2. Electrical data of photovoltaic array.",
        "type": "Title"
    },
    {
        "element_id": "effa1847-b087-413a-9b7e-d4c97a3b24ab",
        "metadata": {},
        "text": "Variable",
        "type": "Title"
    },
    {
        "element_id": "5601421e-2a19-4a3b-a0f6-eaf0910e3d7a",
        "metadata": {},
        "text": "Value",
        "type": "Title"
    },
    {
        "element_id": "3580a85d-9b56-4fd7-972d-fe2359eb9e02",
        "metadata": {},
        "text": "Maximum Power",
        "type": "Title"
    },
    {
        "element_id": "2cbb4552-7630-473a-85e5-d9da2c3394a5",
        "metadata": {},
        "text": "Open circuit voltage",
        "type": "Title"
    },
    {
        "element_id": "c9d8e6c1-b2c5-4db5-8687-065055da6037",
        "metadata": {},
        "text": "Short circuit current",
        "type": "Title"
    },
    {
        "element_id": "4159b67e-6394-466a-a348-7b9b026f8e48",
        "metadata": {},
        "text": "Pmax = 200 W Voc = 36.1 V Isc = 200 A",
        "type": "Title"
    },
    {
        "element_id": "162d10fa-cd79-4e7d-b407-288efe7a42a6",
        "metadata": {},
        "text": "Voltage at maximum power",
        "type": "Title"
    },
    {
        "element_id": "adb3aa79-9bb4-4aa3-bc97-9cacddabd91c",
        "metadata": {},
        "text": "Current at maximum power",
        "type": "Title"
    },
    {
        "element_id": "017b3825-beaa-476b-b1d6-510d5eaf689b",
        "metadata": {},
        "text": "Vmax = 29.3 V Imax = 6.9 A",
        "type": "Title"
    },
    {
        "element_id": "8cb5b767-8de7-4b94-b84d-c062de813002",
        "metadata": {},
        "text": "Table 3 shows the SEPIC converter settings utilized in this study. The SEPIC converter is linked to the PV panel in the full model, and the duty cycle is regulated by the Fuzzy Logic Controller.",
        "type": "NarrativeText"
    },
    {
        "element_id": "92a53f35-a426-492a-944e-eb9b045b598e",
        "metadata": {},
        "text": "Table. 3. The SEPIC converter parameters.",
        "type": "Title"
    },
    {
        "element_id": "aa8dcbdb-d547-4c79-a75b-626366e90799",
        "metadata": {},
        "text": "Variable Switching frequency",
        "type": "Title"
    },
    {
        "element_id": "c1da739d-41fe-44be-bcc5-51bf389fb8f9",
        "metadata": {},
        "text": "Value 20 KHZ",
        "type": "Title"
    },
    {
        "element_id": "80904cf5-b781-4710-90c2-6cf1f69851e7",
        "metadata": {},
        "text": "Load resistance",
        "type": "Title"
    },
    {
        "element_id": "792f5678-d829-418b-a714-d6fada18cb6a",
        "metadata": {},
        "text": "RLoad= 4.29 Ω",
        "type": "Title"
    },
    {
        "element_id": "7365c5d4-b753-428e-96a3-c34e6ffe70e9",
        "metadata": {},
        "text": "Inductance L1",
        "type": "Title"
    },
    {
        "element_id": "99dbe5a8-e839-430d-b24f-78febc319408",
        "metadata": {},
        "text": "L1 = 3.6 MH",
        "type": "UncategorizedText"
    },
    {
        "element_id": "af52b470-afad-423b-8990-c131df1c6b6a",
        "metadata": {},
        "text": "Inductance L2",
        "type": "Title"
    },
    {
        "element_id": "6eff6df6-8b87-44f8-bb30-d18eb0b4a105",
        "metadata": {},
        "text": "L2 = 0.9 MH",
        "type": "UncategorizedText"
    },
    {
        "element_id": "98f423ca-457a-44ef-8311-0ed40a2f558e",
        "metadata": {},
        "text": "Capacitor C1",
        "type": "Title"
    },
    {
        "element_id": "5cb076cd-c4b1-4c41-9f22-09a76d613867",
        "metadata": {},
        "text": "C1 = 180 µF",
        "type": "UncategorizedText"
    },
    {
        "element_id": "d28b4883-2941-458f-8dd2-7a8532426742",
        "metadata": {},
        "text": "Capacitor C2",
        "type": "Title"
    },
    {
        "element_id": "0cba499d-82b9-4947-9fcf-b788818db226",
        "metadata": {},
        "text": "C2 = 6000 µF",
        "type": "UncategorizedText"
    },
    {
        "element_id": "f4d3e3da-3902-484c-a8b6-e3e266aab689",
        "metadata": {},
        "text": "The results are provided under standard test conditions; G=1000 W/m2; T=25°C and it is shown in figure 7.",
        "type": "NarrativeText"
    },
    {
        "element_id": "22b00184-cf21-4467-aca3-ef077ef00bef",
        "metadata": {},
        "text": "Fig. 7.a. Current.",
        "type": "Title"
    },
    {
        "element_id": "40a30961-b899-4acd-913e-0f06ed6749ab",
        "metadata": {},
        "text": "Fig. 7.b. Voltage.",
        "type": "Title"
    },
    {
        "element_id": "8f087ff9-aae3-4996-8063-e7e678c7f959",
        "metadata": {},
        "text": "Fig. 7.c. Power. Fig. 7. Voltage, current, and power output results; at G=1000 W/m2 and T=25°C.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "fa0fef54-fe19-4cf1-bac6-66e5764ab868",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    },
    {
        "element_id": "cbed4ca2-b06a-4fef-a5f2-bc3e79433071",
        "metadata": {},
        "text": "Overall, using MPPT and fuzzy logic to a SEPIC converter for a PV system result in considerable performance gains. Increased power output, higher efficiency, decreased ripple, enhanced transient response, and resilience are examples of these enhancements.",
        "type": "NarrativeText"
    },
    {
        "element_id": "b281c37c-aafc-419e-87d8-27992ea355fa",
        "metadata": {},
        "text": "Ⅵ. CONCLUSIONS This paper presents the design of an off-grid photovoltaic system with a fuzzy logic MPPT-controlled push-pull boost converter. The proposed in tested under various weather MATLAB/Simulink and conditions. The results showed that the fuzzy logic algorithm outperformed the conventional algorithms in terms of MPPT accuracy and minimization of fluctuations, regardless of rapid changes in irradiance.",
        "type": "NarrativeText"
    },
    {
        "element_id": "f7d56186-160f-4f0c-b5a1-105b1b48de2c",
        "metadata": {},
        "text": "system was",
        "type": "NarrativeText"
    },
    {
        "element_id": "0fcc145b-fb12-459e-bb77-81249142ac3f",
        "metadata": {},
        "text": "simulated",
        "type": "Title"
    },
    {
        "element_id": "202b0555-a860-409a-bc11-dba0d7a00d1e",
        "metadata": {},
        "text": "REFERENCES",
        "type": "Title"
    },
    {
        "element_id": "54163f1f-6b56-45ab-9999-8593931aff86",
        "metadata": {},
        "text": "[1] G. Mahendran, and KV. Kandaswamy. “Ant Colony Optimized Tuned DC-DC converter.” International Journal of Computer Applications (0975–8887) 108.11 (2013): 45-50. J. Dunia, and BMM Mwinyiwiwa. “Performance Comparison between ĆUK and SEPIC Converters for Maximum Power Point Tracking Using Incremental Conductance Technique in Solar Power Applications.” International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 7.12 (2013): 2510-2517.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1bb64d0a-4286-4c27-9fa0-13c39e975a91",
        "metadata": {},
        "text": "[2]",
        "type": "UncategorizedText"
    },
    {
        "element_id": "90bb18df-9dcc-4b7d-ac71-adf4b9618a71",
        "metadata": {},
        "text": "[3] M. Cirrincione, M. Pucci, and G. Vitale, “Growing Neural Gas (GNG)- Based Maximum Power Point Tracking for High-Performance Wind Generator With an Induction Machine.” IEEE Transactions on Industry Applications 47.2 (2011): 861-872.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "b8919adb-7f0d-49e3-b347-436810a91510",
        "metadata": {},
        "text": "[4] M. Abdulkadir, AS. Samosir, S., and AHN. Yatim. “Modeling and Simulation of a Solar Photovoltaic System, Its Dynamics and Transient Characteristics in LABVIEW.\" International Journal of Power Electronics and Drive System (IJPEDS) 3.2 (2013): 185-192.",
        "type": "NarrativeText"
    },
    {
        "element_id": "092b4708-a712-4d8d-af3c-bbd95f2a7326",
        "metadata": {},
        "text": "[5] H. Bouzeria, C. Fetha, T. Bahi, I. Abadlia, Z. Layate, and S. Lekhchine. “Fuzzy Logic Space Vector Direct Torque Control of PMSM for Photovoltaic Water Pumping System.” Energy Procedia 74 (2015): 760- 771.",
        "type": "NarrativeText"
    },
    {
        "element_id": "e472b1f5-23e5-4797-8402-9c454e864d5b",
        "metadata": {},
        "text": "[6] YM. Chen, YC. Liu, SC. Hung, and CS. Cheng. “Multi-Input Inverter for Grid-Connected Hybrid PV/Wind Power System.” IEEE Transactions on Power Electronics 22.3 (2007): 742-750.",
        "type": "NarrativeText"
    },
    {
        "element_id": "81630ffb-b82c-40fe-b99f-bf9a31ae6a3c",
        "metadata": {},
        "text": "[7] S. Ganesh, J. Janani, and GB. Angel. “A Maximum Power Point Tracker for PV Panels Using SEPIC Converter.”International Journal of Electrical, Computer, Energetic, Electronic and Communication Engineering 8.2 (2014): 637-642.",
        "type": "NarrativeText"
    },
    {
        "element_id": "1af40482-8416-4331-880f-9276ffe763ad",
        "metadata": {},
        "text": "[8] R. Vijayabalan, and S. Ravivarman. “Z Source Inverter for Photovoltaic System with Fuzzy Logic Controller.” International Journal of Power Electronics and Drive System (IJPEDS) 2.4 (2012): 371-379.",
        "type": "NarrativeText"
    },
    {
        "element_id": "99c337b0-bf9f-426a-9dd8-d050e52197f1",
        "metadata": {},
        "text": "[9] A. Ramkumar, and SVS. Florence. \"Analysis of Single Phase AC-DC SEPIC Converter using Closed Loop Techniques.” International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering 4.2 (2015): 193-201.",
        "type": "NarrativeText"
    },
    {
        "element_id": "0f1652bd-de47-4e2f-8982-5c837fe7d8ad",
        "metadata": {},
        "text": "[10] G. Tadi, and P. Ramamurthyraju. “Analysis of SEPIC for PV- Applications using PI Controller and Current Mode Control.\" International Journal for Scientific Research & Development 1.9 (2013): 175-180.",
        "type": "NarrativeText"
    },
    {
        "element_id": "de69ccc0-ada4-4b14-a083-42d3a66c6749",
        "metadata": {},
        "text": "[11] J. Li, and H. Wang. “A novel stand-alone PV generation system based on variable step size INC MPPT and SVPWM control.\" In Proceedings of",
        "type": "NarrativeText"
    },
    {
        "element_id": "db40c664-056e-410c-9632-ffdf4791169a",
        "metadata": {},
        "text": "the 2009 IEEE 6th International Power Electronics and Motion Control Conference, Wuhan, China, 17-20 May 2009. pp. 2155-2160.",
        "type": "UncategorizedText"
    },
    {
        "element_id": "98393a86-cf81-4b73-bae8-5357729dc60e",
        "metadata": {},
        "text": "[12] C. Wang. “A Study of Membership Functions on Mamdani-Type Fuzzy Inference System for Industrial Decision-Making.” Master's thesis, Lehigh University, Bethlehem, PA, USA, 2015.",
        "type": "NarrativeText"
    },
    {
        "element_id": "053ce313-bea5-4af6-a79b-e3177ffd9ad8",
        "metadata": {},
        "text": "[13] MA. Usta, Ö. Akyazi, and İH. Altaş. “Design and performance of solar tracking system with fuzzy logic controller used different membership functions.” In Proceedings of the 2011 7th International Conference on Electrical and Electronics Engineering (ELECO), Bursa, Turkey, 1-4 December 2011. pp. II-381-II-385.Mudi, R.K.; Pal, N.R. A robust self- tuning scheme for PI-and PD-type fuzzy controllers. IEEE Trans. Fuzzy Syst. 1999, 7, 2–16.",
        "type": "NarrativeText"
    },
    {
        "element_id": "48b2c978-a642-4600-a1de-2a6f52474f7a",
        "metadata": {},
        "text": "[14] RK. Mudi, and NR. Pal. “A robust self-tuning scheme for PI- and PD-",
        "type": "NarrativeText"
    },
    {
        "element_id": "7197a6ac-ed31-45ef-a270-e423ff7f774b",
        "metadata": {},
        "text": "type fuzzy controllers.” IEEE Transactions on Fuzzy Systems 7.1 (1999): 2-16.",
        "type": "Title"
    },
    {
        "element_id": "fa238431-5e5b-4f64-bfa1-1d39357e806c",
        "metadata": {},
        "text": "[15] A. Shehata, H. Metered, and WAH. Oraby. “Vibration control of active vehicle suspension system using fuzzy logic controller.” In Vibration Engineering and Technology of Machinery, edited by W. A. Oraby, 389- 399. Springer, Berlin, Heidelberg, 2015.",
        "type": "NarrativeText"
    },
    {
        "element_id": "ac6d2ecc-e1d6-49ed-9aa5-db39b52aab6b",
        "metadata": {},
        "text": "",
        "type": "PageBreak"
    }
]